[
    {
        "name": "Mission Briefing — Operation Silent Crown",
        "pages": [
            {
                "name": "Briefing",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<div class=\"doz-vox-transmission\"><div class=\"vox-classification\">CLASSIFIED — VERMILLION LEVEL</div><div class=\"vox-header\">ORDO MALLEUS — OPERATIONAL DIRECTIVE<br><span class=\"vox-timestamp\">PRIORITY: MAJORIS | REF: OPERATION SILENT CROWN</span></div><div class=\"vox-body\"><p>FROM: Inquisitor Aldric Thorne, Ordo Malleus, Segmentum Obscurus Conclave</p><p>TO: Assigned Acolyte Cell [DESIGNATION REDACTED]</p><p>RE: Operation SILENT CROWN — Investigation of Anomalous Void-Vessel, Noctis Subsector</p><p>DATE: [<span class=\"vox-redacted\">REDACTED</span>].M41</p><p>+++</p><p><strong>Acolytes,</strong></p><p>You are hereby assigned to Operation SILENT CROWN under my direct authority. Read this briefing in its entirety. Commit it to memory. Then destroy the physical copy. The data-packet appended to this document may be retained on a secured data-slate with appropriate ciphers engaged.</p><p><strong>SITUATION:</strong></p><p>Twelve days ago, a void-ship of unknown origin translated from the warp into the Noctis Subsector at coordinates consistent with the Vorostokov Reach. The vessel is broadcasting a repeating distress signal on Imperial frequencies. The signal is centuries old. The ship matches no active registry in the Administratum's records.</p><p>Long-range auspex scans are inconclusive. The vessel appears to be of Imperial manufacture — a light transport or cargo hauler, designation class uncertain — but its warp signature is profoundly anomalous. It radiates empyric energy at levels inconsistent with a ship that has merely traversed the Immaterium. Naval picket vessels dispatched to establish visual contact report the following: the ship is structurally intact, shows no signs of weapons damage or hostile action, but is not responding to hails. Its running lumens flicker in irregular patterns. Its void-shields are inactive. Its hull is... wrong. The picket commander's exact words were: <em>\"It looks like it's breathing.\"</em></p><p>The vessel's point of translation is significant. It corresponds precisely to the last known vector of ships bound for the Barovus system — a formerly compliant Imperial world that has been non-communicative for approximately three hundred standard years. Seven investigative missions have been dispatched to Barovus over the intervening centuries. None have returned. The most recent of these, dispatched forty-seven years ago under the command of my colleague Inquisitor Rudolph Van Richten of the Ordo Malleus, vanished without trace. Van Richten is listed as PRESUMED KILLED IN ACTION. His last astropathic fragment, received in a corrupted state, contained the following decoded words: <em>STABLE RIFT. CANNOT EXIT. GOVERNOR COMPROMISED. WARP ENTITY CLASS UNKNOWN.</em></p><p>This vessel may be connected to the Barovus anomaly. It may contain intelligence about the fate of the lost expeditions. Or it may be something else entirely. You are being sent to find out.</p><p><strong>OBJECTIVES:</strong></p><p><strong>Primary:</strong> Board the anomalous vessel. Determine its origin, the status of its crew, the nature of its warp signature, and why it has appeared now. Assess whether it poses a threat to the subsector.</p><p><strong>Secondary:</strong> Recover any intelligence pertaining to the Barovus system, the fate of Inquisitor Van Richten, or the nature of the warp anomaly associated with that region. Any data recovered from ship cogitators, crew logs, or personal effects is to be preserved.</p><p><strong>Tertiary:</strong> Recover any Imperial assets of strategic or spiritual value. If the vessel is of Chaos origin or taint, document everything and withdraw. Do NOT attempt to commandeer the vessel without explicit authorisation.</p><p><strong>Standing:</strong> Observe standard Chaos exposure protocols at all times. The vessel's anomalous warp signature suggests empyric contamination. Full carapace armour with sealed rebreathers is recommended for boarding operations. Monitor each other for signs of corruption. If any member of your cell demonstrates evidence of warp taint beyond acceptable thresholds, you are authorised — and expected — to take appropriate action.</p><p><strong>INTELLIGENCE SUMMARY:</strong></p><p>What follows is the totality of reliable intelligence regarding the anomalous vessel and its potential connection to the Barovus system.</p><ul><li>The vessel translated from the warp at coordinates 447.331.Noctis, corresponding to the Vorostokov Reach. This is the last known approach vector for ships entering the Barovus system.</li><li>The distress signal is encoded in standard Imperial military frequencies and is approximately 280 standard years old. It repeats a single phrase: <em>\"Emperor preserve us. Do not board this ship.\"</em></li><li>Auspex returns from the vessel are contradictory. Mass readings suggest a crew complement of 30-50, but bio-signs are absent. The ship's warp drive appears to be active at low power despite no visible fuel source or functioning plasma reactor.</li><li>The Barovus system was a Class II feudal/agri-world under the governance of Lord-Governor Strahd von Zarovich. It went silent approximately 300 years ago. Auspex scans of the system's last known coordinates return readings consistent with a localised warp disturbance of unknown nature.</li><li>Three of the seven prior investigation missions to Barovus transmitted partial data before contact was lost. Common elements include: references to dense fog, navigation failure, Gellar field instability, and a pervasive psychic presence described as <em>\"watchful.\"</em></li><li>Inquisitor Van Richten's fragmented transmission is the only direct intelligence suggesting the involvement of a warp entity. Insufficient data to determine its nature.</li></ul><p><strong>OPERATIONAL NOTES:</strong></p><p>Your transport will be the frigate <em>Dawn's Reproach</em>, commanded by Captain Hera Voss. She will deliver you to the anomalous vessel's location and maintain a holding pattern at safe distance. You will board the derelict via shuttle. If you have not re-established contact within forty-eight standard hours of boarding, the <em>Dawn's Reproach</em> will withdraw and report your loss.</p><p>You are NOT authorised to make pacts, bargains, or agreements with any warp entity, regardless of what it offers. This is not a suggestion. This is an order. The penalty for violation is death and post-mortem excommunication.</p><p>I will be direct with you: the distress signal says not to board the ship. I am ordering you to board it anyway. That is the nature of our work. The Imperium does not have the luxury of ignoring things that frighten it. Something has emerged from the region of space where seven expeditions and a full Inquisitorial task force vanished. We must know what it is.</p><p>Carry your faith as your shield. Trust in each other. And if the ship proves to be what I suspect it is — a lure — then be ready for the possibility that your mission may change dramatically once you are aboard.</p><p>The Emperor Protects.</p><p><strong>Inquisitor Aldric Thorne</strong><br><em>Ordo Malleus, Segmentum Obscurus Conclave</em><br><em>By the Authority of the Holy Ordos of His Most Divine Emperor's Inquisition</em></p></div><div class=\"vox-footer\">INQUISITORIAL SEAL VERIFIED | THORNE.A | ORD.MAL</div><div class=\"vox-seal\">⦿ ORDO MALLEUS ⦿</div></div>"
                },
                "_id": "c2d805a7eaf44eee"
            },
            {
                "name": "GM Notes",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>GM Notes — Handout 1: Mission Briefing</h2><h3>When to Give This Handout</h3><p>Present this briefing at <strong>Session 0</strong> (as pre-game reading) or at the <strong>very start of Session 1</strong>, before the Acolytes board the Vessel of Lament. Ideally, hand it out during the opening scene aboard the <em>Dawn's Reproach</em> while the Acolytes review their case file and interact with the crew. The briefing establishes the mission's official scope and the Ordo's institutional voice — clinical, authoritative, and incomplete.</p><h3>What the Briefing Reveals</h3><ul><li>A derelict vessel has appeared at the edge of a known warp anomaly, broadcasting a centuries-old Imperial distress signal.</li><li>The anomaly (Theta-VII-Sigma) is flagged for persistent reality instability — this is not a routine salvage operation.</li><li>Three previous survey craft have been lost investigating the anomaly's periphery.</li><li>The Acolytes' ship, the <em>Dawn's Reproach</em>, will hold position at a safe distance while they board the derelict.</li><li>Standard extraction protocols are in effect — the Acolytes have no reason to suspect they will not be coming back.</li></ul><h3>What Is Redacted — And Why It Matters</h3><table><thead><tr><th>Redaction</th><th>Actual Information</th><th>Why It's Hidden</th></tr></thead><tbody><tr><td>Subsector name</td><td>The <strong>Noctis Subsector</strong>, near the Halo Stars in the Segmentum Obscurus</td><td>Thorne does not want the Cell researching the region independently — too many sealed Inquisitorial files</td></tr><tr><td>Signal age</td><td>Approximately <strong>340 years</strong> — dating to the era when Barovus went silent</td><td>Revealing the signal's true age would invite questions about the Barovus system that Thorne is not ready to answer</td></tr><tr><td>Lost expeditions</td><td><strong>Seven</strong> total expeditions lost, not just three survey craft — the briefing understates the threat</td><td>If the Acolytes knew the full casualty count, they might refuse the mission or demand significantly more resources</td></tr></tbody></table><h3>GM Secrets — What Thorne Knows</h3><ul><li><strong>Thorne suspects a connection to Barovus.</strong> The derelict's translation coordinates match the last known approach vector for ships entering the Barovus system. Thorne has cross-referenced this data but does not share his conclusions with the Cell. He wants unbiased observers.</li><li><strong>The <em>Dawn's Reproach</em> will be pulled away.</strong> Once the Acolytes board the Vessel of Lament, warp currents will surge and drag their ship to a safe distance — effectively stranding them on the derelict. Thorne may or may not have anticipated this. If he did, it makes the Acolytes expendable reconnaissance.</li><li><strong>Thorne's true agenda:</strong> He needs intelligence on the Barovus anomaly and the fate of Inquisitor Van Richten. The Cell is a probe — sent to gather data that more senior assets can act on later. Whether he genuinely expects them to survive is an open question the GM can decide based on the tone they want to set.</li><li><strong>Extraction is a lie.</strong> \"Standard extraction protocols apply\" implies the <em>Dawn's Reproach</em> will be waiting. It will not. The 96-hour torpedo bombardment contingency mentioned in the full briefing (Appendix D) will never trigger — the ship cannot re-enter the anomaly's boundary.</li></ul><h3>Player Questions to Anticipate</h3><table><thead><tr><th>Player Question</th><th>Suggested GM Response</th></tr></thead><tbody><tr><td>\"Can we research the anomaly before we go?\"</td><td>Allow a <em>Scholastic Lore (Warp Anomalies)</em> or <em>Forbidden Lore (Warp)</em> test at <strong>Hard (-20)</strong>. Success reveals that stable warp anomalies of this type are vanishingly rare and are almost always artificially sustained — by a powerful psyker, a daemon, or a xenos device. Failure yields only the official Ordo classification: \"persistent reality instability, cause unknown.\"</td></tr><tr><td>\"What happened to the three survey craft?\"</td><td>The Acolytes can request the supplementary intelligence packet. It contains fragmented astropathic transmissions from the lost expeditions — panicked, degraded, and ultimately cut short. Key phrases include: \"the fog is alive,\" \"something is watching from the planet,\" and \"do not trust the ship.\" These are available as Handout 6 (Intercepted Astropathic Messages) in the design docs if you wish to create them as supplementary handouts.</td></tr><tr><td>\"How do we contact Thorne once aboard?\"</td><td>Standard astropathic relay through the <em>Dawn's Reproach</em>. Once the ship is pulled away, this channel is severed. Vox range from the derelict is insufficient to reach any Imperial asset. The Acolytes will be completely cut off — this should dawn on them gradually, not be stated upfront.</td></tr><tr><td>\"What's the derelict's distress signal actually saying?\"</td><td>The signal reads: <strong>\"Emperor preserve us. Do not board this ship.\"</strong> The briefing omits this exact text. If the Acolytes ask the <em>Dawn's Reproach</em> vox-officer to play the signal, it is audible but heavily degraded — the warning is clear. Whether the Acolytes heed it is their choice. They will board regardless — the narrative demands it.</td></tr></tbody></table><h3>Narrative Irony and Follow-up Hooks</h3><ul><li>The briefing becomes bitterly ironic once the Acolytes are trapped on Barovus. They were sent to <strong>assess</strong>, not to be <strong>consumed</strong>. Every line about extraction protocols and safe distances reads differently after the crash.</li><li>If the Acolytes recover the briefing document later in the campaign (it may survive the crash in a sealed case), re-reading it with the knowledge of what Barovus actually is should provoke genuine anger at Thorne — or at least suspicion that he knew more than he admitted.</li><li>Thorne's closing line — \"Trust nothing\" — takes on new meaning. Was it standard Inquisitorial boilerplate, or was it a genuine warning from a handler who suspected he was sending his agents into something they would not survive?</li></ul>"
                },
                "_id": "hand01gmnotes001"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "act": "1",
                "handoutNumber": 1
            }
        },
        "_id": "fde3fc4889f13121"
    },
    {
        "name": "Captain Durst's Journal",
        "pages": [
            {
                "name": "Journal Entries",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<div class=\"doz-parchment\"><div class=\"parchment-seal\">PERSONAL LOG — CAPTAIN GUSTAV DURST</div><div class=\"parchment-body\"><p>Year 7 of the Becalming — We have been adrift in the anomaly for seven years now. No warp route out. No astropathic contact. The Navigator is dead. Elisabeth says we must find our own path. She has been reading texts recovered from the lower cargo holds — volumes bound in leather that feels warm to the touch. She says there are powers that listen when the Emperor does not.</p><p>Year 11 — The rituals have begun in earnest. Elisabeth leads them. I confess I no longer resist. The sensations... the visions... they are beyond anything I have known. We have cleared the lower engineering decks. The crew do not ask questions. Those who do are given to the altar.</p><p>Year 14 — The children must not know. Rose suspects. She is too clever. Thorn is too young to understand why Mother and Father go below-decks at night. The sounds from engineering — Elisabeth says they are 'hymns.' I no longer know the difference between a hymn and a scream.</p><p>Year 15 — It is done. The thing fused with the warp drive is awake. Elisabeth says it is a gift from the Prince of Pleasure. I say it is our damnation. But I cannot look away. I cannot stop. None of us can stop.</p><p class=\"parchment-bloodstain\">The children are dead. We locked them in their cabin to keep them safe. We forgot. Emperor forgive us, we forgot them.</p></div><div class=\"parchment-signature\">Gustav Durst, Master of Durst's Lament</div></div>"
                },
                "_id": "a22c199caf9349a7"
            },
            {
                "name": "GM Notes",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>GM Notes — Handout 2: Captain Durst's Journal</h2><h3>When to Give This Handout</h3><p>This journal is found in <strong>Room UD3 — The Captain's Quarters</strong> of the Vessel of Lament. It is hidden behind a false bulkhead panel and discovered with a <em>Search Test (Ordinary +10)</em>. Present it to the player who finds it, then allow it to be shared with the group. The journal is a physical prop — encourage the player to read it aloud at the table for maximum impact.</p><h3>What the Journal Reveals</h3><ul><li><strong>The Durst family's descent into Slaanesh worship:</strong> The timeline covers approximately 15 years of drift within the warp anomaly, from initial desperation (Year 7) to full cult activity (Year 11) to the catastrophic fusion of daemon and warp drive (Year 15).</li><li><strong>The children's fate:</strong> Rose and Thorn were <em>not</em> sacrificed. They died of neglect — locked in their cabin \"for safety\" and then forgotten as the cult consumed their parents' attention and sanity. This distinction is crucial: the children are victims, not offerings. Their ghosts are tragic, not malicious.</li><li><strong>Elisabeth was the cult leader, not Gustav:</strong> The journal makes clear that Elisabeth initiated contact with Slaanesh, led the rituals, and drove the crew's corruption. Gustav followed — willingly, eventually — but he was a follower, not the architect. His guilt is real. He died (likely by his own hand) before the ship's final fate was sealed.</li><li><strong>The \"altar\" in engineering:</strong> The journal's reference to \"the thing fused with the warp drive\" points directly to the <strong>Lament Configuration</strong> — the boss encounter in Room LD3. The altar-engine is the daemon bound to the ship's drive, the source of its curse, and the obstacle the Acolytes must destroy to escape.</li><li><strong>The ship has been adrift for centuries:</strong> The journal entries span only 15 years, but the ship has been drifting in the anomaly for over 300 years since. The implication is that after the crew fell, the ship continued on its own — a warp-saturated lure, endlessly broadcasting, endlessly collecting victims.</li></ul><h3>Key Intelligence for the GM</h3><table><thead><tr><th>Detail</th><th>Significance</th></tr></thead><tbody><tr><td>\"The Prince of Pleasure\"</td><td>Slaanesh. A <em>Forbidden Lore (Chaos)</em> or <em>Scholastic Lore (Warp)</em> test at <strong>Ordinary (+10)</strong> identifies this title. Players who recognise it early understand the specific flavour of corruption aboard the ship.</td></tr><tr><td>\"Those who do are given to the altar\"</td><td>The altar is in LD3 (Lower Deck engineering). This tells the Acolytes that their objective is <em>below</em> — deeper into the ship, where the corruption is worst.</td></tr><tr><td>\"We locked them in their cabin\"</td><td>The children's cabin is MD2. The Acolytes may want to visit it after reading this. Finding Rose and Thorn's spectral forms there creates an emotionally devastating scene.</td></tr><tr><td>Armory access code</td><td>A careful reader — or an Acolyte who passes a <em>Logic Test (Routine +20)</em> while reviewing the journal — notices that Gustav recorded his wedding anniversary in the margins of the Year 7 entry: <strong>14.08.37</strong>. This is the cipher-lock code for the Armory (Room UD6). Do not volunteer this information; let the players find it.</td></tr></tbody></table><h3>Mechanical Tie-ins</h3><ul><li><strong>Forbidden Lore bonus:</strong> Reading the journal in full grants a <strong>+20 bonus to Forbidden Lore (Chaos) tests</strong> made aboard the Vessel of Lament for the remainder of the dungeon. The journal provides context for the ship's corruption that makes Chaos-related knowledge tests significantly easier.</li><li><strong>Insanity and Corruption cost:</strong> Reading the journal inflicts <strong>1d5 Insanity Points</strong> and <strong>1 Corruption Point</strong>. This is unavoidable — the later entries (Year 14-15) describe acts so horrific that merely comprehending them takes a toll. If you want to add granularity, require a <em>Willpower Test (Challenging +0)</em> when the reader reaches the final bloodstained entry about the children. Failure adds an additional <strong>1 Insanity Point</strong> from the specific horror of parental neglect turned fatal.</li><li><strong>The children's names are a weapon:</strong> This is not stated in the journal itself, but the journal establishes Rose and Thorn as named individuals. During the boss fight in LD3, an Acolyte who calls the children by name and urges them to resist the entity grants all allies a <strong>+10 bonus to Willpower Tests</strong> for the remainder of the encounter. The Astropath's psychic echo in UD7 provides a more direct clue (\"the children are the key\"), but the journal is where the players learn who the children <em>are</em>.</li></ul><h3>Player Questions to Anticipate</h3><table><thead><tr><th>Player Question</th><th>Suggested GM Response</th></tr></thead><tbody><tr><td>\"Where are the children now?\"</td><td>They are ghosts aboard the ship. The Acolytes already met their spectral forms on the boarding deck. Their real remains are in the Children's Cabin (MD2). Visiting the cabin triggers a deeply affecting scene where Rose and Thorn manifest and describe their deaths.</td></tr><tr><td>\"Is Gustav still alive?\"</td><td>No. Gustav died of guilt and despair — likely suicide, though the journal does not state this explicitly. His body is not found on the ship (consumed by the warp, or perhaps absorbed by the entity). Elisabeth's body, however, is found in MD4.</td></tr><tr><td>\"Can we use this journal against the daemon?\"</td><td>Not directly — the journal is not a weapon. But the <em>information</em> in it is invaluable: it tells the Acolytes what the entity is (a daemon fused with the warp drive), where it is (engineering/lower decks), and that the children are connected to it. A well-prepared party that reads the journal, visits the children, and carries the Astropath's sending-stone from UD7 enters the boss fight with significant advantages.</td></tr><tr><td>\"How did the ship survive 300+ years?\"</td><td>The daemon sustains it. The warp drive fusion event created a self-perpetuating cycle: the daemon feeds on suffering, the ship lures victims, and the suffering fuels the daemon. The ship is effectively immortal as long as the altar-engine exists. Destroying it in LD3 breaks the cycle — and causes the ship to lurch through the warp rift and crash on Barovus.</td></tr></tbody></table><h3>Pairs With</h3><ul><li><strong>Elisabeth Durst's Letter (Handout 3):</strong> Found on Elisabeth's corpse in MD4. Together, the journal and the letter tell the complete Durst family tragedy from both perspectives — Gustav the weak, guilty follower and Elisabeth the willing, unrepentant architect.</li><li><strong>The Children's Cabin (MD2):</strong> The journal makes the cabin scene hit harder. Players who have read about the children being \"locked away\" and then \"forgotten\" will react viscerally when Rose describes exactly what happened.</li><li><strong>The Astropath's Chamber (UD7):</strong> The psychic echo message (\"the children are the key... the children are the lock\") builds on the journal's revelation. Together, these clues arm the Acolytes for the boss fight.</li></ul>"
                },
                "_id": "hand02gmnotes001"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "act": "1",
                "handoutNumber": 2
            }
        },
        "_id": "3c3cb7211e76ef5b"
    },
    {
        "name": "Elisabeth Durst's Letter",
        "pages": [
            {
                "name": "Letter",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<div class=\"doz-parchment\"><div class=\"parchment-seal\">☠</div><div class=\"parchment-body\"><p>To any who find this — I was the architect of my family's damnation. I sought power when the Emperor's light faded. The Prince answered. He always answers. The thing fused with the warp drive is my final gift to this vessel — it feeds on suffering, and this ship will never lack for that. Gustav is dead. He could not bear what we had become. The children — Emperor forgive me — I locked them away to spare them from what the rituals would do to their minds. I told myself I would return for them. I did not. The Prince whispered that their fear was sweeter than any offering I could carve from flesh.</p><p>Do not go to the lower decks. But you will. The ship will make sure of it. It is too late for us. Perhaps it is too late for you, too.</p></div><div class=\"parchment-signature\">Elisabeth Durst, in the year of our damnation</div></div>"
                },
                "_id": "5567e1f27c694531"
            },
            {
                "name": "GM Notes",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>GM Notes — Handout 3: Elisabeth Durst's Letter</h2><h3>When to Give This Handout</h3><p>This letter is found in <strong>Room MD4 — Sealed Storage Bay</strong> of the Vessel of Lament, clutched in the preserved hands of Elisabeth Durst's corpse. The storage bay is reached by a narrow companionway ladder and contains a sealed compartment at the far end (<em>Security Test, Hard -20</em>, or <em>Strength Test, Ordinary +10</em>, to break the hatch). Elisabeth's body is eerily intact despite centuries of time — waxy, translucent skin, self-inflicted wounds at the wrists. A <em>Medicae Test (Challenging +0)</em> confirms she died by her own hand.</p><p>Present the letter to whoever searches the body. The letter inflicts <strong>1 Insanity Point</strong> upon reading — no test to resist. The content is simply that disturbing.</p><h3>What the Letter Reveals</h3><ul><li><strong>Elisabeth was the architect, not the victim.</strong> Where Gustav's journal frames him as a man who followed his wife into damnation, Elisabeth's letter confirms she walked that path willingly and with full awareness. She describes herself as \"the architect\" without self-pity or excuse.</li><li><strong>She chose power over her children.</strong> The letter's most devastating line is her admission about the children: she locked them away, told herself she would return, and then did not — because the Prince whispered that their fear was a better offering than any deliberate sacrifice. The children died of neglect that was, at some level, <em>chosen</em>.</li><li><strong>Gustav died before her.</strong> \"Gustav is dead. He could not bear what we had become.\" Gustav's death was likely suicide, driven by guilt. Elisabeth outlived him, which means she continued the cult alone before eventually taking her own life.</li><li><strong>The ship is a trap.</strong> \"Do not go to the lower decks. But you will. The ship will make sure of it.\" Elisabeth understood the vessel's nature — it compels exploration, drawing victims deeper. This is both a warning and a taunt.</li><li><strong>\"The Prince\" is named.</strong> Elisabeth refers to Slaanesh as \"the Prince\" — a common cultist honorific for the Prince of Pleasure.</li></ul><h3>Mechanical Tie-ins</h3><ul><li><strong>Identifying \"the Prince\":</strong> A <em>Scholastic Lore (Warp)</em> or <em>Forbidden Lore (Daemonology)</em> test at <strong>Ordinary (+10)</strong> identifies \"the Prince\" as a reference to <strong>Slaanesh</strong>, specifically the aspect known as the Prince of Pleasure. Success also reveals that the phrase \"He always answers\" is a common Slaaneshi cult axiom — the Dark Prince is known for responding to mortal supplication more readily than the other Ruinous Powers, though always at a terrible cost.</li><li><strong>Logic test for full picture:</strong> A <em>Logic</em> or <em>Scholastic Lore (Occult)</em> test at <strong>Ordinary (+10)</strong> allows an Acolyte to piece together the complete narrative: the Durst family formed a Slaaneshi cult while adrift in the anomaly, summoned or created a daemonic entity that fused with the ship's warp drive, and the vessel itself has become a self-sustaining trap — a lure that collects victims to feed the entity in the engineering decks below.</li><li><strong>Corruption note:</strong> The letter itself does not inflict Corruption (unlike the journal), but the storage bay where Elisabeth's body is found is deeply unsettling. GMs may optionally require a <em>Willpower Test (Challenging +0)</em> from any Acolyte who examines the body closely — failure inflicts <strong>1 additional Insanity Point</strong> from the wrongness of her perfectly preserved corpse.</li></ul><h3>Narrative Purpose</h3><p>This handout serves a specific emotional function: it <strong>shifts the moral weight of the Durst tragedy</strong>. Gustav's journal (Handout 2) invites sympathy — he was weak, he followed, he regretted. Elisabeth's letter forecloses that sympathy. She was not deceived or manipulated. She made a deliberate bargain with Chaos, understood its cost, paid it willingly, and only turned against it when there was nothing left to lose.</p><p>The emotional beat for the players should be: reading Gustav's journal makes them sad. Reading Elisabeth's letter makes them <em>angry</em>. That anger is fuel — it motivates them to go deeper, to destroy the entity Elisabeth created, to free the children she abandoned. The letter transforms a horror story into a mission.</p><h3>Player Questions to Anticipate</h3><table><thead><tr><th>Player Question</th><th>Suggested GM Response</th></tr></thead><tbody><tr><td>\"Is Elisabeth still a threat?\"</td><td>Her body is dead — genuinely dead, not warp-animated. However, warp-echoes of Elisabeth exist in the lower decks, particularly in the Congregation Hall (LD4) and near the altar-engine in LD3. These are not her ghost but psychic imprints — repeating loops of her rituals, her prayers, her acts. They cannot interact with the Acolytes but contribute to the oppressive atmosphere.</td></tr><tr><td>\"What texts did she find?\"</td><td>Proto-Slaaneshi ritual volumes, recovered from the lower cargo holds during the early years of drift. These texts are now in the Hidden Shrine (MD3) — a concealed compartment behind a storage locker in the captain's chambers. The shrine contains an eight-pointed star, black tallow candles, and the blood-covered texts themselves. Entering the shrine inflicts 1 Corruption Point automatically. The texts are too dangerous to read safely without <em>Forbidden Lore (Chaos)</em>.</td></tr><tr><td>\"Why did she kill herself?\"</td><td>The letter does not explain her suicide directly, but the implication is despair. Once Gustav was dead and the children were dead and the daemon was awake, there was nothing left. The Prince had taken everything she had to offer. Her final act — writing this letter, this warning-that-is-also-a-confession — suggests that some fragment of conscience survived. Or perhaps it was simply Slaaneshi excess: even her death had to be dramatic, performative, <em>felt</em>.</td></tr><tr><td>\"Can we sanctify or destroy her body?\"</td><td>Yes. An Acolyte can perform Imperial funerary rites over the corpse (requiring knowledge of the Ministorum liturgy or a <em>Common Lore (Imperial Creed)</em> test at <strong>Ordinary +10</strong>). Doing so has no mechanical effect but provides a moment of moral clarity amid the horror — a reminder that even the damned were once human, and that the Emperor's mercy extends even to those who turned away from His light.</td></tr></tbody></table><h3>Pairs With</h3><ul><li><strong>Captain Durst's Journal (Handout 2):</strong> Together, these two documents tell the complete Durst family story. The journal is the husband's perspective — guilt, weakness, complicity. The letter is the wife's — pride, willfulness, regret that arrives too late. The combination is devastating. GMs should ensure players encounter both.</li><li><strong>The Children's Cabin (MD2):</strong> Elisabeth's admission about locking the children away gains terrible specificity when the Acolytes visit the cabin and hear Rose describe what happened: \"They said it was to keep us safe from the monster. But they never came back.\"</li><li><strong>The Hidden Shrine (MD3):</strong> Elisabeth's reference to \"the Prince\" and the rituals connects directly to the shrine where those rituals were performed. Players who read the letter may seek out the shrine — reward their curiosity with the location, but warn them of the Corruption cost.</li></ul>"
                },
                "_id": "hand03gmnotes001"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "act": "1",
                "handoutNumber": 3
            }
        },
        "_id": "b45ae60169b099e9"
    },
    {
        "name": "Strahd's Dinner Invitation",
        "pages": [
            {
                "name": "Invitation",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<div class=\"doz-parchment\"><div class=\"parchment-seal\">ZAROVICH</div><div class=\"parchment-body\"><p>My esteemed guests,</p><p>I have watched your progress with considerable interest. You are resourceful, faithful, and — I confess — more tenacious than I had anticipated. These are admirable qualities. I respect tenacity. I have survived on it for four centuries.</p><p>I wish to extend a formal invitation to dine with me at the Zarovich Spire. You will be my guests. You will be safe — I give you my word, and my word has been good since before your Imperium forgot what honour meant. The food will be excellent. The wine is pre-rift vintage. The conversation, I hope, will be stimulating.</p><p>I have questions about the galaxy. You have questions about Barovus. I see no reason we cannot exchange answers like civilised beings.</p><p>My carriage will arrive at sunset. I trust you will not insult me by declining.</p></div><div class=\"parchment-signature\">Lord-Governor Strahd von Zarovich, Master of Barovus</div></div>"
                },
                "_id": "69b69cd921f8421e"
            },
            {
                "name": "GM Notes",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>GM Notes — Handout 4: Strahd's Dinner Invitation</h2><h3>When to Give This Handout</h3><p>The invitation arrives <strong>mid-Act 2</strong>, after the Acolytes have accomplished something notable — cleared a location, recovered a relic, or otherwise demonstrated competence that has attracted Strahd's attention. Ideal timing:</p><ul><li>After the Acolytes successfully deal with a threat in Fortress Vallak (the Feast of Saint Andral, the Festival of the Blazing Sun, or deposing Burgomaster Vallakovich)</li><li>After they visit the Recaf Distillery or investigate Argynvostholt</li><li>After they make contact with Inquisitor Van Richten</li><li>Any session where the players seem to be settling into confidence — the invitation should shatter that comfort by reminding them who is really in control</li></ul><p><strong>Delivery method:</strong> A servitor-skull arrives at whatever location the Acolytes are staying — their room at the Blue Water Inn, their camp, their safehouse. It hovers at the window, its eye-sockets glowing faint violet, and extends a mechanical claw holding a sealed envelope of black vellum with a crimson wax seal bearing the Zarovich crest (a raven clutching a skull). The servitor-skull waits for no reply and departs silently once the envelope is taken. Alternatively, the invitation is found pinned to their door with a silver dagger — Strahd's agents entered their locked quarters without triggering any wards or alarms. This second method is more unsettling.</p><h3>What the Invitation Reveals</h3><ul><li><strong>Strahd is watching them.</strong> He knows what they have accomplished, where they are staying, and how to reach them. There is no hiding from him on Barovus.</li><li><strong>He is cultured and confident.</strong> The invitation's tone is courteous, witty, and dripping with aristocratic assurance. This is not a mad warlord or a gibbering Chaos cultist — this is a man (or something that remembers being a man) who has ruled for four centuries and considers hospitality a point of personal honour.</li><li><strong>The invitation is genuine.</strong> This is critical: <strong>Strahd will honour the safe-conduct.</strong> The Acolytes will not be attacked, poisoned, ambushed, or harmed during the dinner. He means every word. The horror is not that it is a trap — the horror is that it is <em>sincere</em>.</li></ul><h3>Running the Dinner Scene</h3><p>The dinner at Zarovich Spire is one of the campaign's most important roleplaying encounters. It requires preparation and confidence from the GM. The following guidance covers the full scene.</p><h4>The Arrival</h4><p>Strahd's carriage — the Black Carriage from the random encounter table — arrives at sunset. It is an ornate antigrav groundcar of archaic design, jet black with silver filigree bearing the Zarovich crest, drawn by two augmetic horses with glowing red optical sensors. The ride to the Spire takes approximately one hour and passes through increasingly desolate terrain. The carriage is comfortable — heated, softly lit, with decanters of excellent amasec and a written note: <em>\"Please, make yourselves comfortable. We have much to discuss.\"</em></p><p>The Acolytes arrive at Zarovich Spire's main gate. Servitor-guards in baroque carapace armour escort them through the courtyard, up the grand staircase, and into the dining hall. The hall is vast, candlelit, and immaculate — a stark contrast to the decay of the rest of Barovus. A long table is set for the party plus one. The food is already laid out.</p><h4>Strahd as Host</h4><p>Strahd enters through a side door, alone, dressed in formal attire — a long black coat over a high-collared shirt, silver-clasped, impeccable. He greets each Acolyte by name (he knows their names). He seats them personally. He pours wine — a genuine pre-rift vintage, over 300 years old, from his personal cellars. The wine is excellent.</p><p><strong>Key characterisation notes:</strong></p><ul><li>Strahd is <strong>a perfect host</strong>. His manners are flawless. He asks about dietary preferences. He ensures glasses are kept full. He compliments the Acolytes genuinely — their courage, their faith, their resourcefulness.</li><li>The food is <strong>real and superb</strong>. Roasted grox-haunch, root vegetables from the Spire's own gardens, fresh bread, preserved fruits. Nothing is poisoned. Nothing is warp-tainted. Strahd himself eats sparingly — he does not need food — but he partakes to put his guests at ease.</li><li>He is <strong>charming</strong>. He tells anecdotes about Barovus before the rift, about the Imperium as he remembers it, about the eccentricities of his subjects. He has a dry, dark wit. He makes the Acolytes laugh — and that is the most unsettling thing of all.</li><li>The horror of the dinner is not violence — it is <strong>seduction</strong>. Not sexual (though Slaaneshi undertones are appropriate) but the seduction of civilisation. Strahd offers the Acolytes something they have not had since arriving on Barovus: comfort, safety, conversation with an intelligent equal, and the simple pleasure of a good meal. The temptation is to enjoy it. The sin is forgetting what he is.</li></ul><h4>What Strahd Reveals at Dinner</h4><p>Strahd will answer questions about Barovus honestly, within limits. He treats the exchange as a game — information for information, truth for truth.</p><table><thead><tr><th>Topic</th><th>What He Will Say</th><th>What He Will Not Say</th></tr></thead><tbody><tr><td>The warp rift</td><td>It has surrounded Barovus for over 300 years. It is stable — not a storm. He admits he played a role in its creation but frames it as a \"necessary measure\" to protect his world from threats he does not specify.</td><td>He will not reveal the Daemon Prince pact, the specific mechanism that sustains the rift, or how it might be broken.</td></tr><tr><td>His immortality</td><td>He admits freely that he is immortal. He has ruled for over 400 years. He does not age, does not sicken, and is extremely difficult to kill. He speaks of this with weariness, not pride.</td><td>He will not reveal his specific weaknesses — the Heart of Sorrow, the coffin, or the conditions for his destruction. He will not name the relics (Dawn's Edge, the Rosette) or acknowledge their power.</td></tr><tr><td>Tatyana / Ireena</td><td>He speaks of Tatyana with genuine emotion — love, loss, obsession. He admits that Ireena is \"connected\" to a woman he loved centuries ago. He does not use the word \"reincarnation\" but the implication is clear. His voice changes when he speaks of her — the mask of civility slips, and something raw and hungry shows through.</td><td>He will not reveal the Slaaneshi soul-trap that keeps Tatyana's soul cycling through reincarnations. He will not admit that his pursuit of Ireena is part of a pattern that has repeated dozens of times.</td></tr><tr><td>Sergei</td><td>If asked directly, he acknowledges having had a brother. His expression becomes stone. \"He was... beloved. By everyone. Particularly by Tatyana.\" He will say nothing more. The subject is closed.</td><td>He will not admit to murdering Sergei.</td></tr><tr><td>Van Richten</td><td>He knows an Inquisitor came to Barovus decades ago. He refers to Van Richten with a mix of respect and amusement: \"A tenacious old man. Still alive, the last I checked. Hiding, of course. He is very good at hiding.\" He will not reveal Van Richten's location.</td><td>He will not disclose Van Richten's false identity (\"Dr. Richtus\") or his location in Fortress Vallak.</td></tr><tr><td>The Imperium</td><td>He asks <em>many</em> questions. What is the state of the galaxy? Who sits on the Golden Throne? (He remembers the Emperor as a historical figure, not a god.) Are there still Space Marines? Has mankind reached the galactic edge? His curiosity is genuine — 300 years of isolation have starved him of news.</td><td>N/A — this is where the Acolytes have the advantage. Their information is the commodity Strahd values most.</td></tr></tbody></table><h4>What Strahd Wants to Know</h4><ul><li><strong>News of the Imperium:</strong> The wider galaxy, the state of the Imperium, significant wars, the current political landscape. He is genuinely fascinated. 300 years is a long time without news.</li><li><strong>The Acolytes themselves:</strong> Their backgrounds, their faith, their reasons for serving the Inquisition. He is studying them — assessing their strengths, their weaknesses, their potential as entertainment.</li><li><strong>\"The old Inquisitor\":</strong> He will ask, casually, whether they have encountered anyone unusual in Fortress Vallak — \"an elderly gentleman of scholarly temperament, perhaps.\" He is fishing for confirmation that Van Richten is still alive and that the Acolytes have made contact. If they deny it, he will smile and say \"Of course\" in a tone that suggests he does not believe them.</li><li><strong>Ireena's whereabouts:</strong> He will ask where Ireena is, whether she is safe, and whether the Acolytes are \"looking after her.\" His tone is that of a concerned guardian. The subtext is ownership.</li></ul><h4>Declining the Invitation</h4><p>The Acolytes may choose not to attend. This is unwise but should be permitted — player agency matters.</p><p><strong>Consequences of declining:</strong></p><ul><li>Strahd takes it as a <strong>personal insult</strong> — not a violent one, but a cold one. He is a man accustomed to deference, and refusal is something he has not experienced in centuries.</li><li><strong>Fortress Vallak Stability -10</strong> (if you are tracking settlement stability). Strahd's displeasure manifests indirectly: increased patrols, harsher enforcement by his servitor-guards, mysterious disappearances among the Acolytes' allies and contacts. Nothing that can be directly attributed to Strahd, but the message is clear.</li><li>The Black Carriage continues to appear on the roads during travel encounters — empty, waiting, door open. A standing invitation that becomes increasingly menacing with repetition.</li><li>Strahd's next direct encounter with the Acolytes will be notably colder. He will mention the declined invitation: \"I set a place for you. The wine went to waste. I do not enjoy waste.\"</li></ul><h3>Player Questions to Anticipate</h3><table><thead><tr><th>Player Question</th><th>Suggested GM Response</th></tr></thead><tbody><tr><td>\"Is the food poisoned?\"</td><td>No. A <em>Medicae</em> or <em>Awareness</em> test confirms the food is genuine and untainted. Strahd would consider poisoning his guests to be beneath him. He is many things — a tyrant, a predator, a monster — but he is not <em>crass</em>.</td></tr><tr><td>\"Can we attack him here?\"</td><td>Mechanically, yes. Practically, it is suicide. The Acolytes are in the heart of Zarovich Spire, surrounded by Strahd's servitor-guards, with no escape route. Strahd has lair actions here (see Act 4). Without the three relics (Dawn's Edge, Rosette of Saint Markovia, Heart of Sorrow destroyed), he cannot be permanently killed. An attack here ends with the Acolytes subdued, humiliated, and ejected from the Spire — alive, because Strahd finds killing them at this stage boring.</td></tr><tr><td>\"Is this a trap?\"</td><td>No. It is a <strong>power play</strong>. Strahd is demonstrating that he controls the terms of engagement — when, where, and how interactions occur. The Acolytes come to him, eat his food, answer his questions, and leave on his sufferance. The dinner is theatre, and Strahd is the director.</td></tr><tr><td>\"Can we sneak weapons in?\"</td><td>Strahd expects them to be armed — he tells them to \"come as you are\" and finds Inquisitorial accoutrements \"fetching.\" He is not threatened by their weapons. If anything, he is amused by the idea that they might try something. Let them bring their guns. It changes nothing.</td></tr><tr><td>\"Can we explore the Spire during dinner?\"</td><td>Strahd's hospitality extends to the dining hall and adjacent drawing room, not the entire castle. Servitor-guards will politely redirect any Acolyte who wanders. However, an Acolyte who excuses themselves (to use the facilities, for instance) and passes a <em>Stealth Test (Very Hard -30)</em> can briefly explore one adjacent corridor before being \"found\" and escorted back. This might yield a glimpse of the crypts' entrance or the stairway to the upper levels — useful intelligence for Act 3.</td></tr><tr><td>\"What if we bring Ireena?\"</td><td><strong>Do not bring Ireena to dinner with Strahd.</strong> If the Acolytes do, the evening becomes significantly more tense. Strahd is visibly affected by her presence — his composure cracks, his attention narrows, and the dinner becomes a performance directed entirely at her. Ireena herself is deeply uncomfortable and may attempt to leave. This is a high-stakes roleplaying scenario that could accelerate Strahd's timeline for claiming her. The GM should make clear, through NPC advice (Van Richten, Ismark), that bringing Ireena to the Spire is extremely dangerous.</td></tr></tbody></table><h3>After the Dinner</h3><p>The carriage returns the Acolytes to wherever they are staying. Strahd bids them farewell at the gate — personally, graciously, with a handshake or a bow. His final words should be something the players remember:</p><ul><li><em>\"Thank you for a most stimulating evening. It has been... a very long time since I enjoyed a conversation. I do hope we shall speak again. Under less pleasant circumstances, perhaps. But that is for another day.\"</em></li><li>If the Acolytes mentioned Ireena: <em>\"Give my regards to Miss Kolyana. Tell her I think of her. Tell her I am patient. I have always been patient.\"</em></li><li>If the Acolytes were confrontational: <em>\"I admire your conviction. Truly. Hold onto it. You will need it before the end.\"</em></li></ul><p>Each Acolyte gains <strong>1 Corruption Point</strong> from the evening — not from any overt warp exposure but from the insidious normalisation of dining with a monster. The Corruption represents the tiny, treacherous thought: <em>\"He was not so bad. Perhaps he could be reasoned with.\"</em> That thought is more dangerous than any daemon.</p>"
                },
                "_id": "hand04gmnotes001"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "act": "2",
                "handoutNumber": 4
            }
        },
        "_id": "e6d47325a07f04a2"
    },
    {
        "name": "Tome of Strahd — Decoded Excerpts",
        "pages": [
            {
                "name": "Excerpts",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<div class=\"doz-vox-transmission\"><div class=\"vox-classification\">DECRYPTED — COGITATOR ARCHIVE</div><div class=\"vox-header\">PERSONAL RECORDS — LORD-GOVERNOR STRAHD VON ZAROVICH<br><span class=\"vox-timestamp\">DECRYPTION STATUS: PARTIAL | INTEGRITY: 73%</span></div><div class=\"vox-body\"><p>[ENTRY 001 — UNDATED]</p><p>I have conquered this world. I have conquered death. I have conquered everything except the one thing that matters. She does not love me. She loved <em>him</em>. My brother. My weak, pious, beautiful brother who could not swing a sword or hold a line or make the sacrifices that empire demands.</p><p>[ENTRY 247 — UNDATED]</p><p>She returned. Different face, different name, but the same soul. I know it. I can <em>taste</em> it. The Prince promised me she would come back. He did not promise she would stay.</p><p>[ENTRY 891 — UNDATED]</p><p>The Inquisitor came. Markovia. She was magnificent. She burned through my guards like a torch through paper. She stood in my throne room and told me I was an abomination. She was right. I told her she was doomed. I was also right.</p><p class=\"vox-corrupt\">[ENTRIES 892-1,247 — CORRUPTED / UNRECOVERABLE]</span></p><p>[ENTRY 1,248 — UNDATED]</p><p>The coffin is in the crypts. The Heart is in the tower. Without both, I endure. The blade she carried — the golden one — is the only weapon that cuts deep enough to matter. I have hidden it well. Not destroyed. I cannot bring myself to destroy it. It reminds me of the sun.</p><p>[ENTRY 1,249 — FINAL RECOVERABLE]</p><p>She will come again. Tatyana always comes again. And this time I will be ready. This time she will understand. This time she will love me. Or I will burn this world to nothing and start again.</p></div><div class=\"vox-footer\">END OF RECOVERABLE DATA | FURTHER DECRYPTION ATTEMPTS MAY YIELD ADDITIONAL ENTRIES</div></div>"
                },
                "_id": "31eb260ae2ec4d24"
            },
            {
                "name": "GM Notes",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Tome of Strahd — GM Notes</h2><h3>When to Give This Handout</h3><p>The Acolytes receive this handout after they:</p><ol><li>Find the Tome of Strahd (an encrypted data-cogitator) — its location is determined by <strong>Draw 4</strong> of the Emperor's Tarot, though the most common placement is in <strong>Strahd's study</strong> within Zarovich Spire.</li><li>Successfully decrypt it — requires a <em>Hard (–20) Tech-Use</em> test. <strong>Kasimir Velikov</strong> can assist, granting <em>+10</em> to the test if the Acolytes have recruited him. Multiple attempts are permitted, but each failed attempt takes <em>1d5 hours</em> and risks triggering Strahd's awareness (see below).</li></ol><h3>What the Tome Reveals</h3><p>The decoded excerpts are Strahd's own words — a first-person account spanning centuries. The key revelations are:</p><ul><li><strong>Strahd's backstory:</strong> His rise as a military conqueror, his appointment as Lord-Governor, his growing despair as age claimed him while his younger brother Sergei won Tatyana's love.</li><li><strong>The pact:</strong> Strahd bargained with the Daemon Prince <strong>Tenebrous</strong> (\"The Prince of Midnight Pleasures\"), a greater daemon of Slaanesh. In exchange for immortality and dominion over Barovus, Strahd surrendered his soul, his world's connection to the Astronomican, and his capacity for genuine emotion. The pact was sealed by murdering Sergei on his wedding day.</li><li><strong>Tatyana's fate:</strong> She witnessed Sergei's murder and threw herself from the South Tower. Her soul reincarnates — Ireena Kolyana is the latest incarnation. Strahd has been hunting each reincarnation for three centuries.</li><li><strong>Saint Markovia:</strong> Entry 891 confirms that an Inquisitor named Markovia once breached the Spire and nearly destroyed Strahd. She failed, but the scar her faith left on him has never healed. Her rosette is one of the three relics needed to end him.</li></ul><h3>Critical Intelligence — Entry 1248</h3><p>This is the most important passage in the entire handout:</p><blockquote><p><em>\"The coffin is in the crypts. The Heart is in the tower. Without both, I endure. The blade she carried — the golden one — is the only weapon that cuts deep enough to matter.\"</em></p></blockquote><p>This confirms the <strong>three conditions</strong> for Strahd's permanent destruction:</p><table><thead><tr><th>Condition</th><th>What It Means</th></tr></thead><tbody><tr><td>Destroy the coffin</td><td>Located in the Spire's crypts. <em>Armour 10, Structural Integrity 40.</em> Takes double damage from Sanctified weapons. Without it, Strahd cannot regenerate after being reduced to 0 Wounds.</td></tr><tr><td>Destroy the Heart of the Spire</td><td>A warp crystal in the upper tower. <em>Armour 8, Structural Integrity 50.</em> While it exists, Strahd has <em>Regeneration (5)</em> — he heals 5 Wounds per round. Destroying it strips this permanently.</td></tr><tr><td>Strike the killing blow with Dawn's Edge</td><td>The relic power sword (Sunsword equivalent). Only this weapon can deliver a truly fatal wound while the other two conditions are met. Without it, Strahd can reconstitute even from apparent death.</td></tr></tbody></table><p>All three conditions must be met <strong>simultaneously</strong> for permanent destruction. Make sure the players understand this — it transforms the final confrontation from a slugfest into a strategic operation requiring planning and coordination.</p><h3>Corrupted Entries (892–1,247)</h3><p>These entries span roughly 200 years of Strahd's rule. If the Acolytes attempt further decryption (<em>Very Hard (–30) Tech-Use</em>), fragments can be recovered. Each successful test recovers one of the following, chosen by the GM or rolled randomly:</p><ul><li><strong>Saint Markovia's assault:</strong> Details of her Ordo Malleus strike team, their tactics, and why they ultimately failed (Strahd retreated to his coffin and regenerated; they didn't know about the Heart).</li><li><strong>Vostra negotiations:</strong> Strahd's diplomatic arrangement with the Vostra — they are permitted to travel freely in exchange for bringing him \"interesting visitors.\" This explains why Madam Eva can move through the mists.</li><li><strong>Previous Tatyana reincarnations:</strong> At least seven named incarnations across three centuries, each ending in tragedy. This underscores the cosmic cruelty of the cycle and Slaanesh's hand in perpetuating it.</li><li><strong>The Empyrean Vault:</strong> Oblique references to a pre-Imperial ruin beneath the Spire where Strahd first made contact with Tenebrous. The Vault predates human settlement on Barovus. \"The things that sleep there are older than the Imperium and hungrier than I am.\"</li><li><strong>The Silver Drakes:</strong> A brief, dismissive mention of an Astartes honour company that attempted to assault the Spire. Strahd destroyed them. Their outpost still stands — this points toward the Fallen Astartes Outpost location.</li></ul><h3>Emotional Weight</h3><p>This is the moment the players understand Strahd as a <strong>tragic figure</strong>, not just a monster. His entries reveal genuine grief, self-awareness, and a devastating inability to repent — the pact has severed his capacity for true remorse. He can <em>see</em> his damnation but cannot <em>feel</em> it.</p><p>Entry 1249's final line — <em>\"Or I will burn this world to nothing and start again\"</em> — is critical. It shows that despite the tragedy, Strahd remains <strong>dangerous, obsessive, and capable of apocalyptic action</strong>. He is not seeking redemption. He is seeking possession. The sympathy the Tome generates should be complicated, not clean.</p><h3>Anticipated Player Questions</h3><ul><li><strong>\"Can we use this against him?\"</strong> — Yes. Knowing Strahd's psychology grants <em>+10 to Fellowship tests</em> when referencing Tatyana, Sergei, or his past during social encounters with Strahd. He is susceptible to emotional manipulation on these subjects — it is his only genuine vulnerability outside of combat.</li><li><strong>\"Is there more to decrypt?\"</strong> — Yes. See \"Corrupted Entries\" above. Additional decryption attempts are possible but increasingly difficult and time-consuming.</li><li><strong>\"Does he know we have it?\"</strong> — <strong>Yes, immediately.</strong> The Tome is psychically linked to Strahd. The moment it is removed from its resting place, he is aware. The moment it is decrypted, he knows what the Acolytes have learned. This does not change his behaviour dramatically (he is arrogant enough to believe the knowledge won't save them), but he may reference their newfound knowledge in future encounters: <em>\"I see you have been reading my diary. Did you enjoy it? I confess the prose is somewhat overwrought in places — I was younger then, and grief makes poor editors of us all.\"</em></li><li><strong>\"Can we show this to Ireena?\"</strong> — A significant character moment. Ireena's reaction to learning she is the latest incarnation of Tatyana — that she has been born and died dozens of times as a plaything in Strahd's obsession — should be played for maximum emotional impact. She may react with horror, denial, anger, or a strange, quiet recognition. This may trigger her latent psychic abilities to flare (at GM's discretion).</li></ul><h3>Pairs With</h3><p>This handout is the companion piece to <strong>Handout 6: Van Richten's Intelligence Brief</strong>. Together, they provide the complete picture of how to destroy Strahd:</p><ul><li>The <strong>Tome</strong> reveals the <em>what</em> (the three conditions) and the <em>why</em> (Strahd's history and psychology).</li><li><strong>Van Richten's Brief</strong> reveals the <em>how</em> (tactical approach, Strahd's combat capabilities, practical weaknesses).</li></ul><p>An Acolyte team possessing both documents has all the intelligence they need to plan the final assault. What they still lack is the <strong>location of Dawn's Edge</strong> (determined by the Tarot) and the <strong>allies and resources</strong> needed to survive the Spire.</p>"
                },
                "_id": "hand05gmnotes001"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "act": "2-3",
                "handoutNumber": 5
            }
        },
        "_id": "ad244254bee874ef"
    },
    {
        "name": "Van Richten's Intelligence Brief",
        "pages": [
            {
                "name": "Brief",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<div class=\"doz-vox-transmission\"><div class=\"vox-classification\">INQUISITORIAL — EYES ONLY</div><div class=\"vox-header\">INTELLIGENCE ASSESSMENT — LORD-GOVERNOR STRAHD VON ZAROVICH<br><span class=\"vox-timestamp\">COMPILED BY: INQ. VAN RICHTEN, ORDO MALLEUS | YEARS OF OBSERVATION: 27</span></div><div class=\"vox-body\"><p>SUBJECT is a warp-touched immortal of extraordinary power. Classification: DIRE threat. Do not engage without full preparation.</p><p>PHYSICAL CAPABILITIES: Superhuman strength, speed, and resilience. Regenerates from all wounds unless inflicted by sanctified weaponry. Can phase through solid matter. Can dominate minds through sustained eye contact.</p><p>KNOWN WEAKNESSES:</p><p>1. Holy symbols held with genuine faith cause physical distress.</p><p>2. Sanctified weapons negate his regeneration temporarily.</p><p>3. The relic blade 'Dawn's Edge' causes him visible pain and fear.</p><p>4. He retreats to his coffin in the Spire's crypts when critically wounded.</p><p>5. The 'Heart of Sorrow' — a warp crystal in the Spire's upper levels — anchors his immortality. Destroy it first.</p><p>CONDITIONS FOR PERMANENT DESTRUCTION:</p><p>1. The Heart of Sorrow must be destroyed.</p><p>2. His coffin must be destroyed.</p><p>3. The killing blow must be struck with Dawn's Edge while the Rosette of Saint Markovia is active within proximity.</p><p>All three conditions must be met simultaneously. Failure on any point allows him to regenerate.</p><p class=\"vox-corrupt\">I have spent 27 years preparing. I am too old and too damaged to wield the blade myself. I need someone younger, stronger, and more faithful than I have ever been.</p><p>Emperor willing, that someone is you.</p></div><div class=\"vox-footer\">VAN RICHTEN, V. | ORDO MALLEUS (RETIRED) | THE EMPEROR PROTECTS</div></div>"
                },
                "_id": "58ecb43c2ae246d6"
            },
            {
                "name": "GM Notes",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Van Richten's Intelligence Brief — GM Notes</h2><h3>When to Give This Handout</h3><p><strong>Inquisitor Erasmus Van Richten</strong> (operating under the alias \"Dr. Richtus\" in Fortress Vallak) provides this brief only after the Acolytes have <strong>earned his trust</strong>. This requires:</p><ol><li><strong>Locating him:</strong> The Martikovs at the Blue Water Inn can point the Acolytes toward \"Dr. Richtus\" — requires a <em>Challenging (+0) Fellowship</em> test, with bonuses for having helped the Martikovs or demonstrated opposition to Strahd. Alternatively, investigating the mysterious \"Rictavio\" carnival wagon may lead to his hab-unit.</li><li><strong>Proving identity:</strong> The Acolytes must demonstrate they are genuine Inquisitorial operatives. Van Richten will test them — questions about Ordo Malleus protocols, Inquisitorial codes, the name of their handler. A forged identity will not survive his scrutiny (<em>Opposed Scrutiny vs. Deceive</em>, and Van Richten has <em>Scrutiny +20</em>).</li><li><strong>Proving allegiance:</strong> Van Richten must be convinced the Acolytes oppose Strahd and are not his agents (willing or otherwise). Sharing intelligence, describing their experiences on Barovus, or presenting evidence of direct conflict with Strahd's servants all help. If the Acolytes have accepted gifts from Strahd or made deals with warp entities, Van Richten detects the taint and refuses to cooperate until they explain themselves.</li></ol><p>Once trust is established, Van Richten hands over the brief without ceremony: <em>\"Everything I know is on that data-slate. Twenty-seven years of my life, reduced to a few pages. Use it well. I will not get a chance to compile a second edition.\"</em></p><h3>What the Brief Reveals</h3><p>The brief is a clinical Inquisitorial threat assessment. It contains:</p><ul><li><strong>Strahd's physical capabilities:</strong> Superhuman strength, speed, and resilience. Regeneration from all wounds except those inflicted by sanctified weaponry. Ability to phase through solid matter. Psychic domination through sustained eye contact.</li><li><strong>Five known weaknesses:</strong> Holy symbols, sanctified weapons, Dawn's Edge specifically, his coffin dependency, and the Heart of Sorrow.</li><li><strong>The three conditions for permanent destruction:</strong> Destroy the Heart, destroy the coffin, deliver the killing blow with Dawn's Edge while the Rosette is active. All three must be met simultaneously.</li></ul><h3>Accuracy Assessment</h3><p>Van Richten's intelligence is approximately <strong>90% accurate</strong>. After 27 years of covert observation, he has the broad strokes correct. However:</p><table><thead><tr><th>What He Gets Right</th><th>What He Gets Wrong or Misses</th></tr></thead><tbody><tr><td>The three destruction conditions</td><td>Underestimates Strahd's <strong>lair actions</strong> — he has never survived long enough inside the Spire to observe them in full. He knows Strahd has environmental control but not the specific mechanics (sealing exits, dousing lights, summoning thralls, psychic broadcast).</td></tr><tr><td>Strahd's basic combat profile</td><td>Does not know Strahd's <strong>three combat phases</strong>. He has only seen Phase 1 behaviour. Phase 2 (Psy Rating 5, enhanced characteristics) and Phase 3 (Daemonic trait, x3 Unnatural multipliers) will be a shock.</td></tr><tr><td>The Heart of Sorrow's role</td><td>Does not know the <strong>Rosette's full capabilities</strong> — specifically its Psychic Suppression ability (reducing Strahd's Psy Rating by 3) and the Protective Ward (10m radius of golden light).</td></tr><tr><td>Dawn's Edge causes Strahd pain</td><td>Does not know Dawn's Edge has an <strong>awakening threshold</strong> (40 WP, no more than 30 CP) — a corrupted Acolyte cannot wield it.</td></tr><tr><td>Coffin location (crypts)</td><td>Does not know the exact layout of the crypts or the <strong>teleportation brazier network</strong> Strahd uses for rapid transit within the Spire.</td></tr></tbody></table><h3>The Personal Note</h3><p>The final paragraph — the one in the <code>vox-corrupt</code> CSS class — is Van Richten breaking from his clinical tone into genuine desperation. This is a man who has sacrificed his retinue, his ship, his astropathic choir, and very nearly his mind over 27 years of solitary observation. He entered the warp rift <strong>voluntarily</strong>, following intelligence about a daemonically-empowered planetary governor, and has been unable to leave since.</p><p>When he says <em>\"I need someone younger, stronger, and more faithful than I have ever been\"</em> — he means it. He is passing the torch because he physically cannot carry it any further. His hands shake from nerve damage. His augmetic eye flickers. He has survived this long by being cautious, not brave, and he knows the final assault on the Spire requires bravery he no longer possesses.</p><p>This moment should feel <strong>weighty</strong>. The Acolytes are being entrusted with the life's work of a senior Inquisitor. Play it accordingly.</p><h3>What Van Richten Does NOT Know</h3><ul><li><strong>Dawn's Edge location:</strong> The Tarot determines this. Van Richten has spent years searching and failed. He will direct the Acolytes to Madam Eva: <em>\"The Vostra matriarch reads the Emperor's Tarot with more accuracy than any astropath I have ever met. She knows where the blade is. She will tell you — for a price, or a favour, or simply because it amuses her. I have never been able to determine her true motivations.\"</em></li><li><strong>The Empyrean Vault's contents:</strong> He knows the Vault exists (references in old texts) but has never located it. Kasimir is the expert here.</li><li><strong>Fiona Wachter's cult:</strong> He suspects Lady Wachter leads a Chaos cult within Fortress Vallak but cannot prove it. He has observed unusual activity around Wachterhaus and detected faint psychic signatures, but Fiona is careful. <em>\"Something is wrong in that house. I can smell the warp on the wind when I pass it. But the Burgomaster is too blind to see and I am too exposed to investigate.\"</em></li><li><strong>Ireena's true nature:</strong> He suspects Ireena has psychic significance — he has observed Strahd's obsessive interest in her and detected an unusual psychic resonance. But he has <strong>not</strong> confirmed the Tatyana soul-bond or the reincarnation cycle. The Tome provides this missing piece.</li></ul><h3>Anticipated Player Questions</h3><ul><li><strong>\"How do we find Dawn's Edge?\"</strong> — Refer to Madam Eva and the Emperor's Tarot. The Tarot reading (Draw 2) determines the blade's location. Van Richten cannot help with this directly.</li><li><strong>\"Can Van Richten fight with us?\"</strong> — He will try if asked, but he is a <strong>liability in direct combat</strong>. His stats: <em>WS 40, BS 55, WP 65, Wounds 16.</em> He is old, damaged, and his value lies in knowledge, not combat. He is an outstanding tactician and support asset — his counsel grants <em>+10 to strategic/planning tests</em> — but putting him on the front line is likely to get him killed. If the Tarot designates him as the Destined Ally (Draw 1, roll of 2), he fights with grim determination and his +20 Forbidden Lore bonus becomes critical.</li><li><strong>\"Is there anyone else who can help?\"</strong> — Van Richten will point the Acolytes toward the <strong>Fallen Astartes Outpost</strong> (the Silver Drakes). He knows of their spectral presence and believes their company standard, if recovered, could rally supernatural allies for the final battle. He may also mention <strong>Ezmerelda d'Avenir</strong>, his former protege, if she is active in the campaign.</li><li><strong>\"Can we trust him?\"</strong> — Van Richten is <strong>completely trustworthy</strong> in his opposition to Strahd. He is paranoid, brittle, and traumatised, but he is not compromised. His Corruption Point total is moderate (he has been careful), and his faith, while battered, is genuine. He is one of the few unambiguously good NPCs in the campaign.</li></ul><h3>Mechanical Benefit</h3><p>Possessing Van Richten's Intelligence Brief grants the following:</p><ul><li><em>+10 to all strategy and planning tests</em> related to assaulting Zarovich Spire</li><li><em>+10 to Forbidden Lore (Warp)</em> tests related to Strahd's capabilities and weaknesses</li><li>Knowledge of the three destruction conditions — without this or the Tome, the Acolytes are fighting blind and may \"kill\" Strahd only to have him regenerate days later</li></ul><h3>Pairs With</h3><p>This handout is the companion piece to <strong>Handout 5: Tome of Strahd</strong>. Together they provide the complete intelligence picture:</p><ul><li><strong>Van Richten's Brief</strong> provides the <em>how</em> — tactical approach, combat capabilities, practical weaknesses, the three conditions.</li><li>The <strong>Tome</strong> provides the <em>what</em> and <em>why</em> — Strahd's history, his psychology, the emotional leverage points.</li></ul><p>An Acolyte team possessing both documents is as well-informed as it is possible to be. They still need the relics themselves, the allies to execute the plan, and the courage to walk into the Spire — but they have no excuse for going in blind.</p>"
                },
                "_id": "hand06gmnotes001"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "act": "2",
                "handoutNumber": 6
            }
        },
        "_id": "661299d84769024e"
    },
    {
        "name": "Strahd's Post-Resurrection Note",
        "pages": [
            {
                "name": "Note",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<div class=\"doz-parchment\"><div class=\"parchment-body\"><p>My dear Acolyte,</p><p>I felt you die. Do not look so surprised — everything that perishes on Barovus passes through <em>my</em> domain on its way to oblivion, and I make it my business to observe the traffic. Yours was a particularly vivid departure. The grey. The silence. That distant golden light you reached for with such desperate, childlike faith. I confess I found it rather moving. You truly believed, in that final instant, that your Emperor would catch you.</p><p>He did not, of course. Something else did. You felt it, did you not? That vast, warm, perfumed presence that wrapped itself around your departing soul and whispered your name with such terrible intimacy. The Prince of Pleasure has a connoisseur's palate, and your suffering — your <em>faith</em> in the face of suffering — is apparently an exquisite vintage. You should feel flattered. Most souls pass through His attention like water through a sieve. Yours, He chose to savour. And then He spat you back.</p><p>I wonder: can you feel what it cost you? Not the wounds — those will heal. I mean the other thing. The weight in your chest that was not there before. The whisper at the edge of hearing that will not quite resolve into words. The way your reflection looks back at you half a heartbeat too late. You are less than you were, Acolyte. The mathematics of resurrection are unkind — the warp takes its tithe in coin you cannot see but will learn to miss. Each death strips another layer from your soul, and what grows back in its place is not quite the same material. I have watched this process many times. It never ends well. But it is always <em>fascinating.</em></p><p>Do enjoy your borrowed time. I find that the recently returned develop a certain reckless intensity — a hunger for sensation, a loosening of moral certainty — that makes them considerably more entertaining than they were in their first life. I look forward to our next meeting with renewed interest.</p><div class=\"parchment-marginalia\">The Prince of Pleasure grows fond of you. That should terrify you more than dying ever could. His fondness is not a gift — it is a leash, and its length is shorter than you think.</div></div><div class=\"parchment-signature\">S.</div></div>"
                },
                "_id": "b58f4fb6da2845d2"
            },
            {
                "name": "GM Notes",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Strahd's Post-Resurrection Note — GM Notes</h2><h3>When to Give This Handout</h3><p>Deliver this handout after any Acolyte is resurrected via the <strong>Warp Reclamation</strong> mechanic. The note materialises through whatever medium is most unsettling:</p><ul><li>A servitor-skull that drifts to the recovering Acolyte and plays a recorded message</li><li>A handwritten note that appears in the Acolyte's pocket, on parchment that is warm to the touch</li><li>A psychic whisper delivered directly into the mind, with the words burning themselves into memory</li><li>A personal visit from Strahd, if the timing is dramatically appropriate</li></ul><p>The delivery method should feel <strong>violating</strong> — Strahd was watching their most vulnerable moment, the instant of their death and the horror of their return. There is no privacy on Barovus. Even dying is entertainment.</p><h3>What This Handout Reveals</h3><ul><li><strong>Strahd knows.</strong> He is aware of every death and resurrection that occurs on Barovus. The warp rift is his domain; nothing passes through it without his knowledge.</li><li><strong>Slaanesh is watching.</strong> The reference to the \"Prince of Pleasure\" confirms that the Dark Prince has active, personal interest in the Acolytes. Their suffering — and specifically their <em>faith</em> in the face of suffering — is what draws Slaanesh's attention. This is not a generic warp hazard; a Chaos God is individually amused by them.</li><li><strong>Resurrection has a cost beyond mechanics.</strong> Strahd's description of the \"weight in your chest\" and the reflection that moves too slowly foreshadows the Corruption and Insanity the Acolyte has just gained. The player should feel the mechanical costs narratively, not just as numbers on a sheet.</li></ul><h3>Mechanical Context — Resurrection Costs</h3><p>Remind yourself of the escalating costs before delivering the note:</p><table><thead><tr><th>Death</th><th>Corruption</th><th>Insanity</th><th>Equipment Loss</th><th>Additional Effect</th></tr></thead><tbody><tr><td><strong>1st</strong></td><td>1d10 CP</td><td>1d10 IP</td><td>Killing blow weapon destroyed</td><td>Hears Slaanesh's whisper for 1d5 days (–5 WP Tests)</td></tr><tr><td><strong>2nd</strong></td><td>2d10 CP</td><td>2d10 IP</td><td>All carried gear lost (scattered across Barovus)</td><td>Minor Mutation (roll on Mutation Table)</td></tr><tr><td><strong>3rd</strong></td><td>3d10 CP</td><td>3d10 IP</td><td>All gear lost; starting equipment only</td><td>Major Mutation + permanently lose 1d5 from random Characteristic</td></tr><tr><td><strong>4th+</strong></td><td>—</td><td>—</td><td>—</td><td><strong>Permanent death.</strong> The soul is claimed. Slaanesh has finished playing.</td></tr></tbody></table><p>Strahd's note is salt in the wound — it arrives at the moment the Acolyte is at their lowest, freshly returned with new Corruption points and the knowledge that their soul is being slowly consumed.</p><h3>Narrative Purpose</h3><p>This handout reinforces the campaign's core horror: <strong>death is not an escape</strong>. In most campaigns, character death is a hard stop — tragic, final, clean. On Barovus, death is a revolving door, and each trip through it leaves the Acolyte more damaged, more corrupted, and more beholden to the very powers they are fighting against. Strahd's note ensures the player <em>feels</em> this. It should provoke:</p><ul><li><strong>Anger</strong> — at Strahd's casual cruelty and voyeurism</li><li><strong>Dread</strong> — at the confirmation that Slaanesh is personally invested</li><li><strong>Paranoia</strong> — at the realisation that nothing on Barovus is private</li><li><strong>Motivation</strong> — to destroy Strahd not just for the mission, but for the personal violation he represents</li></ul><h3>Variations for Subsequent Deaths</h3><p>The handout as written is for the <strong>first resurrection</strong>. If multiple Acolytes die and return, or the same Acolyte dies multiple times, the notes evolve:</p><table><thead><tr><th>Death Number</th><th>Strahd's Response</th></tr></thead><tbody><tr><td><strong>1st death</strong></td><td>The full letter (this handout). Genuine interest, almost admiration. Detailed, eloquent, menacing.</td></tr><tr><td><strong>2nd death</strong></td><td>A shorter note: <em>\"Again? The Prince of Pleasure grows fond of you. That should terrify you more than dying ever could. Do try to make your next demise more original — repetition bores me. — S.\"</em></td></tr><tr><td><strong>3rd death</strong></td><td>A single line: <em>\"You are becoming something other than what you were. I can smell the change. — S.\"</em></td></tr><tr><td><strong>4th death (permanent)</strong></td><td>Nothing. Silence. Just the Zarovich seal in crimson wax, pressed into a blank card. No words. This is worse than anything he could have written.</td></tr></tbody></table><p>The progressive shortening mirrors Strahd's emotional arc: from genuine curiosity to amusement to contempt to cold disregard. The Acolytes are only interesting to him while they are still capable of surprising him. A soul that keeps dying is no longer surprising — it is merely broken.</p><h3>Anticipated Player Questions</h3><ul><li><strong>\"How does he know?\"</strong> — Strahd senses every death through the warp rift. Barovus is his domain in a metaphysical sense — the rift is bound to his pact with Tenebrous, and every soul that passes through it touches his awareness. He perceives deaths the way a spider feels vibrations in its web.</li><li><strong>\"Can we prevent resurrection?\"</strong> — Yes. The Acolyte's soul can <strong>refuse the Prince's offer</strong> during the Warp Reclamation — the player must declare this before the GM reads the resurrection text. The character stays dead. The player rolls a new character (see Replacement Acolytes rules). This is a legitimate and even heroic choice — choosing true death over further corruption.</li><li><strong>\"Is the Prince actually watching?\"</strong> — Yes. Slaanesh — specifically the Daemon Prince <strong>Tenebrous</strong> acting as Slaanesh's proxy — is individually amused by the Acolytes' struggle. Their faith makes their suffering more exquisite. A faithless soul that breaks easily is bland; a faithful soul that <em>endures</em> and keeps fighting is a delicacy. The Acolytes are, in a very real sense, Slaanesh's entertainment. This is the same dynamic that defines Strahd's relationship with the Dark Powers in the original Ravenloft — the domain lord is both jailer and prisoner, and the Acolytes are the latest players in a game that has been running for centuries.</li><li><strong>\"Does this mean we're tainted?\"</strong> — Mechanically, yes — the Corruption Points are real and cumulative. Narratively, the taint is more ambiguous. The Acolytes have been touched by Slaanesh but are not <em>claimed</em> by Slaanesh (unless they reach the Corruption threshold for mutation or possession). The Inquisition would view any resurrected Acolyte with deep suspicion — but the Inquisition is not here, and survival takes precedence over doctrinal purity.</li></ul><h3>Timing and Tone</h3><p>Deliver the note <strong>after</strong> the mechanical resurrection is resolved — after the Acolyte has regained consciousness, taken their Corruption and Insanity, and the immediate crisis has passed. The note should arrive in a quiet moment: while the party is catching their breath, tending wounds, or processing what just happened. It is a punctuation mark on the horror, not part of the action sequence.</p><p>Read or paraphrase the note aloud in Strahd's voice if possible — polite, amused, slightly bored, with an implicit threat underneath every courtesy. Strahd does not gloat crudely. He is too old for that. His cruelty is refined, conversational, and delivered with the easy confidence of a man who has been the most powerful being in his world for three hundred years and sees no reason to raise his voice.</p>"
                },
                "_id": "hand07gmnotes001"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "act": "any",
                "handoutNumber": 7
            }
        },
        "_id": "9e34ef31e89655cc"
    }
]