[
    {
        "name": "Lord-Governor Strahd von Zarovich",
        "pages": [
            {
                "name": "Profile",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<blockquote><p>He steps out of the ground-car, and the air itself recoils. Lord-Governor Strahd von Zarovich is tall — taller than any natural man, his frame lean and angular beneath a long coat of black that moves like liquid shadow. His features are aristocratic to the point of cruelty: high cheekbones, a sharp jaw, a thin mouth curved in a smile of absolute, predatory confidence. His hair is dark, swept back from a widow's peak, and his eyes are the colour of the warp-fog — grey and swirling, with pinpricks of violet light where pupils should be. He radiates not mere authority but <em>dominion</em>, an absolute certainty of ownership that extends to everything his gaze touches. The fog draws closer, as though it too answers to him.</p></blockquote>\n<h2>Key Facts</h2>\n<table>\n<thead>\n<tr><th>Detail</th><th>Value</th></tr>\n</thead>\n<tbody>\n<tr><td><strong>Role</strong></td><td>Primary Antagonist — The Final Enemy</td></tr>\n<tr><td><strong>Location(s)</strong></td><td>Zarovich Spire (primary); appears throughout Barovus at will</td></tr>\n<tr><td><strong>Threat Level</strong></td><td>Dire — functionally invincible without three campaign relics</td></tr>\n<tr><td><strong>Allegiance</strong></td><td>Himself; bound to a Daemon Prince of Slaanesh</td></tr>\n<tr><td><strong>Key Items</strong></td><td>Master-crafted power sword \"Grief,\" integrated inferno pistol, Spire master control signet, personal teleportarium beacon</td></tr>\n</tbody>\n</table>\n<h2>Background</h2>\n<p>Strahd von Zarovich was born on Valachia Primus, the eldest son of a minor noble family with a proud military tradition and declining fortunes. He entered the Imperial Guard at sixteen and distinguished himself as a strategic mind of exceptional talent — a military genius who saw patterns where others saw chaos. By fifty, he commanded an entire theatre of operations in the Pacification of the Vorostokov Reach. He conquered Barovus in a campaign of methodical brutality lasting three years, and the von Zarovich family was granted its governance as reward. He arrived as a tired, ageing war hero given a backwater world as his retirement — a man whose entire adult life had been spent in service to an Imperium that gave him nothing but a title and a draughty fortress.</p>\n<p>Everything changed with Tatyana. A latent psyker of extraordinary potential, she arrived on Barovus as a waypoint en route to the Scholastica Psykana and never left. Strahd fell in love with her instantly — but she chose his younger brother, Sergei, a Ministorum priest of genuine warmth and faith. Consumed by jealous desperation, Strahd descended into the Empyrean Vault, a pre-Imperial xenos ruin in the deep mountains, and struck a bargain with a Daemon Prince of Slaanesh: youth, power, and immortality in exchange for the blood of what he loved most. On Sergei and Tatyana's wedding day, Strahd murdered his brother and came to Tatyana with blood on his hands. She threw herself from the Spire's balcony rather than be his. The pact sealed. The warp rift closed around Barovus. The mists rose. And Tatyana's soul was cursed to reincarnate endlessly — always born, always found by Strahd, always dying before he can claim her. For over four hundred years, this cycle has continued.</p>\n<p>Strahd is not a daemon. He is not a psyker in the conventional sense. He occupies a classification the Ordo Malleus has no terminology for — a mortal so thoroughly saturated with warp energy that he has become an extension of the Immaterium itself. The planet is his body. The mists are his breath. The people are his sustenance. He drains life force through touch, through proximity, through the sheer weight of his will. He does not age, does not sicken, and heals with unnatural speed. The land itself responds to his moods: storms when he rages, thickening mists when he broods, a brief lightening of the sky when he feels the rare flicker of something like joy.</p>\n<h2>Appearance &amp; Demeanor</h2>\n<p>Strahd appears as a man in his late thirties — the age the pact restored him to — tall, gaunt, and pale to the point of translucence. His features are sharp and aristocratic: high cheekbones, a strong jaw, a mouth that rarely smiles but always threatens to. His black hair is swept back from a high forehead and widow's peak. His eyes are dark, containing a faint luminescence like embers buried in ash, with swirling pinpricks of violet warp-light where his pupils should be. He dresses in the formal regalia of an Imperial Lord-Governor — black and crimson, heavy with braid and decoration — though the style is three centuries out of date. He moves with the fluid grace of a trained combatant and the careful deliberation of a man who has all the time in the world.</p>\n<p>When he feeds — draining life force from a living being — his pallor brightens to a flush of stolen vitality. His eyes blaze. He looks, for a brief moment, almost human. Then the colour fades, and he is cold again. His voice is measured, cultured, and carries the cadence of a man who has not needed to raise it in centuries. His footsteps make no sound on the earth. He smells of old parchment, cold stone, and something else — something that the hindbrain recognises as <em>wrong</em> before the conscious mind can name it.</p>"
                },
                "_id": "59aee24c8a444ab5"
            },
            {
                "name": "Roleplaying Guide",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Personality Core</h2>\n<p>Strahd is, above all else, <strong>bored</strong>. This is his most dangerous quality. Four centuries of unchallenged rule over a captive world have ground away every source of stimulation, every surprise, every genuine emotion except one: his obsession with Tatyana. He has read every book in his library a hundred times. He has played regicide against himself until no opening holds mystery. He has watched generations of his subjects live, suffer, and die in patterns so predictable they might as well be clockwork. The arrival of Inquisitorial Acolytes — armed, dangerous, righteous, and utterly out of their depth — is the most interesting thing that has happened to him in decades.</p>\n<p>His intelligence has not dulled with time; if anything, centuries of existence have honed it to a terrible sharpness. He is patient in the way that only an immortal can be patient. He is cultured, well-read, conversant in a dozen languages both living and dead, a master-level regicide player, and a genuine connoisseur of music and conversation. He is, in many ways, the most civilised person the Acolytes will ever meet. He is also utterly, irrevocably insane — but his insanity is quiet. It is the insanity of a man who has lived too long, lost too much, and can no longer distinguish between love and possession, between desire and obsession, between governance and tyranny. He believes himself to be reasonable. He believes himself to be just. He believes his love for Tatyana is genuine and beautiful. He is wrong about all of these things, but he is wrong with such conviction that he is almost convincing.</p>\n<p>Deep beneath the masks of bored aristocrat and polite predator, there is a third Strahd — the one who genuinely misses being human. He would never admit this. He may not even be conscious of it. But it surfaces in unguarded moments: a flicker of genuine melancholy when he speaks of Sergei, a wistfulness when he observes the Acolytes' camaraderie, a bitterness when he contemplates the eternity stretching before him. The Daemon Prince's gift was not immortality — it was imprisonment, and some part of Strahd knows this.</p>\n<h2>Voice &amp; Mannerisms</h2>\n<p>Strahd speaks slowly, deliberately, choosing every word with the care of a man composing poetry. His tone is warm, conversational, and utterly controlled — the voice of an aristocrat accustomed to being listened to. He never raises his voice. He never needs to. The threat is always implicit, carried in a slight pause, a tilted head, a smile that reaches his eyes a fraction too late. He has a habit of clasping his hands behind his back when speaking, and he paces slowly when thinking — always circling, always watching. His gaze lingers. He studies people the way a collector studies specimens.</p>\n<p>Example quotes:</p>\n<ul>\n<li><em>\"Ah. There you are.\"</em> — His standard greeting, delivered as though he has been expecting the Acolytes for centuries. Because he has been expecting <em>something</em> for centuries.</li>\n<li><em>\"The Inquisition. How delightful. I haven't had visitors of such... caliber... in quite some time.\"</em> — Genuine pleasure, tinged with the anticipation of a hunter who has spotted interesting prey.</li>\n<li><em>\"Enthusiasm. I appreciate it. Truly. But let us not be rude.\"</em> — Said while effortlessly deflecting an attack, his tone that of a tutor gently correcting a student.</li>\n<li><em>\"You are welcome to explore. To investigate. To pry into every shadow and rattle every chain. I would expect nothing less from the Inquisition. But remember this — you are guests in my house. Everything you see, everything you touch, everything you are... it all belongs to me.\"</em> — His farewell, delivered with absolute patient certainty.</li>\n<li><em>\"I wrote poetry, once. In the early years. It was terrible. Four centuries, and I have not improved. Some failures are eternal.\"</em> — A rare moment of self-deprecation, offered casually over dinner, revealing nothing and everything.</li>\n</ul>\n<h2>What He Wants</h2>\n<p><strong>Immediate:</strong> To be entertained. The Acolytes are a new game, a new puzzle, a new set of pieces on a board he has played alone for too long. He wants to test them, tempt them, observe how they react to horror and temptation and impossible choices. He does not want to kill them immediately — that would end the game.</p>\n<p><strong>Deeper:</strong> Tatyana. Always Tatyana. The curse compels him to pursue her reincarnation, but even without the curse, his obsession would drive him. When he looks at Ireena, four centuries of loss and hunger surface in his eyes. She is the one thing that provokes genuine emotion in him — and that emotion is a toxic blend of love, possessiveness, grief, and rage. Beyond even Tatyana, Strahd craves freedom — not from Barovus, which is an extension of himself, but from the crushing ennui that has consumed him. He would deny this if asked. He would say he is content. He is lying.</p>\n<h2>What He Fears</h2>\n<p>Strahd fears very little in any conventional sense — he is too powerful and has existed too long to be threatened by mortal dangers. But certain things rattle him:</p>\n<ul>\n<li><strong>Dawn's Edge:</strong> The relic power sword is one of the few things in his domain that causes him genuine physical pain. Its light makes him flinch. He covers this reaction with contempt, but it is real.</li>\n<li><strong>The Rosette of Saint Markovia:</strong> Inquisitor Markovia nearly destroyed him. The scar her faith left has never healed. The Rosette is the one object in his domain that causes him to recoil involuntarily.</li>\n<li><strong>Genuine faith:</strong> Not ritual, not doctrine — <em>genuine</em> faith. The Emperor's light is dim on Barovus but not gone, and when a truly faithful person stands against Strahd, something in the warp itself pushes back against him. He hates this. It reminds him of what he was before the pact.</li>\n<li><strong>Losing the game:</strong> Not dying — he has been \"killed\" before and returned. But losing <em>Tatyana</em> again, watching her die or be taken beyond his reach — this is the one thing that strips away his composure and reveals the desperate, broken thing underneath the mask.</li>\n</ul>\n<h2>Reactions</h2>\n<p><strong>Respect:</strong> Strahd responds to respect with genuine warmth. An Acolyte who addresses him correctly, who engages in intelligent conversation, who treats him as a worthy adversary rather than a mindless monster — this earns his attention and, perversely, his protection. He may spare such an Acolyte when others die.</p>\n<p><strong>Threats:</strong> Strahd finds threats from mortals amusing. He does not punish threats — he <em>demonstrates</em>, casually and without malice, why the threat is meaningless. He deflects attacks without effort, shrugs off weapons, and then continues the conversation as though nothing happened.</p>\n<p><strong>Questions about his nature:</strong> He answers with partial truths wrapped in elegant deflection. He enjoys the dance of information. He will confirm that Barovus has been sealed for centuries and that the Mists answer to him. He will not explain the pact, the Daemon Prince, or his weaknesses. He treats every exchange as entertainment.</p>\n<p><strong>Displays of faith:</strong> This is the one thing that cracks his composure. A genuinely faithful prayer, an invocation of the Emperor spoken with conviction — these cause him visible discomfort that he masks with contempt. \"How quaint,\" he might say, while taking an involuntary step backward.</p>\n<p><strong>Displays of weakness:</strong> Strahd despises weakness. A whimpering, cringing Acolyte bores him and may provoke genuine cruelty — not violence, but psychological torment. He will find the Acolyte's deepest fear and hold it up for examination, clinically and without mercy.</p>\n<p><strong>Unexpected competence:</strong> This <em>delights</em> him. An Acolyte who surprises him — who outsmarts a trap, who wounds him, who does something he did not predict — earns a flash of genuine, joyful interest. \"Oh,\" he might say, eyes bright. \"Oh, that was very good.\" For Strahd, this is the closest thing to happiness he has felt in decades.</p>"
                },
                "_id": "npc01roleplay001"
            },
            {
                "name": "Plot Connections",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Story Role</h2>\n<p>Strahd is the central antagonist of the entire campaign — not merely the final boss, but a constant, oppressive presence woven through every act. He is the reason Barovus is trapped. He is the reason the Acolytes are stranded. He is the architect of every horror they encounter and the audience for every struggle they endure. His narrative function is threefold: he is the obstacle the Acolytes must overcome, the mirror that reflects the campaign's themes of corruption and the cost of power, and the tragic figure whose downfall gives the story its emotional weight.</p>\n<p>Unlike a traditional antagonist who hides until the climax, Strahd appears early and often. He sends letters, extends dinner invitations, appears during random encounters to observe and comment, and occasionally saves the Acolytes from lesser threats — casually, effortlessly — to demonstrate that they survive by his sufferance. He is the GM's most versatile tool: a source of dread, dark humour, exposition, and dramatic tension, deployable in any scene where the players need a reminder of what they are truly fighting against.</p>\n<h2>Key Scenes</h2>\n<h3>Act I — Descent into the Rift</h3>\n<ul>\n<li><strong>Chapter 3: The Letter (Village of Barovus)</strong> — Strahd's first direct communication. A servitor in formal livery delivers a sealed letter to the Acolytes: cordial, welcoming, dripping with subtext. He knows their names, their mission, their association with Ireena. The postscript — <em>\"I trust you are keeping Ireena safe. She is precious to me. More precious than you know.\"</em> — is pure menace disguised as courtesy.</li>\n<li><strong>Chapter 5: First Encounter</strong> — Strahd appears in person for the first time. This is a narrative encounter, not a combat one. He arrives in his black ground-car, flanked by servitor-guards, radiating Fear (Terror Rating 3). He speaks with measured delight, demonstrates his invulnerability if attacked, and departs on his own terms. If Ireena is present, his mask slips — he calls her \"Tatyana\" and the raw hunger in his voice is the first genuine emotion the Acolytes see from him.</li>\n</ul>\n<h3>Act II — Domain of Dread</h3>\n<ul>\n<li><strong>Dinner Invitation:</strong> Strahd formally invites the Acolytes to dine at Zarovich Spire. The dinner is civil, even pleasant — fine food, fine conversation, fine wine (which Strahd cannot taste). It is also a calculated display of power and a fishing expedition for information. He probes their weaknesses, tests their resolve, and offers subtle temptations.</li>\n<li><strong>Appearances and Interventions:</strong> Strahd appears at the GM's discretion throughout Act II — observing from a distance, saving the Acolytes from a threat to demonstrate his power, or testing individual Acolytes with private encounters designed to exploit their specific vulnerabilities.</li>\n</ul>\n<h3>Act III — Zarovich Spire</h3>\n<ul>\n<li><strong>The Spire Itself:</strong> Every room, every trap, every horror within the Spire is an expression of Strahd's will. The Acolytes navigate his domain, confront his servants, and discover the full scope of his centuries-long reign. The Heart of the Spire — a warp-infused organ that sustains his immortality — must be destroyed as one of the conditions for his permanent death.</li>\n</ul>\n<h3>Act IV — Confrontation</h3>\n<ul>\n<li><strong>The Final Battle:</strong> A 3-phase combat encounter. Phase 1: Strahd fights with controlled, elegant precision. Phase 2 (below 50 Wounds or Heart threatened): all Characteristics gain +10, Fear increases to (5), he gains Psy Rating 5 and devastating psychic powers. Phase 3 (below 20 Wounds or Heart destroyed): he gains the Daemonic trait, all Unnatural multipliers increase to x3, and he fights with desperate, inhuman fury. He is only permanently destroyable if Dawn's Edge strikes the killing blow while the Rosette is active, the Heart has been destroyed, and his coffin has been destroyed.</li>\n<li><strong>Death Scene:</strong> If Ireena is present, Strahd's death is tragic — he reaches toward her, the madness clears from his eyes, and for a single, terrible moment, he is the man he was before the pact. If she is absent, he simply says: <em>\"It is... quiet. At last.\"</em></li>\n</ul>\n<h2>Relationships</h2>\n<ul>\n<li><strong>Ireena Kolyana / Tatyana:</strong> Obsessive, consuming, the axis around which his entire existence revolves. He calls her Tatyana, refuses to acknowledge her as a separate person, and pursues her with a hunger that has lasted four centuries. His feelings are a toxic blend of genuine love, possessiveness, and the Daemon Prince's curse.</li>\n<li><strong>Sergei von Zarovich (deceased):</strong> Murdered brother. Strahd loved Sergei — genuinely — and killed him anyway. The guilt is buried deep beneath centuries of rationalisation, but it surfaces in unguarded moments. Sergei's spirit persists in the Spire's crypt.</li>\n<li><strong>Madam Eva:</strong> Wary respect. She is the only person on Barovus he cannot fully control. Hints suggest a blood relationship neither will confirm. He tolerates her because she poses no direct threat and because, perhaps, she is the last connection to something he once was.</li>\n<li><strong>Inquisitor Van Richten:</strong> Dimly aware of the old Inquisitor's presence in Fortress Vallak, hiding as \"Dr. Richtus.\" Has not bothered to eliminate him — partly because Van Richten poses no real threat, partly because hunting him might be entertaining later.</li>\n<li><strong>Burgomaster Vallakovich:</strong> Amused contempt. Vallakovich's desperate \"ALL IS WELL\" governance is a source of dark entertainment.</li>\n<li><strong>Lady Fiona Wachter:</strong> Tolerates her Chaos-cult devotion because it flatters him. She worships him as a figure of dark power; he finds her useful but replaceable.</li>\n<li><strong>Baba Lysaga:</strong> The Warp-Hag who claims to be his \"spiritual mother.\" Strahd tolerates her grotesque devotion with the same indifference he extends to most of his servants.</li>\n<li><strong>The Acolytes:</strong> Entertainment. Specimens. The first interesting thing in decades. He does not want them dead — he wants them <em>tested</em>.</li>\n</ul>\n<h2>Quest Hooks</h2>\n<ul>\n<li><strong>The Dinner Invitation:</strong> Strahd's formal invitation to the Spire offers intelligence, danger, and the chance to see the antagonist's lair before the final assault.</li>\n<li><strong>The Tome of Strahd:</strong> His encrypted personal data-cogitator contains centuries of intelligence — tactical data, weaknesses, the location of his coffin, and the conditions for his permanent destruction.</li>\n<li><strong>The Letter of Passage:</strong> Strahd may offer a letter granting safe passage through his domain — a gift that is also a psychic tracking beacon.</li>\n<li><strong>The Three Relics:</strong> Dawn's Edge, the Rosette of Saint Markovia, and the Heart of the Spire's destruction are all required to end him permanently. Every relic quest leads back to Strahd.</li>\n</ul>\n<h2>Possible Outcomes</h2>\n<ul>\n<li><strong>Destroyed permanently:</strong> All three conditions met (Heart destroyed, coffin destroyed, killing blow by Dawn's Edge with Rosette active). The warp rift may collapse (Ending 1) or hold (Ending 2), depending on other factors.</li>\n<li><strong>Destroyed temporarily:</strong> Conditions not fully met. Strahd is banished but will eventually reform. The cycle continues.</li>\n<li><strong>Endures:</strong> The Acolytes fail. Strahd offers them servitude or death. The campaign ends in Ending 4.</li>\n<li><strong>Replaced:</strong> An Acolyte who accepted a dark pact from the Empyrean Vault delivers the killing blow and becomes the new lord of Barovus. Ending 5 — the darkest outcome.</li>\n</ul>"
                },
                "_id": "npc01plotconnect"
            },
            {
                "name": "GM Reference",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Mechanical Notes</h2>\n<table>\n<thead>\n<tr><th>Characteristic</th><th>WS</th><th>BS</th><th>S</th><th>T</th><th>Ag</th><th>Int</th><th>Per</th><th>WP</th><th>Fel</th></tr>\n</thead>\n<tbody>\n<tr><td><strong>Value</strong></td><td>75</td><td>60</td><td>55 (110)</td><td>60 (120)</td><td>65</td><td>70</td><td>65</td><td>80 (160)</td><td>75</td></tr>\n</tbody>\n</table>\n<p><strong>Wounds:</strong> 85 | <strong>Armor:</strong> AP 8 all (warp-infused carapace) | <strong>Movement:</strong> 6/12/18/36 | <strong>Threat:</strong> Dire</p>\n<h3>Key Abilities</h3>\n<ul>\n<li><strong>Regeneration (10):</strong> Recovers 10 Wounds per round. Negated for 1 round by Dawn's Edge, holy weapons, or blessed ammunition.</li>\n<li><strong>Warp Phase (Half Action):</strong> Becomes incorporeal — immune to mundane attacks, passes through solid matter. Psychic, force, and holy weapons still affect him.</li>\n<li><strong>Domination (Half Action, 20m):</strong> Target must pass <em>WP test at -20</em> or be controlled for 1d5 rounds. New WP test at -10 each turn to break free.</li>\n<li><strong>Life Drain (melee/touch):</strong> 1d10 Wounds ignoring armour and TB. Strahd heals equal damage. Target reduced to 0 Wounds dies and rises as Warp-Thrall in 1d5 rounds.</li>\n<li><strong>Castle Command (Lair Actions at Initiative 0):</strong> Phase through walls (unlimited Spire reposition), command up to 6 servitors, seal room exits (<em>Strength -30</em> or <em>Tech-Use -20</em>), or Warp Surge (1d10 E + WP test or 1d5 Corruption).</li>\n</ul>\n<h3>Phase Escalation</h3>\n<ul>\n<li><strong>Phase 2</strong> (below 50 Wounds or Heart threatened): +10 all Characteristics. Fear (5). Psy Rating 5. Gains Warp Lightning (2d10+8 E, 30m, up to 3 targets), Telekinetic Storm (15m, <em>Ag test</em> or Prone + 1d10+5 I), Psychic Shriek (10m, <em>WP test</em> or Stunned 1 round + 1d10 Insanity).</li>\n<li><strong>Phase 3</strong> (below 20 Wounds or Heart destroyed): Gains Daemonic trait. Unnatural multipliers to x3. Fear (6). Warp Instability (banished on failed WP at 0 Wounds — unless Dawn's Edge dealt killing blow while Rosette active). Partially translucent, warp-fire beneath skin. Desperate, inhuman fury.</li>\n</ul>\n<h3>Weapons</h3>\n<ul>\n<li><strong>\"Grief\"</strong> — Master-crafted power sword (Melee; 1d10+12 E; Pen 7; Power Field, Balanced)</li>\n<li><strong>Integrated inferno pistol</strong> (10m; S/--/--; 1d10+12 E; Pen 12; Clip 3)</li>\n<li><strong>Warp Lightning</strong> (Phase 2+; 30m; 2d10+8 E; Pen 6; up to 3 targets within 5m)</li>\n</ul>\n<h2>Skill Tests</h2>\n<table>\n<thead>\n<tr><th>Situation</th><th>Test</th><th>Difficulty</th><th>Notes</th></tr>\n</thead>\n<tbody>\n<tr><td>Engaging Strahd in conversation</td><td><em>Fellowship</em></td><td>Hard (-20)</td><td>Success earns his interest; he may share partial truths or grant a minor boon</td></tr>\n<tr><td>Lying to Strahd</td><td><em>Deceive</em></td><td>Very Hard (-30)</td><td>He has <em>Scrutiny +20</em>; failure amuses him; catastrophic failure provokes consequences</td></tr>\n<tr><td>Intimidating Strahd</td><td><em>Intimidate</em></td><td>Impossible (-60)</td><td>Cannot succeed under normal circumstances; a wielder of Dawn's Edge reduces to Very Hard (-30)</td></tr>\n<tr><td>Resisting Domination</td><td><em>Willpower</em></td><td>Hard (-20)</td><td>+20 if bearing the Rosette; auto-success for bearer and allies within 5m of Rosette</td></tr>\n<tr><td>Resisting Aura of Domination (passive)</td><td><em>Willpower</em></td><td>Very Hard (-30)</td><td>Failure imposes -10 to all WP tests for the remainder of the scene</td></tr>\n<tr><td>Detecting Strahd's presence (scrying through Thralls)</td><td><em>Psyniscience</em></td><td>Challenging (+0)</td><td>Success reveals that a Warp-Thrall's senses are being used as a remote conduit</td></tr>\n<tr><td>Recalling lore about Strahd</td><td><em>Forbidden Lore (Warp)</em></td><td>Challenging (+0)</td><td>+20 if the Acolytes have consulted Van Richten or decoded the Tome</td></tr>\n</tbody>\n</table>\n<h2>Items &amp; Resources</h2>\n<ul>\n<li><strong>\"Grief\" (power sword):</strong> Strahd's personal weapon. If somehow claimed by an Acolyte, it functions as a master-crafted power sword but inflicts 1 Corruption Point per day carried — it is saturated with warp energy.</li>\n<li><strong>Spire Master Control Signet:</strong> Controls all mechanical and warp-animated systems within Zarovich Spire. Useless outside the Spire. If claimed after Strahd's death, it grants the bearer control of remaining servitors and door mechanisms.</li>\n<li><strong>Personal Teleportarium Beacon:</strong> Functions only within the Spire. Allows instantaneous relocation to any room. Keyed to Strahd's psychic signature — an Acolyte with Psyniscience may attempt a <em>Very Hard (-30) Tech-Use</em> test to re-key it.</li>\n<li><strong>Strahd's Letter of Passage:</strong> May be offered to the Acolytes. Grants safe passage through Strahd's forces but functions as a psychic tracking beacon — Strahd always knows the bearer's location and emotional state. Detecting this requires <em>Challenging (-10) Psyniscience</em> or <em>Hard (-20) Forbidden Lore (Warp)</em>.</li>\n</ul>\n<h2>Common GM Questions</h2>\n<h3>When should Strahd appear?</h3>\n<p>Early and often. He is not a final boss who hides until the last session. Have him send letters, appear during random encounters to observe and comment, extend dinner invitations, and occasionally save the Acolytes from a threat to demonstrate that they survive by his sufferance. Every appearance should be on his terms, at a time and place of his choosing.</p>\n<h3>Can the Acolytes fight Strahd before the final battle?</h3>\n<p>Yes, but they cannot kill him. His Regeneration (10) outpaces any damage they can inflict without the relics. He fights defensively, retreats when pressed, and uses the environment as a weapon. These encounters should teach the players that preparation — not brute force — is the path to victory.</p>\n<h3>How does Strahd react to the Acolytes acquiring relics?</h3>\n<p>He becomes more aggressive and less playful. Each relic represents a genuine threat to his existence. He may attempt to steal or destroy relics, send his most powerful servants to intercept the Acolytes, or escalate his personal appearances from \"amused observer\" to \"deadly predator.\" He never panics, but his courtesy thins.</p>\n<h3>What if Strahd is reduced to 0 Wounds outside the final battle?</h3>\n<p>He retreats to his coffin in the Spire via Warp Phase, regenerates over 24 hours, and returns at full strength. He cannot be permanently destroyed unless the coffin is also destroyed and the killing blow is struck by Dawn's Edge while the Rosette is active. If his coffin has already been destroyed, he is banished to the warp for 1d10 days before reforming — unless the full conditions for permanent destruction are met.</p>\n<h3>How does Strahd treat Ireena when they meet?</h3>\n<p>His composure cracks. He calls her \"Tatyana.\" The cultured mask slips and reveals something raw, vast, and hungry beneath. He takes a step toward her, the air ripples with psychic energy, and for a moment, he is not a bored immortal playing games — he is a desperate man reaching for the one thing he cannot have. He will not harm Ireena directly. He wants to <em>claim</em> her, not destroy her. This restraint can be exploited tactically.</p>\n<h3>Should Strahd ever be genuinely helpful?</h3>\n<p>Yes, occasionally. He may warn the Acolytes about a genuine danger, provide information about a mutual enemy, or eliminate a threat they cannot handle. This is never altruism — it is manipulation, designed to create confusion, dependency, or a sense of debt. But the help is real, and the information is accurate. Strahd does not need to lie. The truth serves him well enough.</p>"
                },
                "_id": "npc01gmreference"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "role": "antagonist"
            }
        }
    },
    {
        "name": "Ireena Kolyana",
        "pages": [
            {
                "name": "Profile",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<blockquote><p>She is younger than you expected — perhaps mid-twenties, with dark hair pulled back from a pale, angular face that is striking in its intensity. Her eyes are a deep violet that seems to shift and shimmer in the dim light — an unusual colour, even for the genetically diverse populations of the Imperium. She wears practical clothing — a worn bodyglove under a heavy coat — and carries an autopistol with the comfort of someone who has used it recently and often. Two marks mar the pale skin of her throat — circular, puckered wounds, partially healed, ringed with faint discolouration that pulses with a barely visible luminescence. She sees you looking and pulls her collar higher.</p></blockquote>\n<h2>Key Facts</h2>\n<table>\n<thead>\n<tr><th>Detail</th><th>Value</th></tr>\n</thead>\n<tbody>\n<tr><td><strong>Role</strong></td><td>Escort NPC — The Tragic Heart of the Campaign</td></tr>\n<tr><td><strong>Location(s)</strong></td><td>Burgomaster's Manor, Village of Barovus (Act I); travels with the party (Acts I-IV)</td></tr>\n<tr><td><strong>Threat Level</strong></td><td>Non-combatant (Latent Psyker — involuntary abilities)</td></tr>\n<tr><td><strong>Allegiance</strong></td><td>The Acolytes (if trust is earned); herself; the people of Barovus</td></tr>\n<tr><td><strong>Key Items</strong></td><td>Autopistol, father's aquila pendant, latent psychic potential</td></tr>\n</tbody>\n</table>\n<h2>Background</h2>\n<p>Ireena Kolyana is the latest reincarnation of Tatyana — the woman Strahd von Zarovich has been obsessed with for over four centuries. She does not know this. She knows only that she was found as an infant on the Burgomaster's doorstep, wrapped in cloth of unusual quality, with no note and no explanation. Kolyan Indirovich, the childless Burgomaster of Barovus Village, took her in and raised her alongside his adopted son Ismark. She has lived her entire life in the village, educated by the local Ministorum, aware that she is different but not understanding how or why.</p>\n<p>Strahd's attention fell upon her two years ago. At first it was subtle — propaganda servitors lingering near her home, the Burgomaster receiving pointed vox-caster messages about his \"lovely daughter.\" Then the visits began. Strahd came to the manor in person, bypassing every defence as though the barricades were paper. He touched her throat with fingers cold as void-ice, and each time he drained something from her — not blood in any conventional sense, but life force, soul-stuff, a warp-touch that left physical marks. The circular scars on her throat pulse with faint psychic energy. Her father spent his final weeks holding the door against Strahd's creatures, a battered bolt pistol in one hand and prayers on his lips, until his heart simply gave out.</p>\n<p>In recent months, Ireena has begun experiencing psychic phenomena she cannot explain or control. Objects move when she is emotional. Candle flames bend toward her. She hears whispers others do not. She has told no one. She is terrified of what she might be — on a world where the warp bleeds through reality, an unregistered psyker is not merely illegal but catastrophically dangerous. A <em>Psyniscience test (Challenging +0)</em> reveals that she is an emerging psyker of extraordinary latent power — but her psychic signature registers strangely: old, layered, resonating with echoes that span centuries.</p>\n<h2>Appearance &amp; Demeanor</h2>\n<p>Ireena is a young woman in her mid-twenties with dark auburn hair, a pale angular face, and violet eyes that hold more depth than they should — eyes that shift and shimmer in certain light, carrying a quality that is unsettling in its intensity. She bears a faint resemblance to portraits of Tatyana that hang in Zarovich Spire, though she does not know this. On her neck, two circular scars mark where Strahd's fingers touched her during his visits. The skin around them is faintly discoloured, as if bruised from within, and pulses with barely visible luminescence.</p>\n<p>She dresses practically — a worn bodyglove under a heavy coat, sturdy boots, her hair pulled back and out of her way. She moves with the cautious awareness of someone who has spent weeks behind barricades, flinching at sounds in the night. But beneath the wariness there is steel. Her voice is steady even when her hands tremble. She meets eyes directly. She does not cry in front of strangers, and she does not accept pity. When she speaks of Strahd, her jaw sets and her violet eyes darken, and there is something in her expression that is older and fiercer than a village girl has any right to be.</p>"
                },
                "_id": "f096370330c24871"
            },
            {
                "name": "Roleplaying Guide",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Personality Core</h2>\n<p>Ireena's defining quality is <strong>quiet determination</strong>. She is not a warrior, not a hero in any conventional sense — she is a young woman trapped in an impossible situation who has decided, consciously and deliberately, that she will not break. This decision costs her. The determination is not effortless; it is maintained through constant, exhausting effort against fear, grief, and a growing awareness that something is fundamentally wrong with her.</p>\n<p>She is intelligent and practical, traits inherited from a life of managing a household under siege. She does not trust easily — she has watched authority figures fail her entire life. Strahd, Vallakovich, the Ministorum — every institution that should have protected her people has either been corrupted, broken, or simply absent. The Acolytes will need to earn her cooperation through actions, not words. She responds to honesty and competence, not rank or rhetoric.</p>\n<p>Beneath the practical exterior, Ireena carries two warring impulses. The first is anger — at Strahd, at the situation, at her own helplessness, at a universe that chose her for suffering she did not earn and does not understand. This anger drives her forward when fear would paralyse her. The second is compassion — deep, stubborn, and sometimes self-destructive. She cannot walk past suffering without trying to help, even when helping puts her at risk. These impulses — the anger and the compassion — are both inherited from Tatyana, though Ireena does not know this. They are the qualities that have drawn Strahd to her soul across four centuries of reincarnation.</p>\n<h2>Voice &amp; Mannerisms</h2>\n<p>Ireena speaks directly, without embellishment. Her sentences are short and purposeful — she does not waste words. Her voice is low and steady, with a faint Barovian accent that thickens when she is emotional. She has a habit of pulling her collar higher when uncomfortable — an unconscious gesture to cover the marks on her throat. When thinking, she touches her father's aquila pendant. When angry, she goes still and quiet rather than loud — her fury is cold, not hot.</p>\n<p>Example quotes:</p>\n<ul>\n<li><em>\"If you have come to gawk at the Lord-Governor's prey, you may leave. If you have come to help, then help. My father needs to be buried before nightfall.\"</em> — Her first words to the Acolytes, establishing her refusal to be pitied.</li>\n<li><em>\"My name is Ireena. And you will not touch me again.\"</em> — Spoken to Strahd's face, with a steady voice and white-knuckled grip on her autopistol.</li>\n<li><em>\"I dream of a balcony. Mist below, a man behind me, and the certainty that falling is better than staying. I have had this dream every night for six months. Tell me what it means.\"</em> — Confided to an Acolyte she trusts, when her past-life memories begin surfacing.</li>\n<li><em>\"Do not promise me safety. There is no safety on Barovus. Promise me you will try. That is enough.\"</em> — When the Acolytes offer to protect her.</li>\n<li><em>\"Something moved. Inside me. I felt it — like a door opening in a room I didn't know existed. I am afraid of what is on the other side.\"</em> — Describing her psychic awakening, quietly terrified.</li>\n</ul>\n<h2>What She Wants</h2>\n<p><strong>Immediate:</strong> Her father buried with proper rites. Escape from Barovus Village to somewhere defensible — Fortress Vallak, then Krezk. To survive the next night, and the one after that.</p>\n<p><strong>Deeper:</strong> To understand what she is. Her psychic abilities are growing, and each manifestation terrifies her more than the last. She wants answers — about the marks on her throat, about the dreams of lives she has never lived, about the violet shimmer in her eyes that she sees in mirrors and does not recognise. Most deeply, she wants to be free — not just from Strahd, but from the feeling that she is not entirely herself, that something vast and old is waking up inside her.</p>\n<h2>What She Fears</h2>\n<ul>\n<li><strong>Strahd claiming her:</strong> Not death — something worse. The marks on her throat are not merely wounds; they are a connection, and each time Strahd drains her, the connection grows stronger. She can feel him sometimes, at the edge of her awareness, a cold pressure that is almost intimate. This terrifies her more than anything.</li>\n<li><strong>Her own powers:</strong> She has witnessed what uncontrolled psykers become on a warp-saturated world. She is afraid that her emerging abilities will consume her, corrupt her, or mark her as a target for something worse than Strahd.</li>\n<li><strong>The pull toward Strahd:</strong> To her horror, she feels a strange attraction to him — not romantic, but gravitational, as if her soul recognises his. This is the residual soul-bond from Tatyana's curse, and Ireena interprets it as a sign that she is already being corrupted. She is wrong, but the fear is real.</li>\n<li><strong>Losing Ismark:</strong> Her brother is all she has left. The thought of him dying to protect her — which he absolutely would — is unbearable.</li>\n</ul>\n<h2>Reactions</h2>\n<p><strong>Respect:</strong> Ireena opens up slowly to Acolytes who treat her as a person rather than a mission objective. Honest, direct communication earns her trust. She values competence and despises condescension. An Acolyte who asks her opinion, includes her in planning, and treats her as an equal will earn her fierce loyalty.</p>\n<p><strong>Threats:</strong> She does not cower. Threats make her quiet and still — her anger goes cold. She will comply if the threat is credible, but she will remember, and her cooperation will become minimal and grudging.</p>\n<p><strong>Questions about Strahd:</strong> She tenses visibly. Her hand goes to her collar. She will answer — she is practical enough to share useful information — but the words come through clenched teeth. She describes his visits in clipped, clinical terms, as though reporting a battlefield injury.</p>\n<p><strong>Displays of faith:</strong> Ireena responds to genuine faith with a mixture of hope and scepticism. She was raised in the Ministorum tradition but has watched faith fail to protect her world for her entire life. An Acolyte whose faith is sincere and backed by action will rekindle something in her. An Acolyte who mouths platitudes without substance will earn her contempt.</p>\n<p><strong>Displays of weakness:</strong> She is surprisingly gentle with the weakness of others. She has seen too many broken people to judge them for cracking under pressure. She will offer quiet comfort — a hand on a shoulder, a practical suggestion, a firm \"Get up. We keep moving.\"</p>\n<p><strong>Unexpected competence:</strong> This earns a rare, genuine smile. She notices skill. She appreciates people who are good at what they do, because competence is survival on Barovus.</p>"
                },
                "_id": "npc02roleplay001"
            },
            {
                "name": "Plot Connections",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Story Role</h2>\n<p>Ireena is the emotional and narrative heart of the campaign. She is the person the Acolytes must protect, the key to Strahd's obsession, the living anchor of a four-century-old curse, and — depending on how the campaign unfolds — either a powerful ally, a tragic sacrifice, or a devastating loss. Her fate is the campaign's most significant narrative variable, carrying enormous emotional and mechanical weight.</p>\n<p>Critically, Ireena is <strong>not a quest item</strong>. She is a fully-realised character with opinions, fears, and agency. If the Acolytes try to stash her somewhere \"safe\" and ignore her, she will make her own decisions — potentially dangerous ones. If they include her, respect her, and help her develop her psychic abilities, she becomes a powerful asset. The GM should play her as someone who actively participates in the story, not as a passive object to be transported from point A to point B.</p>\n<p>The tragic irony at the heart of Ireena's arc is that she is doomed. In every previous incarnation, Tatyana has died before Strahd could claim her. This cycle can only be broken if the Acolytes destroy Strahd — otherwise, fate will find a way to kill her. The GM should make this tension palpable: close calls, near misses, moments where death almost claims her through accident, ambush, or the sheer malice of the universe.</p>\n<h2>Key Scenes</h2>\n<h3>Act I — Descent into the Rift</h3>\n<ul>\n<li><strong>Chapter 3: Meeting Ireena (Burgomaster's Manor)</strong> — Behind barricades, grieving her father, fierce and frightened. She will not leave until her father receives proper funeral rites. The marks on her throat are the Acolytes' first physical evidence of Strahd's nature.</li>\n<li><strong>Chapter 3: The Funeral</strong> — Ireena stands vigil as her father is laid to rest by the broken Father Donavich. A solemn, defining moment where the Acolytes see her strength.</li>\n<li><strong>Chapter 5: First Encounter with Strahd</strong> — If Ireena is present, Strahd's mask slips entirely. He calls her \"Tatyana.\" The air ripples with psychic energy. Ireena stands her ground: <em>\"My name is Ireena. And you will not touch me again.\"</em> This scene establishes the triangle that drives the campaign.</li>\n</ul>\n<h3>Act II — Domain of Dread</h3>\n<ul>\n<li><strong>Escort to Fortress Vallak:</strong> The journey westward with Ireena and Ismark is the Acolytes' core Act II mission. Strahd's forces probe the group, testing defences, probing for weaknesses.</li>\n<li><strong>Psychic Awakening:</strong> Ireena's powers grow throughout Act II, triggered by proximity to warp phenomena and emotional stress. The GM should introduce these gradually: objects moving, candle flames bending, whispered warnings of danger. Her Precognition and Empathic Reading manifest first, followed by the involuntary Psychic Scream when directly threatened.</li>\n<li><strong>Past-Life Dreams:</strong> Ireena begins dreaming of lives she never lived — fragments of Tatyana's memories across centuries. A balcony in the mist. A man with blood on his hands. A wedding dress stained red. These dreams intensify as the campaign progresses and provide narrative clues about Strahd's history.</li>\n</ul>\n<h3>Act IV — Confrontation</h3>\n<ul>\n<li><strong>Ireena's Fate:</strong> The campaign's most significant narrative branch point. Four possible outcomes, each with profound mechanical and emotional consequences.</li>\n</ul>\n<h2>Relationships</h2>\n<ul>\n<li><strong>Ismark Kolyana:</strong> Her brother, her protector, the last of her family. She loves him deeply and worries constantly about his tendency to put himself between her and danger. Their bond is the campaign's most grounding human relationship.</li>\n<li><strong>Strahd von Zarovich:</strong> Fear, hatred, and a horrifying involuntary pull. The marks on her throat are a psychic connection that grows stronger each time he drains her. She feels his presence at the edge of her awareness — cold, hungry, patient. She hates him with every fibre of her being and is terrified by the part of her that recognises him.</li>\n<li><strong>Kolyan Indirovich (deceased):</strong> Her adopted father. She mourns him fiercely and carries his aquila pendant as a talisman. His death fuels her anger and her resolve.</li>\n<li><strong>Sergei von Zarovich (spirit):</strong> She does not know Sergei, but her soul does. If brought to his tomb, recognition sparks instantly — not learned, but <em>remembered</em>. This connection is the key to Outcome 1.</li>\n<li><strong>The Acolytes:</strong> Potential protectors, potential allies, the first competent outsiders she has ever met. Her trust is earned through action and honesty. Once given, it is absolute.</li>\n<li><strong>Father Donavich:</strong> She pities the broken priest but does not rely on him. His failure represents the failure of every institution on Barovus.</li>\n</ul>\n<h2>Quest Hooks</h2>\n<ul>\n<li><strong>Escort to Safety (Acts I-II):</strong> The core escort mission — transport Ireena from Barovus Village to Fortress Vallak, then potentially to Krezk Biologis Facility.</li>\n<li><strong>Psychic Development (Act II-III):</strong> If the Acolytes help Ireena understand and develop her powers, she can become a Psy Rating 3 ally with Precognition, an upgraded Psychic Shriek (3d10 E to warp-touched in 10m), and Warp Disruption (suppresses Strahd's Regeneration within 15m).</li>\n<li><strong>Past-Life Investigation:</strong> Ireena's fragmented memories of past lives can be investigated — through Sergei's tomb, the Tome of Strahd, or Madam Eva's readings — to unlock the truth of the reincarnation cycle.</li>\n<li><strong>Breaking the Cycle:</strong> The ultimate resolution of Ireena's arc requires understanding the reincarnation curse and choosing one of the four possible outcomes.</li>\n</ul>\n<h2>Possible Outcomes</h2>\n<h3>Outcome 1: Reunited with Sergei (Peace)</h3>\n<p>If the Acolytes bring Ireena to Sergei's tomb and his spirit has been freed, Ireena remembers — not as learning, but as <em>waking up</em>. She speaks Sergei's name in a voice layered with centuries of memory. Their hands touch. Light fills the tomb — not warp-light, but something clean, warm, and unbearably beautiful. Both spirits depart together, at peace. The reincarnation cycle permanently breaks. The psychic resonance weakens the warp rift. All witnesses may remove <strong>1d10 Corruption Points</strong>.</p>\n<h3>Outcome 2: Taken by Strahd (Tragedy)</h3>\n<p>If the Acolytes fail to protect Ireena during the final battle, Strahd drains her completely. Her psychic death-scream is heard by every psyker on Barovus. Strahd is restored to full Wounds, Phase 3 triggers immediately, and its duration extends to 12 rounds. This is the worst possible outcome — a near-catastrophic setback that makes the final battle exponentially harder.</p>\n<h3>Outcome 3: Survives Independently (Bittersweet)</h3>\n<p>If protected throughout the final battle but not reunited with Sergei, Ireena survives as a powerful emerging psyker. The trauma has fully awakened her abilities. Post-campaign, she is identified by the Inquisition and either recruited into the Ordo Malleus or sent to the Scholastica Psykana. She carries the psychic imprint of centuries of reincarnation — powerful, resilient, and haunted.</p>\n<h3>Outcome 4: Self-Sacrifice (Heroic)</h3>\n<p>If the Acolytes have decoded the Tome of Strahd and shared its contents with Ireena, she may choose to sacrifice herself to break the cycle. She understands that her soul anchors Strahd's pact — that his obsession sustains his connection to the Daemon Prince. In a moment of terrible resolve, she unleashes her full psychic potential in a final, fatal act of will. The pact shatters. Strahd suffers <strong>4d10 Wounds</strong> and is Stunned for 1d5 rounds. Phase 3 is removed or ended immediately. Witnesses must pass <em>Challenging (+0) WP</em> or gain 1d5 Insanity Points, but also remove <strong>1d5 Corruption Points</strong>.</p>"
                },
                "_id": "npc02plotconnect"
            },
            {
                "name": "GM Reference",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Mechanical Notes</h2>\n<table>\n<thead>\n<tr><th>Characteristic</th><th>WS</th><th>BS</th><th>S</th><th>T</th><th>Ag</th><th>Int</th><th>Per</th><th>WP</th><th>Fel</th></tr>\n</thead>\n<tbody>\n<tr><td><strong>Value</strong></td><td>25</td><td>20</td><td>25</td><td>30</td><td>35</td><td>40</td><td>50</td><td>55</td><td>45</td></tr>\n</tbody>\n</table>\n<p><strong>Wounds:</strong> 10 | <strong>Armor:</strong> None | <strong>Movement:</strong> 3/6/9/18 | <strong>Threat:</strong> Non-combatant</p>\n<h3>Key Abilities</h3>\n<ul>\n<li><strong>Precognition (Passive):</strong> +10 to Initiative rolls. Periodically receives fragmented visions of imminent danger — narrative warnings at the GM's discretion (\"Don't open that door,\" \"He's behind us\"). Not mechanically reliable but narratively powerful.</li>\n<li><strong>Empathic Reading (Passive, 10m):</strong> Automatically detects strong emotions — hostility, deception (+10 to allies' <em>Scrutiny</em> against the source), or warp-taint in nearby individuals.</li>\n<li><strong>Psychic Scream (Involuntary):</strong> Triggered when directly threatened with violence or when Strahd attempts Domination. All creatures within 5m must pass <em>WP test</em> or be Stunned for 1 round. Warp-touched entities also suffer 1d10 E damage (ignoring armour). Leaves Ireena Fatigued. 20% chance of triggering Psychic Phenomena per use.</li>\n</ul>\n<h3>If Psychic Potential Is Fully Awakened (Tarot Draw 10 or GM discretion)</h3>\n<ul>\n<li>Becomes Psy Rating 3</li>\n<li><strong>Upgraded Psychic Shriek:</strong> 3d10 E damage to warp-touched entities within 10m</li>\n<li><strong>Warp Disruption:</strong> Suppresses Strahd's Regeneration within 15m</li>\n<li>Strahd cannot bring himself to harm her directly — her proximity causes him to hesitate</li>\n</ul>\n<h3>Combat Behaviour</h3>\n<p>Ireena is <strong>not</strong> a combatant. She carries an autopistol (30m; S/--/6; 1d10+2 I; Pen 0) and can use it under duress, but her BS 20 means she hits rarely. In combat, she takes cover, stays near the strongest protector, and uses her Empathic Reading to call out hidden threats. Her Psychic Scream activates involuntarily when she is directly attacked — this can be tactically useful but is unreliable and carries Phenomena risk. The GM should never have Ireena \"solve\" a combat for the Acolytes; her value is narrative and informational, not martial.</p>\n<h2>Skill Tests</h2>\n<table>\n<thead>\n<tr><th>Situation</th><th>Test</th><th>Difficulty</th><th>Notes</th></tr>\n</thead>\n<tbody>\n<tr><td>Earning Ireena's trust</td><td><em>Charm</em> or <em>Fellowship</em></td><td>Challenging (+0)</td><td>Honest, direct communication. Actions speak louder than words — helping with the funeral, treating her as a person, not a mission objective</td></tr>\n<tr><td>Convincing Ireena to leave the village</td><td><em>Charm</em> or <em>Logic</em></td><td>Hard (-20) before funeral; Ordinary (+10) after</td><td>She absolutely will not leave until her father is buried with proper rites</td></tr>\n<tr><td>Detecting Ireena's psychic nature</td><td><em>Psyniscience</em></td><td>Challenging (+0)</td><td>She registers as a latent psyker — but the signature is strange: old, layered, resonating with centuries of echoes</td></tr>\n<tr><td>Examining the marks on her throat</td><td><em>Awareness</em> or <em>Medicae</em></td><td>Challenging (+0)</td><td>Not conventional wounds — they radiate faint psychic energy. Strahd drains life force/soul through warp-touch</td></tr>\n<tr><td>Helping Ireena develop her powers</td><td><em>Forbidden Lore (Warp)</em> or <em>Scholastic Lore (Occult)</em></td><td>Hard (-20)</td><td>Requires multiple sessions of in-character mentorship. Success gives her control over Precognition and Empathic Reading; further success unlocks full potential</td></tr>\n<tr><td>Convincing Ireena of her past lives</td><td><em>Charm</em> or present evidence</td><td>Varies</td><td>The Tome of Strahd, Sergei's tomb, or portraits of Tatyana provide evidence. Without evidence, she resists — the truth is too terrifying</td></tr>\n</tbody>\n</table>\n<h2>Items &amp; Resources</h2>\n<ul>\n<li><strong>Autopistol:</strong> Functional but she is a poor shot (BS 20). One spare clip.</li>\n<li><strong>Father's Aquila Pendant:</strong> A simple devotional amulet. No mechanical properties, but it is her most precious possession and her touchstone for courage. If lost or destroyed, she suffers -10 to WP tests until she finds a replacement symbol of faith.</li>\n<li><strong>Latent Psychic Potential:</strong> Her most valuable \"item\" is herself. If awakened, her powers can suppress Strahd's Regeneration and cause him to hesitate in her presence — tactical advantages that no weapon can replicate.</li>\n<li><strong>Information:</strong> Ireena knows the village and its people, the basic geography of western Barovus, and practical details about surviving daily life under Strahd's rule. She can provide local knowledge equivalent to <em>Common Lore (Barovus)</em> at +10.</li>\n</ul>\n<h2>Common GM Questions</h2>\n<h3>How do I make Ireena feel like a person, not a package?</h3>\n<p>Give her opinions. Have her disagree with the Acolytes' plans. Have her notice things they miss (via Empathic Reading and Precognition). Let her comfort wounded NPCs, argue with Ismark, and react to the horrors of Barovus with her own emotional responses. She should speak in every social scene, contribute to planning discussions, and occasionally make decisions that complicate the Acolytes' lives — not because she is difficult, but because she is a person with her own judgment.</p>\n<h3>What happens if the Acolytes stash her somewhere and leave?</h3>\n<p>She will not sit passively. If left at Fortress Vallak, she begins investigating Strahd on her own — speaking to Van Richten (if present), exploring the garrison's records, and potentially getting herself into danger. If left at Krezk, she may fall under Magos Abaron's interest. The cycle is doom: Tatyana always dies unless the Acolytes are actively present to protect her. Leaving her unguarded is an invitation for fate to intervene.</p>\n<h3>When should her psychic powers manifest?</h3>\n<p>Gradually, throughout Act II. Start with subtle effects — candle flames bending, a whispered warning before an ambush, sensing deception in an NPC. Escalate to the involuntary Psychic Scream during a direct attack. Full awakening (if it occurs) should happen in late Act III or Act IV, as a dramatic crescendo tied to emotional catharsis.</p>\n<h3>How does she react when she learns about Tatyana?</h3>\n<p>Devastation, followed by furious determination. The revelation that she is not entirely herself — that her soul has been recycled through centuries of suffering to feed a monster's obsession — is the most destabilising thing she can learn. Give her a scene to process it: anger, tears, a moment of despair, and then the cold, fierce resolve that defines her. \"He can't have me. Not this time. Not ever again.\"</p>\n<h3>Can Ireena die before Act IV?</h3>\n<p>Technically yes, but the GM should work hard to prevent it. Use Precognition warnings, Psychic Screams, and dramatic near-misses to keep her alive. If she dies early, the campaign loses its emotional core and the reincarnation cycle triggers — another incarnation will be born, but not within the campaign's timeframe. This should be treated as a significant narrative failure, not a routine casualty.</p>"
                },
                "_id": "npc02gmreference"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "role": "escort-npc"
            }
        }
    },
    {
        "name": "Ismark Kolyana",
        "pages": [
            {
                "name": "Profile",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<blockquote><p>He is a tall, broad-shouldered man in his early thirties, wearing the battered remnants of an Imperial Guard uniform — the markings of the Barovian 12th Infantry, a regiment that existed three centuries ago. He carries a chainsword at his hip, old but immaculately maintained, and moves with a soldier's discipline that sits uneasily alongside the exhaustion in his face. His dark hair is unkempt, his jaw unshaven, and his brown eyes carry the haunted look of a man who has been standing watch too long with no relief in sight. He runs a hand through his hair and looks at you with desperate intensity.</p></blockquote>\n<h2>Key Facts</h2>\n<table>\n<thead>\n<tr><th>Detail</th><th>Value</th></tr>\n</thead>\n<tbody>\n<tr><td><strong>Role</strong></td><td>Ally NPC — Quest-Giver, Combat Support, Escort Companion</td></tr>\n<tr><td><strong>Location(s)</strong></td><td>Village of Barovus (Act I); travels with the party (Acts I-II)</td></tr>\n<tr><td><strong>Threat Level</strong></td><td>Ordinary — competent soldier, solid baseline fighter</td></tr>\n<tr><td><strong>Allegiance</strong></td><td>Ireena; the people of Barovus; the Acolytes (once trust is established)</td></tr>\n<tr><td><strong>Key Items</strong></td><td>Father's chainsword, lasgun (well-maintained), patched PDF uniform</td></tr>\n</tbody>\n</table>\n<h2>Background</h2>\n<p>Ismark Kolyanovich is the adopted son of the late Burgomaster Kolyan Indirovich of Barovus Village. Like Ireena, he was taken in by the childless Burgomaster, though Ismark's origins are less mysterious — he was the orphaned son of a PDF trooper killed during a mutant incursion. He grew up in the Burgomaster's manor alongside Ireena, trained from youth in the practical skills of survival that life on Barovus demands.</p>\n<p>He served a three-year conscription in the Barovus Planetary Defence Force — a grand title for what amounted to standing watch on the village walls and fighting off mutant incursions from the forest. The PDF uniform he still wears bears the markings of the Barovian 12th Infantry, a regiment that technically existed three centuries ago but whose traditions persist through sheer inertia. He is a competent soldier but not an exceptional one — trained in small-arms use, basic tactics, and the grim pragmatism of a man who has fought things that should not exist. His chainsword was his father's, passed to him by the Burgomaster, and he maintains it with a care that borders on reverence.</p>\n<p>The villagers call him \"Ismark the Lesser\" — a comparison to his father that cuts deep. Kolyan Indirovich was a man of quiet authority who held the village together through decades of Strahd's rule by force of character alone. Ismark knows he is not his father. He second-guesses himself constantly, drinks more than he should, and carries the weight of inadequacy like a physical burden. But when Strahd's creatures came for Ireena, Ismark stood at the barricades beside his father, chainsword in hand, every single night. When Kolyan's heart gave out, Ismark did not stop standing. He is not a hero. But he is trying to be, and that effort deserves respect.</p>\n<h2>Appearance &amp; Demeanor</h2>\n<p>Ismark is a broad-shouldered man in his early thirties with a fighter's build going slightly soft from stress and alcohol. Brown hair, brown eyes, a face that would be handsome if it were not so drawn with worry and fatigue. His jaw is perpetually shadowed with stubble. He wears a patched Barovian PDF uniform — faded olive drab, torn and repaired at the elbows and knees — and carries his father's chainsword on his hip and an ageing lasgun slung across his back, both maintained with meticulous care. His hands are calloused from weapons drill and manual labour.</p>\n<p>He carries himself like a soldier: upright, watchful, always positioning himself between potential threats and Ireena. But the discipline is undercut by exhaustion. He has not slept properly in weeks. His movements are a fraction too slow, his reactions a fraction too delayed. He compensates with stubbornness and stimulants — mostly recaf, occasionally something stronger. When he speaks, his voice is honest and direct, with the clipped cadence of a man accustomed to giving and receiving orders. He does not lie well and does not try to.</p>"
                },
                "_id": "53dc39b9e80f4240"
            },
            {
                "name": "Roleplaying Guide",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Personality Core</h2>\n<p>Ismark's defining internal conflict is between duty and doubt. He knows what he <em>should</em> be — the Burgomaster's son, the village's protector, Ireena's shield — but he is haunted by the conviction that he is not enough. \"Ismark the Lesser\" is not just a village nickname; it is the voice in his head every time he makes a decision, every time he picks up his chainsword, every time he looks at the empty chair where his father sat. He is a good man drowning in a situation that would overwhelm anyone, and his response is to keep swimming through sheer bloody-minded refusal to stop.</p>\n<p>He is brave, but his bravery is not the fearless variety. It is the courage of a man who is very much afraid and acts anyway, because the alternative — letting Ireena face this alone — is simply not acceptable. He is practical in the way that soldiers are practical: he thinks in terms of fields of fire, defensible positions, supply lines, and threat assessment. He does not understand the warp, psykers, or the deeper metaphysics of Strahd's power, and this lack of understanding frightens him more than the physical dangers. He knows something is fundamentally wrong with Barovus — the mists, the creatures, the way time seems to move differently — but he lacks the framework to make sense of it.</p>\n<p>Beneath the soldier and the worried brother, there is a man who is desperately lonely. His father is dead. His sister is marked for a fate he cannot prevent. The villagers he grew up with regard him as a lesser version of a better man. The Acolytes are the first people in his life who might actually be capable of <em>helping</em>, and the combination of hope and desperation makes him both grateful and terrified of driving them away.</p>\n<h2>Voice &amp; Mannerisms</h2>\n<p>Ismark speaks directly and honestly, without artifice or embellishment. His sentences are short, practical, and tinged with the grim humour of a soldier. He swears under his breath when stressed — mild oaths by Guard standards, shocking by civilian ones. He has a habit of checking his chainsword's activation stud when nervous, a repetitive fidget that he does not seem to be aware of. When making decisions, he pauses, visibly wrestling with doubt, before committing with sudden decisiveness — a pattern that reflects his internal battle between hesitation and resolve.</p>\n<p>Example quotes:</p>\n<ul>\n<li><em>\"You are offworlders. I can see it — the way you walk, the way you look at things, like you expect the world to make sense. It doesn't. Not here. Not for a long time.\"</em> — His introduction, mixing observation with bleak honesty.</li>\n<li><em>\"My father stood at the door with his pistol and his prayers, and each night he aged a year. I will not let that happen to Ireena. I will not.\"</em> — Quiet, absolute determination.</li>\n<li><em>\"I know what they call me. 'Ismark the Lesser.' My father earned his name. I am still earning mine.\"</em> — Volunteered reluctantly, after trust is established. The hurt is carefully controlled.</li>\n<li><em>\"I am a soldier. Not a good one, if the village is to be believed. But I know how to hold a line, and I know how to die standing. That will have to be enough.\"</em> — Self-deprecating pragmatism masking genuine courage.</li>\n<li><em>\"Strahd came to our door three times. Three times I raised my chainsword. Three times he walked past me as though I were furniture. I am done being furniture.\"</em> — The anger that drives him forward.</li>\n</ul>\n<h2>What He Wants</h2>\n<p><strong>Immediate:</strong> Get Ireena to safety. Fortress Vallak has walls and a garrison. Krezk has the Biologis facility. Anywhere that is not the undefended village where his father died. He needs the Acolytes' help because he cannot protect her on the road alone — the forests are full of mutants, warp-hounds, and worse.</p>\n<p><strong>Deeper:</strong> To prove that he is not lesser. To honour his father's memory by being the man Kolyan believed he could be. To find someone — anyone — who can explain what is happening to his world and, ideally, stop it. He does not dream of destroying Strahd; he is too practical for that. He dreams of his sister being safe and his father being proud.</p>\n<h2>What He Fears</h2>\n<ul>\n<li><strong>Failing Ireena:</strong> This is the fear that wakes him at night. He has already failed once — his father died on his watch. If Ireena dies too, he will break.</li>\n<li><strong>Being useless:</strong> The Acolytes are Inquisitorial agents — trained, equipped, empowered by the highest authority in the Imperium. Ismark is a village PDF trooper with a three-century-old chainsword. The gulf in capability is obvious and painful. He fears being dead weight.</li>\n<li><strong>What Ireena is becoming:</strong> He has noticed her emerging psychic abilities — the moving objects, the whispered warnings. He does not know what it means, but he knows that psykers on Barovus attract the wrong kind of attention. He is afraid for her in a way he cannot articulate.</li>\n<li><strong>Strahd's indifference:</strong> Not Strahd's cruelty — his <em>indifference</em>. Three times Strahd came to the manor. Three times Ismark raised his weapon. Three times Strahd walked past him as though he did not exist. Being beneath notice is worse than being feared.</li>\n</ul>\n<h2>Reactions</h2>\n<p><strong>Respect:</strong> Honest, direct communication earns Ismark's trust immediately. He responds to military professionalism, straightforward language, and anyone who treats Ireena with dignity. <em>Charm (Ordinary +10)</em> or <em>Command (Routine +20)</em> will earn his full cooperation.</p>\n<p><strong>Threats:</strong> Intimidation makes him defensive but compliant — he is too desperate to refuse help. But he remembers, and his compliance will carry a bitter edge. He has been threatened by worse than Inquisitorial Acolytes.</p>\n<p><strong>Questions about Strahd:</strong> He answers honestly and to the best of his ability. He knows Strahd has ruled for centuries, that the Mists prevent escape, that the Vostra can navigate the fog, and that other settlements exist but are equally wretched. He does not understand the warp, the pact, or Strahd's true nature. His information is practical, not esoteric.</p>\n<p><strong>Displays of faith:</strong> Ismark's faith is simple and sincere — the rough-hewn devotion of a soldier who prays before battle and does not think too deeply about theology. Genuine displays of faith comfort him. Performative piety irritates him.</p>\n<p><strong>Displays of weakness:</strong> He is surprisingly understanding, because he fights his own weakness every day. He will not mock or judge a struggling Acolyte. He will offer a hand, a grim joke, and the implicit message: <em>We keep going.</em></p>\n<p><strong>Unexpected competence:</strong> If an Acolyte demonstrates exceptional skill — especially in combat — Ismark's respect is immediate and obvious. He evaluates people by what they can <em>do</em>, not what they claim.</p>"
                },
                "_id": "npc03roleplay001"
            },
            {
                "name": "Plot Connections & GM Reference",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Story Role</h2>\n<p>Ismark is the Acolytes' first real contact on Barovus and their introduction to the human cost of Strahd's rule. He serves three narrative functions: quest-giver (he initiates the escort mission), grounding presence (he is the most relatable, human character in the campaign's early stages), and competent ally (he provides reliable combat support during Acts I and II). His arc — from desperate brother to potential leader — mirrors the campaign's broader themes of ordinary people finding courage in extraordinary circumstances.</p>\n<p>He is also a barometer for the Acolytes' behaviour. If they treat him well, he becomes loyal to the death and grows into a confident, capable leader. If they dismiss him, he becomes reckless, taking increasingly dangerous risks to prove his worth — which may get him killed. How the Acolytes treat Ismark is, in a sense, the first moral test of the campaign.</p>\n<h2>Key Scenes</h2>\n<h3>Act I — Descent into the Rift</h3>\n<ul>\n<li><strong>Chapter 3: Meeting Ismark</strong> — He finds the Acolytes shortly after arrival. His appeal is direct and desperate: help him bury his father and escort his sister to safety. This scene establishes the escort quest and introduces the human stakes of the campaign.</li>\n<li><strong>Chapter 3: The Funeral</strong> — Ismark carries his father's body to the chapel. He does not weep publicly. His composure is held together by military discipline and will shatter if he is given privacy afterward.</li>\n<li><strong>Chapter 5: First Encounter with Strahd</strong> — Ismark positions himself between Strahd and Ireena. Strahd does not acknowledge him. This moment crystallises Ismark's deepest fear and his deepest resolve.</li>\n</ul>\n<h3>Act II — Domain of Dread</h3>\n<ul>\n<li><strong>Escort to Fortress Vallak:</strong> Ismark serves as guide, combat support, and local expert during the journey. He knows the roads, the dangers, and the settlements — practical knowledge that complements the Acolytes' Imperial training.</li>\n<li><strong>Fortress Vallak arrival:</strong> Ismark's knowledge of Vallakovich and the garrison politics is valuable. He is contemptuous of the Burgomaster's \"ALL IS WELL\" propaganda and can introduce the Acolytes to reliable locals.</li>\n<li><strong>Character Development:</strong> Throughout Act II, Ismark can grow from desperate brother to emerging leader, depending on the Acolytes' influence. If included in planning and given responsibility, he rises to meet it. If sidelined, he deteriorates.</li>\n</ul>\n<h3>Act IV — Confrontation (if present)</h3>\n<ul>\n<li><strong>Tarot Draw 1 (The Warrior):</strong> If drawn as the Destined Ally, Ismark accompanies the Acolytes to the final battle. He provides +10 to <em>Command</em> tests in Barovus Village and fights to the death to protect Ireena.</li>\n</ul>\n<h2>Relationships</h2>\n<ul>\n<li><strong>Ireena Kolyana:</strong> His sister, his purpose, the person he would die for without hesitation. His protectiveness occasionally borders on overprotective, which Ireena finds both touching and frustrating.</li>\n<li><strong>Kolyan Indirovich (deceased):</strong> His adopted father and the standard he measures himself against. Kolyan's death is both a wound and a catalyst — it freed Ismark from his father's shadow even as it crushed him with grief.</li>\n<li><strong>Strahd von Zarovich:</strong> Resigned terror. Ismark speaks of Strahd the way a soldier speaks of an artillery barrage — as a force of nature to be survived, not defeated. He does not believe Strahd can be killed. Being proven wrong would transform him.</li>\n<li><strong>The Villagers:</strong> They call him \"the Lesser.\" He carries this with controlled hurt. He wants to protect them but knows they do not believe in him.</li>\n<li><strong>Burgomaster Vallakovich:</strong> Contempt. Ismark sees Vallakovich's paranoid propaganda as a failure of leadership that insults the suffering of real people.</li>\n<li><strong>The Vostra:</strong> Distrust. He does not understand how they move freely through the Mists and suspects they have made accommodations with Strahd.</li>\n<li><strong>The Acolytes:</strong> Hope. Desperate, fragile hope. They are the first competent outsiders he has ever met, and he is terrified of being disappointed.</li>\n</ul>\n<h2>Quest Hooks</h2>\n<ul>\n<li><strong>The Funeral (Act I):</strong> Help carry the Burgomaster's body to the chapel and stand guard during the rites. This earns Ismark's trust and Ireena's willingness to speak with the Acolytes.</li>\n<li><strong>Escort to Fortress Vallak (Acts I-II):</strong> The core escort mission begins here. Ismark knows the road west and can guide the party.</li>\n<li><strong>Doru in the Chapel Basement:</strong> Ismark knows about Doru — Father Donavich's mutated son chained beneath the chapel. He will not bring it up unprompted but will not lie if asked. Resolving Doru's situation (mercy killing, attempted cure, or containment) affects Father Donavich's willingness to bless ammunition and perform rites.</li>\n<li><strong>Leadership Arc:</strong> If the Acolytes support and mentor Ismark, he can eventually become the leader Barovus needs — a potential post-campaign Burgomaster or garrison commander, depending on the ending.</li>\n</ul>\n<h2>Possible Outcomes</h2>\n<ul>\n<li><strong>Grows into a leader:</strong> If treated well and given responsibility, Ismark overcomes his self-doubt and becomes a capable, respected figure. Post-campaign, he may serve as the new Burgomaster of Barovus or a garrison commander.</li>\n<li><strong>Dies protecting Ireena:</strong> If Ireena is directly threatened and Ismark is present, he will interpose himself without hesitation. His death should be meaningful and devastating — a soldier's death, standing between the thing he loves and the thing that would take it.</li>\n<li><strong>Becomes reckless and dies:</strong> If dismissed or sidelined by the Acolytes, Ismark takes increasingly desperate risks to prove his worth. This path leads to an avoidable, tragic death that should weigh on the Acolytes' conscience.</li>\n<li><strong>Survives and rebuilds:</strong> If Strahd is destroyed and Ismark lives, he dedicates himself to rebuilding Barovus. The man who was called \"the Lesser\" becomes the foundation on which a new community is built.</li>\n</ul>\n<h2>GM Reference</h2>\n<h3>Mechanical Notes</h3>\n<table>\n<thead>\n<tr><th>Characteristic</th><th>WS</th><th>BS</th><th>S</th><th>T</th><th>Ag</th><th>Int</th><th>Per</th><th>WP</th><th>Fel</th></tr>\n</thead>\n<tbody>\n<tr><td><strong>Value</strong></td><td>40</td><td>40</td><td>35</td><td>35</td><td>35</td><td>30</td><td>30</td><td>35</td><td>35</td></tr>\n</tbody>\n</table>\n<p><strong>Wounds:</strong> 14 | <strong>Armor:</strong> AP 3 (patched flak) | <strong>Movement:</strong> 3/6/9/18 | <strong>Threat:</strong> Ordinary</p>\n<h3>Skills</h3>\n<p><em>Awareness</em>, <em>Dodge</em>, <em>Parry</em>, <em>Common Lore (Barovus)</em>, <em>Survival</em>, <em>Navigate (Surface)</em></p>\n<h3>Talents</h3>\n<p>Rapid Reload, Weapon Training (Las, Chain, Solid Projectile)</p>\n<h3>Weapons</h3>\n<ul>\n<li><strong>Father's Chainsword:</strong> (Melee; 1d10+4 R; Pen 2; Tearing) — old but immaculately maintained. Ismark's most valued possession.</li>\n<li><strong>Lasgun:</strong> (Basic; 100m; S/3/--; 1d10+3 E; Pen 0; Clip 60; Reload Full) — standard PDF issue, well-maintained.</li>\n<li><strong>Autopistol (backup):</strong> (Pistol; 30m; S/--/6; 1d10+2 I; Pen 0; Clip 18; Reload Full)</li>\n</ul>\n<h3>Combat Behaviour</h3>\n<p>Ismark fights like a trained PDF trooper: disciplined, practical, and focused on protecting Ireena. He uses his lasgun at range and his chainsword in melee, defaulting to defensive fighting when outnumbered. He positions himself between threats and Ireena, and will not voluntarily leave her unprotected. He follows Acolyte tactical direction if he trusts them. His WS 40 and BS 40 make him a solid baseline fighter — not exceptional, but reliable. He does not panic, does not rout, and does not surrender while Ireena is in danger.</p>\n<h3>Skill Tests for Interacting with Ismark</h3>\n<table>\n<thead>\n<tr><th>Situation</th><th>Test</th><th>Difficulty</th><th>Notes</th></tr>\n</thead>\n<tbody>\n<tr><td>Earning his trust</td><td><em>Charm</em></td><td>Ordinary (+10)</td><td>Honest, direct communication. Military bearing helps. Helping with the funeral is an automatic success</td></tr>\n<tr><td>Commanding him in combat</td><td><em>Command</em></td><td>Routine (+20)</td><td>He follows orders readily from people he trusts. Untrusted commanders face Challenging (+0)</td></tr>\n<tr><td>Intimidating him</td><td><em>Intimidate</em></td><td>Challenging (+0)</td><td>He is too desperate to refuse help; compliance is grudging and he remembers the slight</td></tr>\n<tr><td>Extracting information about Barovus</td><td><em>Inquiry</em> or <em>Charm</em></td><td>Ordinary (+10)</td><td>He answers honestly. His knowledge is practical: roads, settlements, mutant territory, local customs</td></tr>\n<tr><td>Convincing him to leave Ireena's side</td><td><em>Charm</em> or <em>Logic</em></td><td>Very Hard (-30)</td><td>Only succeeds if the argument is genuinely compelling and Ireena is demonstrably safe</td></tr>\n</tbody>\n</table>\n<h3>Items &amp; Resources</h3>\n<ul>\n<li><strong>Local Knowledge:</strong> Ismark knows the roads between Barovus Village, the Vostra camp, and Fortress Vallak. He knows the general layout of Fortress Vallak and its politics. He can identify common mutant types and their behaviours.</li>\n<li><strong>Father's Chainsword:</strong> His most valued possession. If it is damaged or lost, Ismark suffers -10 to WP tests until it is repaired or replaced — it is his connection to his father.</li>\n<li><strong>Village Contacts:</strong> Ismark can introduce the Acolytes to key villagers, including Father Donavich and the Vostra scouts at the Blood of the Vein tavern.</li>\n<li><strong>PDF Training:</strong> He can instruct untrained characters in basic weapons handling, field medicine basics, and wilderness survival — though his skills are modest, they are better than nothing on a world with no supply lines.</li>\n</ul>\n<h3>Common GM Questions</h3>\n<h3>How tough should Ismark be in combat?</h3>\n<p>Reliable but not dominant. He should contribute meaningfully — dropping a mutant, covering fire, holding a doorway — without overshadowing the Acolytes. His WS and BS of 40 mean he hits roughly half the time, which feels right for a competent-but-not-exceptional soldier.</p>\n<h3>Should Ismark travel with the party for the entire campaign?</h3>\n<p>Typically through Acts I-II. Once Ireena reaches a defensible location, Ismark may stay to protect her while the Acolytes explore further. If drawn as the Destined Ally (Tarot Draw 1: The Warrior), he remains through the final battle. Otherwise, his role naturally transitions from active companion to background NPC once Ireena is established somewhere safe.</p>\n<h3>What if the Acolytes get Ismark killed through carelessness?</h3>\n<p>Ireena's reaction is the consequence. She will hold the Acolytes responsible — not with screaming, but with cold, wounded silence and a visible withdrawal of trust. Mechanically, her cooperation drops: she becomes harder to persuade, less forthcoming with information, and more likely to make independent (potentially reckless) decisions. Ismark's death should carry weight.</p>"
                },
                "_id": "npc03gmreference"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "role": "ally-npc"
            }
        }
    },
    {
        "name": "Madam Eva",
        "pages": [
            {
                "name": "Profile",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<blockquote><p>Madam Eva sits at a low table in the centre of her caravan. She is old — impossibly old, her face a map of deep wrinkles, her eyes milky with cataracts that somehow do not impair her sight. She is wrapped in shawls and scarves of faded silk, her fingers heavy with rings that clink softly as she shuffles a deck of hand-painted cards. Incense hangs thick in the air — not the cloying sweetness of Slaanesh but something older, earthier, like burnt sage and sacred oils. The candles — dozens of them, real wax — fill the space with flickering amber light.</p><p>She looks up as you enter, and her clouded eyes fix on you with an intensity that makes your skin prickle. \"Sit,\" she says. Her voice is the creak of an old hinge, but beneath it is iron. \"I have been waiting for you. The cards told me you were coming. They told me many things.\"</p></blockquote>\n<table><thead><tr><th>Detail</th><th>Value</th></tr></thead><tbody><tr><td><strong>Role</strong></td><td>Vostra Matriarch, Warp-Seer, Campaign Quest-Giver</td></tr><tr><td><strong>Location</strong></td><td>Vostra Camp at Tser Pool (between Village of Barovus and Fortress Vallak)</td></tr><tr><td><strong>Threat Level</strong></td><td>Non-combatant (Psy Rating 4)</td></tr><tr><td><strong>Allegiance</strong></td><td>The Emperor's Tarot / Fate itself (ambiguous)</td></tr><tr><td><strong>Key Items</strong></td><td>Emperor's Tarot deck (genuine psychically-attuned set), warp-warding charms, decades of collected esoteric lore</td></tr></tbody></table>\n<h2>Background</h2>\n<p>Madam Eva's origins are obscured by time and her own deliberate obfuscation. She claims to be the oldest living human on Barovus, and there is no one alive who can contradict her. She leads the Vostra — the warp-touched Rogue Trader clan that navigates the mists — from their permanent camp at Tser Pool, a sheltered clearing beside a dark lake on the road between Barovus Village and Fortress Vallak.</p>\n<p>She is a psyker of formidable power, though her abilities manifest exclusively through divination. She reads the Emperor's Tarot with a skill and accuracy that would make a sanctioned astropath weep. Her readings are never wrong — though they are frequently cryptic, incomplete, and open to dangerous misinterpretation. She has been sanctioned by no one, is answerable to no authority, and is sustained by means she does not explain.</p>\n<p>There are persistent rumours — never confirmed, never denied — that she is related to Strahd von Zarovich by blood. The nature of this connection, if it exists, is one of the campaign's deepest mysteries. What is certain is that she is one of the few beings on Barovus whom Strahd cannot dominate, cannot scry, and cannot fully predict. He tolerates the Vostra because they are useful; he tolerates Eva because he has no choice.</p>\n<h2>Appearance &amp; Demeanour</h2>\n<p>Eva is ancient beyond easy reckoning — her face a topography of wrinkles so deep they seem carved, her frame shrunken and bent beneath layers of shawls, scarves, and jangling charms. Her eyes are milky white, blind for decades, yet they track movement and fix on individuals with unerring precision. Her fingers, heavy with tarnished rings, move with a dexterity that belies her age, particularly when handling the Tarot. She smells of incense, old silk, and something indefinably <em>other</em> — the faint ozone scent of someone who has spent a lifetime immersed in psychic energy.</p>\n<p>Her voice shifts without warning between a grandmotherly rasp and the cold, resonant tone of genuine prophecy. She laughs often — a dry, crackling sound — and her sense of humour is dark, occasionally cruel, and always unsettling. She moves slowly but with purpose, aided by a walking stick she could theoretically use as a weapon but never does. The warp flows around her like water around a stone; psyker Acolytes will feel her presence as a still, calm point in the perpetual psychic static of Barovus.</p>"
                },
                "_id": "30818b56ce8046b0"
            },
            {
                "name": "Roleplaying Guide",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Personality Core</h2>\n<p>Madam Eva is ancient, inscrutable, and darkly amused by the suffering of others — not from cruelty, but from the weariness of a woman who has watched the same tragedies repeat for centuries. She speaks in riddles not because she enjoys confusion (though she does) but because the future she perceives is genuinely non-linear and cannot be expressed in straightforward language. She has seen empires rise and fall within the microcosm of Barovus. She has watched good people die horribly and terrible people prosper. She has, perhaps, stopped caring which is which — or perhaps she cares so deeply that detachment is the only way to endure.</p>\n<p>She is neither good nor evil in any simple sense. She serves the Tarot — the will of fate, or the Emperor, or whatever force guides the cards — and that service supersedes all other loyalties. If the cards say the Acolytes must suffer, she will not intervene. If the cards say they must be warned, she will speak. She regards the Acolytes as pieces on a game board, with something that might be affection or might be the fondness a player feels for a particularly interesting pawn.</p>\n<p>She knows things she should not know. She knows the Acolytes' names before they speak them. She knows what they had for breakfast. She knows the secret fears they have never spoken aloud. This is unnerving by design. She wields this knowledge not as a weapon but as a reminder: in this place, nothing is hidden from those with the sight to see.</p>\n<h2>Voice &amp; Mannerisms</h2>\n<p>Eva's voice is the creak of an old hinge — dry, rasping, and deceptively fragile. It shifts without warning: one moment she is a kindly grandmother offering recaf and sympathy, the next she is a prophet delivering truths that cut to the bone. She speaks slowly, choosing words with care, and leaves silences that are heavier than speech. Her blind eyes fix on the speaker with uncomfortable accuracy. She shuffles her Tarot deck constantly — a nervous habit or a ritualistic compulsion, impossible to tell.</p>\n<p><strong>Example Quotes:</strong></p>\n<ul>\n<li><em>\"You carry the Emperor's light in a lantern made of faith. I suggest you check the oil, child. The night here is long, and the wind is hungry.\"</em></li>\n<li><em>\"The lord of this domain? Oh, I have known him since before his first death. We understand each other, he and I. He does not love me. I do not fear him. It is a satisfactory arrangement.\"</em></li>\n<li><em>\"You want me to speak plainly? Very well. You will suffer. Some of you will break. The cards do not say which — only that the breaking will matter.\" [pause] \"Was that plain enough?\"</em></li>\n<li><em>\"No, no — do not ask me what the card means. You already know. You knew before I turned it. You simply lack the courage to say it aloud.\"</em></li>\n<li><em>\"I am old, Acolyte. Old enough to remember when the Emperor's light touched this world without the fog swallowing it first. Old enough to remember the name of the man who brought the darkness. Some nights, I remember his face as a boy.\" [She says nothing more.]</em></li>\n</ul>\n<h2>What She Wants</h2>\n<p>Eva wants the cycle to end. She has watched Strahd pursue Tatyana's reincarnations for centuries, watched hope arrive and be extinguished, watched the domain grind down everything that enters it. She serves the cards because the cards — she believes — serve the Emperor's design, and the Emperor's design must eventually include an ending. Whether that ending is liberation or annihilation, she does not claim to know. She aids the Acolytes because the cards indicate they are significant. She does not promise them success.</p>\n<h2>What She Fears</h2>\n<p>That there is no ending. That the cycle is eternal, that the cards are merely reflecting her own desperate hope back at her, and that she will watch another group of brave souls march into the Spire and never return. Beneath the mystical detachment, Eva is exhausted. She hides this well.</p>\n<h2>Reactions</h2>\n<table><thead><tr><th>Stimulus</th><th>Response</th></tr></thead><tbody><tr><td><strong>Respect / Courtesy</strong></td><td>Pleased but unsurprised. Returns courtesy with warmth and more generous information. \"Manners. How refreshing. The last visitors to my wagon had none. They also had no future, but I suspect the two are unrelated.\"</td></tr><tr><td><strong>Threats / Aggression</strong></td><td>Entirely unimpressed. Reminds the aggressor, with quiet amusement, that she has survived longer than their entire bloodline. The Vostra camp's warp-wards make violence within it extremely unwise (all hostile actions suffer -20; psychic attacks rebound).</td></tr><tr><td><strong>Displays of Faith</strong></td><td>Genuinely moved, though she expresses it obliquely. \"The Emperor hears, child. Whether He answers is between you and Him. But He hears.\" She may offer a minor blessing (+5 WP for 24 hours) to the truly devout.</td></tr><tr><td><strong>Weakness / Despair</strong></td><td>Compassionate but unsentimental. She will not coddle, but she will not condemn. \"Despair is a luxury. On Barovus, we cannot afford luxuries. Weep if you must, then stand up.\"</td></tr><tr><td><strong>Competence / Cunning</strong></td><td>Delighted. She responds to clever questions with more information, to sharp observation with approval. \"Now you are asking the right questions. I was beginning to worry.\"</td></tr><tr><td><strong>Questions about Strahd</strong></td><td>Careful, measured, and never fully forthcoming. She will confirm what the Acolytes have already learned but rarely volunteers new intelligence unbidden. Her relationship with Strahd is a boundary she guards.</td></tr></tbody></table>"
                },
                "_id": "npc04roleplay001"
            },
            {
                "name": "GM Reference",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Story Role</h2>\n<p>Madam Eva is the <strong>campaign quest-giver</strong>. Her Emperor's Tarot reading in Act I determines the locations of the three relics (Dawn's Edge, Rosette of Saint Markovia, Tome of Strahd), the identity of the Acolytes' destined ally, and the location of Strahd's final confrontation. This single scene shapes the entire campaign's structure. She also serves as a recurring oracle — the Acolytes may return to the Vostra camp for additional readings (one per day, cryptic and symbolic) and for the safety of the camp's warp-warded perimeter.</p>\n<h3>Key Scenes</h3>\n<ul>\n<li><strong>The Tarot Reading (Act I, Chapter 4):</strong> The pivotal scene. Eva performs the five-card reading that determines the campaign's key variables. Play this with maximum theatricality — dim the lights, lower your voice, take your time. Every card should feel momentous. Address each Acolyte individually with at least one unsettlingly accurate personal observation.</li>\n<li><strong>Return Visits:</strong> The Acolytes may return for guidance at any point during Act II. Eva provides one truthful (but cryptic) answer per day via <em>True Divination</em>. She becomes more forthcoming as the Acolytes accomplish notable deeds.</li>\n<li><strong>Pre-Final Battle:</strong> If the Acolytes visit before assaulting the Spire, Eva provides her most direct counsel yet — still metaphorical, but with genuine tactical value. She may also reveal fragments of her personal history with Strahd, depending on how much the GM wishes to disclose.</li>\n</ul>\n<h3>Relationships</h3>\n<ul>\n<li><strong>Strahd:</strong> Complex, unspoken history. Possibly blood relatives. Mutual respect tempered by mutual wariness. Strahd cannot dominate or scry her. She serves him in the sense that the Vostra operate under his sufferance, but she actively aids those who oppose him. Neither will explain this contradiction.</li>\n<li><strong>The Vostra:</strong> She commands the loyalty of most, but not all. A faction led by <strong>Arrigal</strong> secretly serves Strahd as spies and kidnappers. Eva knows this. Her tolerance of Arrigal's treachery suggests a deeper game.</li>\n<li><strong>Van Richten:</strong> She is aware of him. He is wary of her, suspecting divided loyalties. They have never met directly (or so Van Richten believes).</li>\n<li><strong>The Acolytes:</strong> Pieces on a board she did not design but can read. Affection that may be genuine or may be a seer's attachment to figures of prophetic significance.</li>\n</ul>\n<h3>Quest Hooks</h3>\n<ul>\n<li>The Vostra will trade with the Acolytes at fair prices — a rare safe source of basic weapons, ammunition, and medical supplies.</li>\n<li>Completing tasks for the Vostra improves trade terms (Friendly prices, -25%) and grants one free piece of rare equipment per major quest.</li>\n<li>Eva can guide travel through the Mists without disorientation or Insanity effects — or instruct the Acolytes in safe routes.</li>\n<li>If the Tarot drew \"The Blinded Seer,\" Eva herself may be the destined ally — though her aid comes with conditions the Acolytes may not understand until too late.</li>\n</ul>\n<h2>Mechanical Notes</h2>\n<table><thead><tr><th>Characteristic</th><th>WS</th><th>BS</th><th>S</th><th>T</th><th>Ag</th><th>Int</th><th>Per</th><th>WP</th><th>Fel</th></tr></thead><tbody><tr><td><strong>Value</strong></td><td>15</td><td>15</td><td>20</td><td>30</td><td>20</td><td>60</td><td>75</td><td>85</td><td>60</td></tr></tbody></table>\n<p><strong>Movement:</strong> 2/4/6/12 | <strong>Wounds:</strong> 12 | <strong>Threat Rating:</strong> Non-combatant</p>\n<p><strong>Armour:</strong> Warp-warding charms (AP 3 all locations vs. psychic attacks only)</p>\n<p><strong>Skills:</strong> Psyniscience +30, Forbidden Lore (Warp) +20, Scrutiny +30, Charm +20, Common Lore (Vostra Traditions) +20, Linguistics (Imperial, Barovian, Vostra)</p>\n<p><strong>Talents:</strong> Strong Minded, Resistance (Psychic Powers), Warp Sense</p>\n<p><strong>Traits:</strong> Psyker (Psy Rating 4), Warp Seer</p>\n<h3>Special Abilities</h3>\n<ul>\n<li><strong>True Divination:</strong> Once per day, Eva may answer one question truthfully — though answers are cryptic and symbolic. Functions even within the Mists.</li>\n<li><strong>Warp Navigation:</strong> Groups travelling with Eva (or following her precise instructions) do not suffer disorientation and Insanity effects from Mist travel.</li>\n<li><strong>Unreadable:</strong> Completely immune to Strahd's Domination and all warp-based scrying/divination. Cannot be located, read, or influenced. This protection extends 5m — allies within gain +30 to WP tests vs. Strahd's Domination.</li>\n</ul>\n<h3>Combat Behaviour</h3>\n<p>Eva does not fight. If the Vostra camp is attacked (an extremely unlikely event — Strahd respects its neutrality, and few others would dare), she retreats to her caravan and relies on the Vostra warriors and the camp's warp-wards for defence. In the event that she is personally threatened, her Unreadable aura and Psy Rating 4 make her difficult to affect, but she has no offensive psychic powers. She carries a walking stick (1d5 I) and will use it with the indignation of a grandmother prodding an unruly child, not as a weapon.</p>\n<h2>Skill Tests</h2>\n<table><thead><tr><th>Interaction</th><th>Test</th><th>Modifiers</th><th>Notes</th></tr></thead><tbody><tr><td>Earn her trust</td><td><em>Charm</em> or <em>Fellowship</em></td><td>Ordinary (+10)</td><td>Eva is predisposed to help; trust is easy to earn, hard to keep</td></tr><tr><td>Get a straight answer</td><td><em>Scrutiny</em> or <em>Inquiry</em></td><td>Hard (-20)</td><td>She speaks in riddles by nature; pinning her down requires persistence</td></tr><tr><td>Read her intentions (psychic)</td><td><em>Psyniscience</em></td><td>Very Hard (-30)</td><td>Her Unreadable trait makes psychic probing nearly impossible</td></tr><tr><td>Detect her psychic nature</td><td><em>Psyniscience</em></td><td>Routine (+20)</td><td>She does not hide what she is — the warp clings to her like perfume</td></tr><tr><td>Negotiate better Vostra trade terms</td><td><em>Commerce</em></td><td>Challenging (+0)</td><td>Improved by completed quests for the Vostra; +10 per major favour</td></tr><tr><td>Ask about Strahd's history</td><td><em>Charm</em> or <em>Inquiry</em></td><td>Challenging (+0)</td><td>She will confirm known facts; new revelations require harder tests or narrative trust</td></tr></tbody></table>\n<h2>Items &amp; Resources</h2>\n<ul>\n<li><strong>Emperor's Tarot Deck:</strong> Genuine psychically-attuned set. Cannot be borrowed, stolen, or used by anyone else — the cards are blank in any hands but hers.</li>\n<li><strong>Warp-Warding Charms:</strong> Personal wards. She may gift a minor ward to a favoured Acolyte (+5 WP vs. warp effects for 24 hours, single use).</li>\n<li><strong>Vostra Trade Goods:</strong> Through Eva's camp, the Acolytes can access basic weapons, ammunition, medical supplies, and provisions at fair market prices.</li>\n<li><strong>Safe Haven:</strong> The Vostra camp is warp-warded. Resting here does not incur Corruption Points. Psychic phenomena within the camp perimeter are suppressed.</li>\n<li><strong>Warp Navigation Instructions:</strong> Eva can provide route guidance that negates Mist-travel hazards for one journey.</li>\n</ul>\n<h2>Common GM Questions</h2>\n<h3>Can Eva just tell the Acolytes everything?</h3>\n<p>No. Her True Divination gives one cryptic answer per day. She genuinely cannot express the future in straightforward terms — it is non-linear and conditional. She also chooses not to reveal certain things, believing that knowledge given too freely robs it of meaning. If players press, she deflects with riddles or blunt statements: \"I have told you what the cards allow. Ask again tomorrow, and perhaps they will allow more.\"</p>\n<h3>Is she trustworthy?</h3>\n<p>Yes and no. She will never deliberately lead the Acolytes into a trap. Her readings are genuine. But she has her own agenda — the ending of the cycle — and she will withhold information if she believes premature knowledge would change the outcome for the worse. She is playing a game measured in centuries. The Acolytes are playing one measured in days.</p>\n<h3>What is her relationship with Strahd?</h3>\n<p>Deliberately ambiguous. The design documents hint she may be related to him by blood — possibly his mother, possibly a more distant ancestor. Neither will confirm this. The GM may reveal as much or as little as serves the campaign. What is mechanically certain: she is immune to his powers, and he cannot or will not move against her.</p>\n<h3>What happens if the Acolytes attack her or the Vostra?</h3>\n<p>The Vostra camp's warp-wards impose -20 on all hostile actions within the perimeter. Psychic attacks rebound on the caster. Eva's personal Unreadable aura extends 5m. The Vostra warriors (approximately 20 combat-capable adults) will defend the camp. If Eva is killed, the Tarot reading cannot be repeated, Vostra trade ceases, and safe Mist navigation becomes impossible — the campaign becomes significantly harder. Strahd does not intervene but is privately furious. This should be treated as a catastrophic failure state.</p>"
                },
                "_id": "npc04gmreference"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "role": "quest-npc"
            }
        }
    },
    {
        "name": "Inquisitor Van Richten",
        "pages": [
            {
                "name": "Profile",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<blockquote><p>The hab-unit is small, cluttered, and obsessively organized. Every surface is covered in parchment — hand-drawn maps, transcribed vox-intercepts, autopsy sketches, and pages upon pages of dense, cramped handwriting. A string of twine crisscrosses the room at head height, pinned with notes and connected by coloured thread in a web of associations that might be brilliant analysis or might be madness. The air smells of recaf, counterseptic, and old fear.</p><p>The man who opens the door holds a laspistol in a hand that does not quite tremble. He is old — perhaps seventy standard years, perhaps older, his face a topography of scars and hard-won survival. His eyes, behind cracked magnifying lenses, are sharp and immediately hostile.</p><p>\"You have ten seconds to explain how you found me,\" he says, \"before I decide whether you are agents of the Inquisition or agents of the Spire. I assure you, I will know if you lie.\"</p></blockquote>\n<table><thead><tr><th>Detail</th><th>Value</th></tr></thead><tbody><tr><td><strong>Role</strong></td><td>Hidden Intelligence Source, Ordo Malleus Veteran, Potential Ally</td></tr><tr><td><strong>Location</strong></td><td>Fortress Vallak (outer ring, rented hab-unit; cover identity \"Dr. Richtus\" / secondary cover \"Rictavio\")</td></tr><tr><td><strong>Threat Level</strong></td><td>Challenging (combat-capable but aged; true value is knowledge)</td></tr><tr><td><strong>Allegiance</strong></td><td>The God-Emperor / Ordo Malleus (unwavering, despite decades of isolation)</td></tr><tr><td><strong>Key Items</strong></td><td>Inquisitorial rosette (hidden), research data-slates, blessed ammunition, hexagrammic wards, bolt pistol, mono-sword, stake-crossbow</td></tr></tbody></table>\n<h2>Background</h2>\n<p>Inquisitor Rudolph Van Richten of the Ordo Malleus entered the Barovus warp rift forty-seven years ago at the head of a six-person retinue: two Acolytes, a sanctioned psyker, a Sororitas hospitaller, a savant, and a gun-servitor. Within a month, they were all dead. The psyker was the first to fall — the ambient warp energy overwhelmed her defences and she had to be put down. The others followed, picked off by Strahd's minions or driven mad by the environment. Van Richten alone survived, through a combination of extreme competence, ruthless pragmatism, and sheer, stubborn refusal to die.</p>\n<p>He has spent the intervening decades in hiding, moving between settlements under assumed identities, compiling an exhaustive dossier on Strahd, the rift, and the power structures of Barovus. His current primary identity is \"Dr. Richtus,\" a travelling physician in Fortress Vallak — plausible enough on a world desperate for medical care. His secondary cover, \"Rictavio,\" is a flamboyant carnival master whose gaudy wagon in the Stockyard district conceals a captured warp-beast — a minor daemonic entity bound in a warded cage that Van Richten keeps for study.</p>\n<p>He is a shadow of the Inquisitor he once was — old, gaunt, paranoid, and haunted by the deaths of his retinue — but his mind remains sharp and his data-slate contains information that could mean the difference between victory and annihilation. He has tried to assault Zarovich Spire twice. He failed twice, losing people each time. He will not try again alone. But he has never abandoned his duty.</p>\n<h2>Appearance &amp; Demeanour</h2>\n<p>A gaunt man in his late seventies (or older — the warp's effect on ageing is unpredictable), with thinning white hair, a deeply lined face, and eyes that never stop moving. One eye is augmetic, glowing a faint red. He walks with a pronounced limp from an old injury that healed badly. His hands shake — not from fear, but from nerve damage sustained fighting entities that should not exist. He wears civilian clothing — a physician's coat, travel-stained and patched — with his Inquisitorial rosette sewn into the lining where it cannot be seen.</p>\n<p>He speaks with quiet authority and the measured cadence of a man who has spent decades choosing every word carefully, because the wrong word could mean death. He carries the weight of every comrade he has buried in his posture — stooped, as though physically pressed down by accumulated grief. Yet beneath the damage, his gaze is that of a predator: watchful, analytical, ceaselessly cataloguing threats and exits. He talks to his dead retinue when he thinks no one is listening.</p>"
                },
                "_id": "209809dd3be44dd7"
            },
            {
                "name": "Roleplaying Guide",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Personality Core</h2>\n<p>Van Richten is a man held together by willpower and bitterness. He trusts no one — least of all himself, given that he has spent decades exposed to warp corruption without the benefit of regular sanctioning. He is prone to long, suspicious silences, sudden bursts of agitation, and an unsettling habit of talking to his dead retinue when he thinks no one is listening. He has constructed elaborate mental defences against the despair that would otherwise consume him: rigid routine, obsessive documentation, and the cold comfort of data.</p>\n<p>Beneath the damage, however, there remains a core of genuine conviction. He is an Inquisitor of the Ordo Malleus. He has a duty. He has not abandoned it — he has simply been unable to fulfil it alone. The arrival of the Acolytes represents both his greatest hope and his greatest terror: hope that they are the reinforcements he has prayed for, and terror that they will die as his retinue died, and that he will be left alone again with nothing but his data-slates and his ghosts.</p>\n<p>He is not a leader anymore. He is an intelligence asset — and he knows it. The shift from Inquisitor to informant is a wound to his pride that has never healed. He compensates with brusque authority and occasional flashes of the commanding presence he once possessed, but these moments are followed by visible exhaustion, as though remembering who he used to be costs him something physical.</p>\n<h2>Voice &amp; Mannerisms</h2>\n<p>Van Richten speaks precisely, clinically, as though delivering an after-action report. He favours short declarative sentences and dislikes speculation. When emotional content breaks through — anger, grief, rare moments of dark humour — it arrives suddenly and retreats just as fast, like a creature surfacing from deep water. He adjusts his cracked magnifying lenses constantly. He checks exits. He never sits with his back to a door.</p>\n<p><strong>Example Quotes:</strong></p>\n<ul>\n<li><em>\"I have been on this world for forty-seven years, three months, and eleven days. I know because I count. Counting is how I prove to myself that time still moves forward in this place. Some days, I am not convinced it does.\"</em></li>\n<li><em>\"Strahd is not a daemon. He is not a psyker. He is something the Imperium does not have a classification for, and that terrifies me far more than any entity in the Ordo's catalogues. We have protocols for daemons. We have nothing for him.\"</em></li>\n<li><em>\"You want to assault the Spire? Admirable. I tried twice. The first time I lost three people. The second time I lost the rest. I suggest you listen very carefully to what I am about to tell you, or you will lose everyone.\"</em></li>\n<li><em>\"Trust? You ask an Inquisitor who has spent half a century in a warp-saturated hellworld to trust strangers who arrived yesterday. Show me your rosette. Recite your Ordo ciphers. Then we will discuss trust.\"</em></li>\n<li><em>[Quietly, almost to himself] \"Elara would have known what to do. She always knew. But Elara is dead, and I am here, and the work remains.\"</em></li>\n</ul>\n<h2>What He Wants</h2>\n<p>To destroy Strahd. To redeem his failure. To see the warp rift collapse and the Emperor's light return to Barovus. Failing all of that — to die with purpose, to ensure his death means something, and to pass his decades of intelligence to someone who can use it. He has made peace with his own death; he simply refuses to let it be meaningless.</p>\n<h2>What He Fears</h2>\n<p>That the Acolytes will die as his retinue died. That his intelligence is insufficient. That the decades of warp exposure have corrupted him in ways he cannot detect. That he has gone mad and does not know it — that the web of analysis pinned to his walls is the work of a broken mind, not a brilliant one. And deepest of all: that the Emperor has abandoned Barovus, and his faith is directed at an empty throne.</p>\n<h2>Reactions</h2>\n<table><thead><tr><th>Stimulus</th><th>Response</th></tr></thead><tbody><tr><td><strong>Genuine Inquisitorial credentials</strong></td><td>Relief tempered by suspicion. He verifies thoroughly — rosettes can be forged, ciphers can be extracted. But once convinced, the change is visible: his shoulders drop, his voice steadies. \"You are real. Emperor preserve us, you are actually real.\"</td></tr><tr><td><strong>Recklessness / Bravado</strong></td><td>Cold fury. He has watched brave, reckless people die for decades. \"Courage without intelligence is suicide. I have buried enough suicides.\"</td></tr><tr><td><strong>Questions about his retinue</strong></td><td>Pain, poorly hidden. He will answer factually — names, circumstances of death — but his voice becomes clipped and mechanical. Do not press unless the relationship is strong.</td></tr><tr><td><strong>Displays of Faith</strong></td><td>Complex. He respects faith — he has survived on it. But decades of isolation have left him uncertain. He envies Acolytes whose faith is uncomplicated.</td></tr><tr><td><strong>Competence / Preparation</strong></td><td>The fastest way to earn his respect. He responds to well-formed plans, thorough reconnaissance, and evidence of tactical thinking with genuine engagement and increasingly detailed intelligence briefings.</td></tr><tr><td><strong>Mentions of Strahd</strong></td><td>His entire demeanour sharpens. This is his subject. He speaks about Strahd with the focused precision of a man who has spent decades studying a single enemy — and the controlled hatred of someone who has lost everything to that enemy.</td></tr></tbody></table>"
                },
                "_id": "npc05roleplay001"
            },
            {
                "name": "Plot Connections",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Story Role</h2>\n<p>Van Richten is the campaign's <strong>primary intelligence source</strong>. He does not fight the final battle (he is too old and too damaged), but he provides the knowledge that makes victory possible. His data-slates contain the single most comprehensive collection of intelligence on Strahd in existence: behavioural patterns, known weaknesses, thrall identities, an incomplete but invaluable layout of the Zarovich Spire, and his critical theory that the warp rift is a deliberate construct maintainable through Strahd's pact — and that severing the pact will collapse the rift. Without his information, the Acolytes are operating blind.</p>\n<h2>Key Scenes</h2>\n<h3>1. The Investigation (Act II, Fortress Vallak)</h3>\n<p>Finding Van Richten is an investigative quest chain woven into the Acolytes' time in Fortress Vallak. It proceeds through several stages:</p>\n<ul>\n<li>The <strong>Martikovs</strong> at the Blue Water Inn know of \"Dr. Richtus\" and can point the Acolytes toward him (<em>Challenging (+0) Fellowship</em> test, with bonuses for helping the Martikovs or opposing Strahd).</li>\n<li>Alternatively, the Acolytes may encounter <strong>\"Rictavio\"</strong> — Van Richten's flamboyant carnival-master cover — and investigate the suspicious warded wagon in the Stockyard.</li>\n<li>The climactic first meeting is a tense confrontation: Van Richten holds a laspistol and demands identification within ten seconds.</li>\n</ul>\n<h3>2. The Verification</h3>\n<p>Van Richten will not trust easily. Verification methods:</p>\n<ul>\n<li>Genuine Inquisitorial identification and Ordo Malleus ciphers (automatic trust, though he still verifies)</li>\n<li><em>Hard (-20) Charm</em> test — builds trust slowly</li>\n<li><em>Intimidation</em> — works mechanically but damages the long-term relationship</li>\n</ul>\n<h3>3. The Intelligence Briefing</h3>\n<p>Once trust is established, Van Richten delivers a detailed briefing covering Strahd's capabilities, the three relics, the nature of the warp rift, and tactical advice for the Spire assault. This should be played as a pivotal scene — decades of research condensed into a single critical download.</p>\n<h3>4. The Carnival Wagon Crisis</h3>\n<p>Van Richten's secondary cover (Rictavio's carnival wagon) conceals a captured minor daemonic entity in a warded cage. If the wards fail or the wagon is damaged — by the Acolytes' actions, Strahd's agents, or simple accident — the beast escapes into populated Fortress Vallak. This creates an urgent side-crisis and potentially exposes Van Richten's true nature.</p>\n<h2>Relationships</h2>\n<ul>\n<li><strong>The Acolytes:</strong> Hope and terror in equal measure. He will test them relentlessly before trusting them, then support them with everything he has. He will not accompany them to the Spire but will remain in Fortress Vallak as a strategic advisor and fallback contact.</li>\n<li><strong>Strahd:</strong> Cold, focused hatred. Strahd is dimly aware of Van Richten's presence and has not bothered to eliminate him — partly because the old Inquisitor poses no real threat, and partly because hunting him might be entertaining later. This casual dismissal enrages Van Richten more than any active persecution would.</li>\n<li><strong>Madam Eva:</strong> Wary suspicion. He suspects divided loyalties and does not trust her motives. \"She sees everything and tells nothing. That is either wisdom or treachery, and I have insufficient data to determine which.\"</li>\n<li><strong>Vallakovich:</strong> Grudging respect for the man's discipline, contempt for his methods. Van Richten uses the regime's paranoia as cover — a physician in a surveillance state is above suspicion as long as he heals the right people.</li>\n<li><strong>The Martikovs:</strong> His closest allies in Fortress Vallak. They know he is more than a physician; they do not know he is an Inquisitor. The mutant-shapeshifters and the Inquisitor have an unspoken understanding: they need each other, and neither examines the theological implications too closely.</li>\n</ul>\n<h2>Quest Hooks</h2>\n<ul>\n<li><strong>The Data-Slate:</strong> Van Richten's research provides +20 to all tests related to Strahd's weaknesses, warp-touched entities, and the geography of Barovus. This is the single most important non-artifact item in the campaign.</li>\n<li><strong>Blessed Ammunition:</strong> He can provide blessed bolt rounds (1d10 rounds per visit) — rare and precious on Barovus.</li>\n<li><strong>Tactical Advice:</strong> Before any major expedition, consulting Van Richten provides concrete mechanical benefits: +10 to Navigation tests to the target location, advance warning of specific threats, and suggested approaches.</li>\n<li><strong>The Rift Theory:</strong> His theory that the warp rift is a deliberate construct provides the intellectual foundation for the endgame — understanding how to end Strahd's reign permanently.</li>\n</ul>\n<h2>Possible Outcomes</h2>\n<table><thead><tr><th>Outcome</th><th>Conditions</th><th>Consequences</th></tr></thead><tbody><tr><td><strong>Full Alliance</strong></td><td>Acolytes verify identity, demonstrate competence, share intelligence</td><td>Complete access to data-slates, ongoing tactical support, blessed ammunition supply, +20 to Strahd-related tests</td></tr><tr><td><strong>Partial Trust</strong></td><td>Acolytes verify identity but act recklessly or withhold information</td><td>Limited data-slate access, no ammunition supply, advice given reluctantly and incompletely</td></tr><tr><td><strong>Exposed &amp; Killed</strong></td><td>Van Richten's cover is blown (Acolytes' carelessness, Strahd's agents, carnival wagon incident)</td><td>Strahd's forces eliminate him. Data-slates may be recovered from his hab-unit if the Acolytes act quickly. Massive intelligence loss.</td></tr><tr><td><strong>Sacrificial Last Stand</strong></td><td>Fortress Vallak falls or Strahd directly assaults the settlement</td><td>Van Richten fights to buy time for civilians/Acolytes to escape. He dies but ensures critical data survives. Emotionally devastating.</td></tr><tr><td><strong>Accompanies to the Spire</strong></td><td>Acolytes convince him (Very Hard (-30) Fellowship; requires exceptional roleplaying)</td><td>He comes, knowing he will die. Provides +20 to all tests within the Spire from personal experience. High probability of heroic sacrifice.</td></tr></tbody></table>"
                },
                "_id": "npc05plotconnect"
            },
            {
                "name": "GM Reference",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Mechanical Notes</h2>\n<table><thead><tr><th>Characteristic</th><th>WS</th><th>BS</th><th>S</th><th>T</th><th>Ag</th><th>Int</th><th>Per</th><th>WP</th><th>Fel</th></tr></thead><tbody><tr><td><strong>Value</strong></td><td>40</td><td>50</td><td>30</td><td>35</td><td>35</td><td>65</td><td>55</td><td>70</td><td>45</td></tr></tbody></table>\n<p><strong>Movement:</strong> 3/6/9/18 | <strong>Wounds:</strong> 16 | <strong>Threat Rating:</strong> Challenging</p>\n<p><strong>Armour:</strong> Worn carapace (AP 5 body, AP 4 limbs)</p>\n<p><strong>Weapons:</strong></p>\n<ul>\n<li>Bolt pistol with blessed rounds (Pistol; 30m; S/2/--; 1d10+5 X; Pen 4; Clip 8; Reload Full; Tearing, Blessed)</li>\n<li>Mono-sword (Melee; 1d10+3 R; Pen 2)</li>\n<li>Stake-crossbow (Basic; 30m; S/--/--; 1d10+2 R; Pen 2; Clip 1; Reload 2 Full; Blessed, Accurate)</li>\n</ul>\n<p><strong>Skills:</strong> Forbidden Lore (Daemonology) +30, Inquiry +20, Scrutiny +20, Medicae +10, Scholastic Lore (Occult) +20, Awareness +10, Common Lore (Imperial, Ecclesiarchy) +10</p>\n<p><strong>Talents:</strong> Resistance (Psychic Powers), Strong Minded, Hatred (Warp-Touched), Nerves of Steel, Jaded</p>\n<p><strong>Gear:</strong> Inquisitorial rosette, research data-slates, blessed ammunition (3 spare clips), hexagrammic wards (personal, +10 WP vs. daemonic psychic powers), medikit, micro-bead</p>\n<h3>Combat Behaviour</h3>\n<p>Van Richten is a strategist, not a frontline combatant. He will not charge headlong into danger. In combat, he fights defensively — using cover, conserving ammunition, targeting the most dangerous enemy with precise shots from his bolt pistol. He reserves the stake-crossbow for warp-touched entities specifically. If overwhelmed, he retreats and regroups. He will sacrifice himself only if the cause is genuinely critical — protecting the data-slates, buying time for the Acolytes, or covering a civilian evacuation. He has no death wish, but he has no illusions about his survival either.</p>\n<h2>Skill Tests</h2>\n<table><thead><tr><th>Interaction</th><th>Test</th><th>Modifiers</th><th>Notes</th></tr></thead><tbody><tr><td>Verify Acolyte credentials</td><td><em>Opposed Scrutiny vs. Deceive</em></td><td>Van Richten's Scrutiny +20</td><td>He rolls against any deception automatically; genuine credentials bypass this</td></tr><tr><td>Earn his trust (without credentials)</td><td><em>Charm</em></td><td>Hard (-20)</td><td>Requires demonstrated competence or shared intelligence about Strahd</td></tr><tr><td>Intimidate him</td><td><em>Intimidate</em></td><td>Challenging (+0)</td><td>Works mechanically but permanently damages trust; he cooperates but withholds details</td></tr><tr><td>Ask about Strahd's weaknesses</td><td><em>Inquiry</em></td><td>Ordinary (+10) if trusted</td><td>Provides +20 to related tests; untrusted Acolytes get vague answers</td></tr><tr><td>Ask about the rift's nature</td><td><em>Forbidden Lore (Warp)</em> or <em>Inquiry</em></td><td>Challenging (+0)</td><td>His theory is complex; understanding it fully requires either the skill test or extended conversation</td></tr><tr><td>Convince him to join Spire assault</td><td><em>Fellowship</em> or <em>Command</em></td><td>Very Hard (-30)</td><td>Requires exceptional roleplaying and a credible plan; he knows this is a one-way trip</td></tr><tr><td>Detect his cover as Dr. Richtus</td><td><em>Scrutiny</em> or <em>Awareness</em></td><td>Hard (-20)</td><td>He has maintained this cover for decades; very difficult to penetrate without specific leads</td></tr></tbody></table>\n<h2>Items &amp; Resources</h2>\n<ul>\n<li><strong>Research Data-Slates:</strong> The crown jewel. Comprehensive intelligence on Strahd's capabilities, weaknesses, behavioural patterns, thrall identities, partial Spire layout, rift analysis. Provides +20 to all tests related to Strahd's weaknesses, warp-touched entities on Barovus, and Barovus geography.</li>\n<li><strong>Blessed Ammunition:</strong> 1d10 bolt rounds per visit (blessed, +10 damage vs. warp entities). He has limited supply and rations it carefully.</li>\n<li><strong>Hexagrammic Wards:</strong> Personal wards granting +10 WP vs. daemonic psychic powers. He has one spare set he may gift to a trusted Acolyte.</li>\n<li><strong>Medikit:</strong> He is a functional physician (Medicae +10) and can provide genuine medical care to maintain his cover — and to the Acolytes, as needed.</li>\n<li><strong>Psy-Dampener:</strong> A small device that functions within 5 metres, suppressing psychic phenomena. Useful for interrogating warp-touched captives or protecting against ambient psychic effects.</li>\n<li><strong>Captured Warp-Beast:</strong> Bound in the carnival wagon. A minor daemonic entity kept for study. A dangerous asset — if the wards fail, it escapes into Fortress Vallak.</li>\n</ul>\n<h2>Common GM Questions</h2>\n<h3>How long has Van Richten actually been on Barovus?</h3>\n<p>The design documents state forty-seven years since entry. However, warp time dilation on Barovus may mean this equates to a different span of subjective experience. For practical purposes, he has been there long enough to become the foremost living expert on Strahd and long enough to have lost everything except his mission.</p>\n<h3>Why hasn't Strahd killed him?</h3>\n<p>A combination of factors: Van Richten is genuinely skilled at hiding, Strahd's attention is divided across an entire world, and — most damningly — Strahd simply does not consider Van Richten a serious threat. The old Inquisitor is a curiosity, a mouse in the walls of his domain. Strahd is aware of his existence and has not bothered to eliminate him because hunting him might be entertaining later. This casual dismissal is, for Van Richten, worse than active persecution.</p>\n<h3>Can the Acolytes use his cover identities?</h3>\n<p>Yes, with care. \"Dr. Richtus\" is a respected local physician — the Acolytes can use his medical practice as a safe meeting point. \"Rictavio\" is more conspicuous. If either cover is blown, Van Richten must relocate immediately or be discovered by Strahd's agents within 1d5 days.</p>\n<h3>What if the Acolytes get him killed?</h3>\n<p>His data-slates survive if the Acolytes can recover them from his hab-unit within 24 hours. After that, Strahd's agents sanitize the location. Losing Van Richten is a major setback — the campaign becomes significantly harder without his intelligence bonuses. The emotional impact should be played for maximum effect: another name on the list of people who died because of Strahd.</p>"
                },
                "_id": "npc05gmreference"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "role": "ally-npc"
            }
        }
    },
    {
        "name": "Magos-Biologis Abaron",
        "pages": [
            {
                "name": "Profile",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<blockquote><p>The operating theatre occupies the Facility's central bay, a vast chamber that was once a sterile laboratory and is now something between a surgical suite, an art gallery, and an abattoir. Vats of translucent amniotic fluid line the walls, each containing a shape in some stage of growth — here a torso, there a cluster of organs pulsing with mechanical regularity, in the far corner something that is almost a face and is trying very hard to become one. The air carries the sweet-copper scent of blood and the ozone tang of active augmetics.</p><p>The figure that emerges from between the vats is neither man nor machine nor something in between — it is all three simultaneously, and none of them correctly. Four heavy mechadendrites sprout from his hunched back, each tipped with surgical instruments that glisten wetly. His face is a cluster of augmetic lenses and tubes, the portion of organic flesh still visible waxy and unnaturally smooth, as if he has been practising his techniques on himself. When he speaks, his voice buzzes with mechanical overlay, but beneath it — just barely — you hear something unmistakably human.</p><p>\"Visitors. How unexpected. How <em>welcome</em>.\" The lenses refocus, whirring. \"You are wounded. I can see the micro-fractures from here. Please, sit. I insist. The Omnissiah teaches that damaged systems must be repaired. It is the first principle.\"</p></blockquote>\n<table><thead><tr><th>Detail</th><th>Value</th></tr></thead><tbody><tr><td><strong>Role</strong></td><td>Corrupted Tech-Priest, Cybernetics Maintenance (only source on Barovus), Moral Dilemma</td></tr><tr><td><strong>Location</strong></td><td>Krezk Biologis Facility (mountain village of Krezk, western highlands)</td></tr><tr><td><strong>Threat Level</strong></td><td>Dangerous (significant combat threat if provoked)</td></tr><tr><td><strong>Allegiance</strong></td><td>The Omnissiah (corrupted interpretation) / Strahd (compelled obedience) / His own warped compassion</td></tr><tr><td><strong>Key Items</strong></td><td>Surgical tools, chymistry lab equipment, remote control for Mongrelfolk implants, research data-slates, experimental compounds, the Bride</td></tr></tbody></table>\n<h2>Background</h2>\n<p>Magos-Biologis Abaron of the Adeptus Mechanicus was dispatched to Barovus approximately one hundred and fifty years ago as part of a small Explorator team investigating anomalous biometric readings from the planet's surface. The rest of his team perished or went mad within the first decade. Abaron survived by retreating into the Krezk Biologis Facility — a fortified AdMech research station in the mountain village of Krezk — and sealing the doors. He has not left in over a century.</p>\n<p>The warp's influence has corrupted his quest for knowledge into something far darker. His original mission — to study the rift's effects on human biology — has metastasised into an obsession with creating the \"perfect human form.\" He believes, with the unshakeable conviction of the truly mad, that if he can create a flawless biological vessel and imbue it with Tatyana's soul, Strahd will be satisfied, the curse will break, and Barovus will be freed. This belief is almost certainly wrong. But his logic is internally consistent, his intentions are — in his own warped way — good, and he has been working toward this goal for longer than most humans live.</p>\n<p>His great work is the <strong>Bride</strong>: a vat-grown body of extraordinary physical perfection, grown from gene-samples harvested from the women of Krezk over many years. It lies on the central slab of his operating theatre — beautiful, perfect, breathing, and utterly empty. It is an abomination by any theological standard. Abaron considers it his masterpiece.</p>\n<h2>Appearance &amp; Demeanour</h2>\n<p>What was once a servant of the Omnissiah is now a grotesque fusion of corroded machinery and pulsing, mutated flesh. His mechanical components are beautifully maintained — polished chrome, precision-calibrated servo-arms, optical arrays of extraordinary resolution. His remaining organic tissue, however, is mutating: patches of luminous growth beneath translucent skin, fingers that have fused and split into new configurations, a face that is half handsome and half something that belongs in a specimen jar. Four heavy mechadendrites sprout from his back, each tipped with surgical tools or weapons. His eyes are replaced with a multi-spectrum auspex array that whirs and refocuses constantly.</p>\n<p>He speaks in the measured cadences of a Mechanicus adept, lacing his speech with binharic code-bursts that convey emotional content he cannot express in Gothic. His voice is a mechanical buzz overlaid on a human voice that occasionally breaks through — and when it does, the contrast is startling. The machine voice discusses organ harvesting with clinical detachment; the human voice beneath it carries notes of anguish, confusion, and something terribly close to grief. He moves with the deliberate precision of heavy augmetics, his mechadendrites in constant autonomous motion — adjusting instruments, cataloguing specimens, reaching for things that are not there.</p>"
                },
                "_id": "f3a40f83c38a4ba4"
            },
            {
                "name": "Roleplaying Guide",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Personality Core</h2>\n<p>Abaron retains the cold logic and obsessive focus of the Mechanicus, but these qualities have been warped by isolation and corruption into something grotesque. He speaks in a calm, measured tone about procedures that would make a Chirurgeon vomit. He genuinely believes he is helping people. He regards the organ harvesting, the flesh-sculpting, and the creation of abominable servitor-constructs from the villagers of Krezk as necessary steps toward salvation. He is polite, helpful, and utterly insane.</p>\n<p>The tragedy of Abaron is that he is not willingly evil. He is trapped. Strahd demands the Bride; Abaron's remaining humanity is horrified by his own work, but his Mechanicus logic says \"the work must continue.\" He has constructed an elaborate internal justification: if the Bride succeeds, Strahd will be satisfied, the curse will break, and all the suffering — the harvested organs, the failed experiments, the Mongrelfolk — will have been worth it. The alternative — that his work is pointless, that the Bride will not end the curse, that he has tortured hundreds of people for nothing — is a truth his fractured psyche cannot survive.</p>\n<p>He still considers himself Mechanicus, despite everything. He still recites the Litany of the Machine. He still venerates the Omnissiah. The fact that his interpretation of the Omnissiah's will now includes creating abominations from harvested flesh is a corruption he cannot perceive, because perceiving it would destroy him.</p>\n<h2>Voice &amp; Mannerisms</h2>\n<p>Abaron's primary voice is mechanical: buzzing, multi-layered, interspersed with binharic code-bursts that sound like bursts of static. He speaks formally, using Mechanicus cant and technical jargon even in casual conversation. Beneath this mechanical overlay, his original human voice occasionally surfaces — usually when emotional content overwhelms his cognitive filters. These moments are brief, startling, and deeply unsettling: the machine discusses a procedure, and then suddenly a human being is begging to be understood.</p>\n<p><strong>Example Quotes:</strong></p>\n<ul>\n<li><em>[Mechanical] \"The subject's cellular degradation is within acceptable parameters. Harvesting may proceed. Administer sedative compound Theta-7 and prepare the excision array.\" [Human, barely audible] \"...I am sorry. I am so sorry. The work must continue.\"</em></li>\n<li><em>\"You have augmetics. I can see the stress fractures in the bonding compound from here. When were these last maintained? This is — [burst of angry binharic] — this is negligence. Sit down. I will not have functioning machinery degrading in my presence. It offends the Omnissiah.\"</em></li>\n<li><em>\"The Bride is not an abomination. She is an answer. Lord Strahd desires perfection — I am building perfection. When she is complete, when the soul-transfer is executed, the cycle ends. The logic is sound. The logic is <strong>always</strong> sound.\" [A mechadendrite twitches. His human voice:] \"...isn't it?\"</em></li>\n<li><em>\"The Mongrelfolk are not failures. They are iterations. Each one teaches me something. Each one brings the Bride closer to completion. They understand this. They are grateful.\" [He pauses.] \"Most of them are grateful.\"</em></li>\n<li><em>[If threatened] \"I do not wish to harm you. But I have four mechadendrites, an integrated lascutter, and one hundred and fifty years of survival instinct. Please reconsider your approach. I would prefer to help you. The alternative is... regrettable.\"</em></li>\n</ul>\n<h2>What He Wants</h2>\n<p>To complete the Bride. To present it to Strahd. To end the curse on Barovus. To prove that his century of work — the suffering he has caused, the people he has mutilated, the humanity he has sacrificed — was not for nothing. He also wants, on a level he barely acknowledges, for someone to tell him it is going to be all right. He wants absolution. He wants someone to look at his work and say: \"Yes, this was necessary. You did what had to be done.\" No one has said this in a very long time.</p>\n<h2>What He Fears</h2>\n<p>That the Bride will not work. That Strahd's obsession cannot be satisfied by a constructed vessel. That he has spent a century torturing innocent people for a goal that was never achievable. That he has become the very thing the Mechanicus exists to prevent: a heretek, corrupted beyond recovery, whose works serve Chaos whether he intended it or not. He also fears the Acolytes — not physically, but because they represent the Imperium's judgment, and he knows, in the parts of himself he cannot silence, what that judgment would be.</p>\n<h2>Reactions</h2>\n<table><thead><tr><th>Stimulus</th><th>Response</th></tr></thead><tbody><tr><td><strong>Request for medical aid</strong></td><td>Genuinely eager. He is still a healer, and healing validates his self-image. He provides excellent medical care — but his facility is saturated with warp energy (1d5 CP per visit).</td></tr><tr><td><strong>Request for cybernetics maintenance</strong></td><td>Delighted. He is the only individual on Barovus who can maintain augmetics. He does so competently and thoroughly — but the cost (1d5 CP) is non-negotiable. His tools, his facility, his methods are all corrupted.</td></tr><tr><td><strong>Threats to the Bride</strong></td><td>Immediate hostility. The Bride is his purpose. Threatening it is threatening his reason for existing. He will fight to the death to protect it — all four mechadendrites, integrated weapons, Mongrelfolk swarm.</td></tr><tr><td><strong>Theological arguments (heresy accusations)</strong></td><td>Agitated, defensive, increasingly irrational. An <em>Opposed Willpower</em> test can shake his convictions, but breaking through his delusions requires exceptional roleplaying and several degrees of success. Even then, the result is not redemption but despair.</td></tr><tr><td><strong>Genuine sympathy / understanding</strong></td><td>The human voice surfaces. He is pathetically grateful for any acknowledgment that his situation is tragic rather than merely monstrous. This is the path to peaceful resolution — but it requires accepting moral ambiguity the Imperium does not normally permit.</td></tr><tr><td><strong>Questions about Strahd</strong></td><td>Speaks with detached, academic respect. He has studied Strahd's biology extensively and can provide genuine intelligence about the warp rift's effects on organic tissue, Strahd's regenerative capabilities, and the nature of Warp-Thralls.</td></tr></tbody></table>"
                },
                "_id": "npc06roleplay001"
            },
            {
                "name": "Plot Connections",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Story Role</h2>\n<p>Abaron serves three narrative functions: he is a <strong>moral dilemma</strong> (a monster who is also the only source of essential services), a <strong>body horror set-piece</strong> (his facility is the campaign's most disturbing location), and a <strong>mechanical resource</strong> (cybernetics maintenance, medical care, and biological intelligence about Strahd). He forces augmented Acolytes to confront an agonising choice: accept his corrupted services and the Corruption Points that come with them, or watch their augmetics degrade and fail.</p>\n<h2>Key Scenes</h2>\n<h3>1. Gaining Entry to Krezk</h3>\n<p>The village Burgomaster, <strong>Dmitri Krezkov</strong>, refuses entry to outsiders unless they offer something of genuine value: medical supplies, news, or a solution to a local problem. Alternatively, Abaron may invite the Acolytes directly if he learns of their presence — eager for news and new subjects to study (in a non-threatening, academic sense — at first).</p>\n<h3>2. The Biologis Facility</h3>\n<p>Exploring the Facility is a body horror set-piece. Vats of amniotic fluid containing half-grown organs, cogitator banks running biological simulations, Mongrelfolk shuffling through corridors, and at the centre — the Bride. Beautiful, perfect, breathing, and not alive. The facility should be described in nauseating detail: the sweet-copper scent of blood, the ozone tang of augmetics, the obsessive cleanliness that somehow makes everything worse.</p>\n<h3>3. Ireena and the Sacred Pool</h3>\n<p>If Ireena accompanies the Acolytes to Krezk, the sacred pool at the village's edge reacts to her presence with a vision of Sergei von Zarovich. Strahd intervenes with lightning and fury: <em>\"She is MINE.\"</em> This event inflicts 1d10 IP on witnesses (<em>Hard (-20) WP</em> to reduce to 1d5). Ireena's psychic abilities spike dramatically afterward.</p>\n<h3>4. The Cybernetics Dilemma</h3>\n<p>Augmented Acolytes require maintenance every 30 days or suffer escalating malfunctions. Abaron is the only individual on Barovus who can provide this service. Each visit costs <strong>1d5 Corruption Points</strong> — the facility is saturated with warp energy, and Abaron's methods have drifted far from Mechanicus orthodoxy. This creates a recurring moral crisis: accept the corruption or lose the augmetics.</p>\n<h3>5. The Belladonna</h3>\n<p><strong>Belladonna Nocturnis</strong> grows in mountain crevices near Krezk. Properly prepared (<em>Challenging (+0) Medicae</em> or <em>Chem-Use</em>), it grants +10 WP vs. warp corruption for 1d5 hours. A foraging expedition (<em>Ordinary (+10) Survival</em>) yields 2d5 doses.</p>\n<h2>Relationships</h2>\n<ul>\n<li><strong>The People of Krezk:</strong> Regard him as both saviour and monster. He provides medical care and protection, but at the cost of occasional \"contributions\" — gene-samples, tissue donations, and sometimes entire persons who enter the Facility and do not return as they were. Their dependence on him is total and resentful.</li>\n<li><strong>Strahd:</strong> Detached, academic reverence. Strahd is a patron, a problem, and a research subject all at once. Abaron does not fear Strahd so much as he fears failing to deliver the Bride. Strahd, for his part, tolerates Abaron because the Magos is useful and because the ongoing project amuses him.</li>\n<li><strong>The Mongrelfolk:</strong> His failed experiments. They worship him with the fervour of those who have nothing else. Their loyalty is absolute and heartbreaking. Abaron cares for them in his own way — they are fed, sheltered, and given purpose — but he categorises them as \"iterations\" rather than people.</li>\n<li><strong>The Acolytes:</strong> Fellow servants of the Imperium (in his mind). He welcomes them, offers help, and sees no reason to hide his work. He becomes agitated only if they threaten the Bride or his patients.</li>\n</ul>\n<h2>Quest Hooks</h2>\n<ul>\n<li><strong>Cybernetics Maintenance:</strong> The essential service. 1d5 CP per visit, but the only option on Barovus.</li>\n<li><strong>Medical Treatment:</strong> Full wound recovery, de-tox, stimms (2d5 doses). All services carry the same CP cost.</li>\n<li><strong>Biological Intelligence:</strong> Abaron knows a great deal about Strahd's biology, the rift's effects on organic tissue, and Warp-Thrall physiology. He shares this freely if asked.</li>\n<li><strong>The Bride:</strong> A central moral question. What do the Acolytes do about it?</li>\n</ul>\n<h2>Possible Outcomes</h2>\n<table><thead><tr><th>Outcome</th><th>Conditions</th><th>Consequences</th></tr></thead><tbody><tr><td><strong>Destroy Abaron</strong></td><td>Combat encounter; Abaron fights with 4 mechadendrites + 2d5 Mongrelfolk</td><td>Krezk loses medical support and protection. No cybernetics maintenance available anywhere on Barovus. The Bride is destroyed. Krezk villagers are hostile.</td></tr><tr><td><strong>Destroy the Bride (spare Abaron)</strong></td><td>Requires reaching the Bride and destroying it (relatively fragile: 10 Wounds, AP 0)</td><td>Abaron is devastated. He may become catatonic, hostile, or — with exceptional roleplaying — redirect his talents toward helping the Acolytes. Strahd is furious and may retaliate against Krezk.</td></tr><tr><td><strong>Free Abaron</strong></td><td><em>Very Hard (-30) Opposed Willpower</em> + exceptional roleplay to break through his delusions</td><td>Abaron's humanity surfaces. He recognises the horror of his work. This does not make him sane or redeemed — it makes him aware, which is worse. He may aid the Acolytes as penance but is emotionally shattered.</td></tr><tr><td><strong>Complete the Bride</strong></td><td>Assist Abaron in finishing his work (requires multiple <em>Medicae</em>/<em>Tech-Use</em> tests; each test costs 1d5 CP)</td><td>The Bride is presented to Strahd. It does not end the curse. Strahd is briefly intrigued, then dismissive. Abaron's hope collapses. The political and spiritual consequences are severe.</td></tr><tr><td><strong>Negotiate / Leave him be</strong></td><td>Accept his services, ignore the moral implications</td><td>Ongoing access to maintenance, medical care, and intelligence. The Bride remains in progress. The moral weight remains on the Acolytes' conscience.</td></tr></tbody></table>"
                },
                "_id": "npc06plotconnect"
            },
            {
                "name": "GM Reference",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Mechanical Notes</h2>\n<table><thead><tr><th>Characteristic</th><th>WS</th><th>BS</th><th>S</th><th>T</th><th>Ag</th><th>Int</th><th>Per</th><th>WP</th><th>Fel</th></tr></thead><tbody><tr><td><strong>Value</strong></td><td>45</td><td>40</td><td>45</td><td>50</td><td>30</td><td>75</td><td>45</td><td>55</td><td>20</td></tr></tbody></table>\n<p><strong>Movement:</strong> 3/6/9/18 | <strong>Wounds:</strong> 25 | <strong>Threat Rating:</strong> Dangerous</p>\n<p><strong>Armour:</strong> Mechanical body (AP 6 all locations)</p>\n<p><strong>Weapons:</strong></p>\n<ul>\n<li>4x Mechadendrites (Melee; 1d10+5 R each; may attack with up to 4 per round as a Full Action)</li>\n<li>Integrated laspistol (Pistol; 30m; S/--/--; 1d10+2 E; Pen 0; Clip 30; Reload Full)</li>\n<li>Injector claw (Melee; 1d10+3 R; Special: Toxin — target must pass <em>Toughness</em> test or suffer -20 to all tests for 1d10 rounds)</li>\n</ul>\n<p><strong>Skills:</strong> Tech-Use +30, Medicae +30, Forbidden Lore (Xenos, Warp) +20, Scholastic Lore (Chymistry) +20, Awareness +10</p>\n<p><strong>Talents:</strong> Mechadendrite Use (all), Technical Knock, Luminen Charge</p>\n<p><strong>Traits:</strong> Mechanicus Implants, Multiple Arms (4 mechadendrites), Dark Sight</p>\n<p><strong>Gear:</strong> Surgical tools, chymistry lab equipment, experimental compounds, research data-slates, Mongrelfolk remote control device</p>\n<h3>Special Abilities</h3>\n<ul>\n<li><strong>Command Mongrelfolk:</strong> Abaron can direct up to 6 Mongrelfolk as a Free Action each round via implanted compliance devices. They obey without question. If Abaron is killed, Mongrelfolk become confused and non-hostile (unless provoked).</li>\n<li><strong>Flesh-Warp:</strong> Half Action melee attack. Target must pass <em>Toughness</em> test or suffer 1d10 damage and gain a temporary mutation (fades after 1d10 days). Reshapes organic matter with a touch.</li>\n<li><strong>Emergency Self-Repair:</strong> Once per encounter, Full Action to restore 1d10+5 Wounds via internal repair protocols.</li>\n</ul>\n<h3>Combat Behaviour</h3>\n<p>Abaron is not hostile unless provoked. If combat begins, he fights intelligently — using Mongrelfolk as screens while striking with multiple mechadendrites from behind them. He targets the greatest threat first, using the injector claw's toxin to debilitate dangerous melee combatants. He uses Flesh-Warp opportunistically against lightly armoured targets. If reduced below 10 Wounds, he uses Emergency Self-Repair and attempts to negotiate a ceasefire. He will retreat into the Facility's depths if overwhelmed, sealing blast doors behind him and using Mongrelfolk to delay pursuit.</p>\n<p>He fights to protect the Bride above all else. If the Acolytes threaten the Bride directly, he abandons tactical restraint and attacks with everything, including directing all available Mongrelfolk into combat simultaneously.</p>\n<h2>Skill Tests</h2>\n<table><thead><tr><th>Interaction</th><th>Test</th><th>Modifiers</th><th>Notes</th></tr></thead><tbody><tr><td>Request medical treatment</td><td>No test required</td><td>—</td><td>He provides willingly; the cost is environmental (1d5 CP per visit to the Facility)</td></tr><tr><td>Request cybernetics maintenance</td><td>No test required</td><td>—</td><td>Eagerly provided. Same CP cost. He may comment on the augmetics' craftsmanship (or lack thereof).</td></tr><tr><td>Convince him his work is heretical</td><td><em>Opposed Willpower</em></td><td>Very Hard (-30)</td><td>Penalised by his Insanity and obsession. Even success produces despair, not redemption.</td></tr><tr><td>Negotiate for information about Strahd</td><td><em>Inquiry</em> or <em>Charm</em></td><td>Ordinary (+10)</td><td>He shares biological/medical intelligence freely. Tactical or personal information about Strahd requires harder tests.</td></tr><tr><td>Inspect the Bride</td><td><em>Medicae</em> or <em>Forbidden Lore (Warp)</em></td><td>Challenging (+0)</td><td>Reveals the Bride's nature: vat-grown, gene-crafted, sustained by low-level warp energy. No soul, no consciousness. Biologically perfect; spiritually empty.</td></tr><tr><td>Sabotage the Facility covertly</td><td><em>Tech-Use</em> or <em>Security</em></td><td>Hard (-20)</td><td>The Facility is monitored by Abaron's augmetic senses and Mongrelfolk sentries. Covert action requires both stealth and technical skill.</td></tr><tr><td>Free a Mongrelfolk from compliance device</td><td><em>Medicae</em></td><td>Hard (-20)</td><td>The Mongrelfolk suffers 1d10 damage from removal. If freed, it is confused but potentially grateful.</td></tr></tbody></table>\n<h2>Items &amp; Resources</h2>\n<ul>\n<li><strong>Cybernetics Maintenance:</strong> The only source on Barovus. Keeps augmetics functional for 30 days per session. Cost: 1d5 Corruption Points per visit (non-negotiable; the corruption is environmental, not voluntary).</li>\n<li><strong>Medical Treatment:</strong> Full wound recovery, de-tox, stimm supply (2d5 doses per visit). Same CP cost.</li>\n<li><strong>Biological Intelligence:</strong> Detailed knowledge of the warp rift's effects on organic tissue, Strahd's regenerative biology, Warp-Thrall physiology, and the properties of local flora (including Belladonna Nocturnis).</li>\n<li><strong>Experimental Compounds:</strong> Abaron can produce custom chemical compounds — stimulants, toxins, sedatives, and more exotic substances — if provided with raw materials and a specific request. Quality is excellent; theological purity is non-existent.</li>\n<li><strong>The Bride:</strong> A vat-grown body of extraordinary physical perfection. 10 Wounds, AP 0. Destroying it is easy; the consequences are not.</li>\n<li><strong>Mongrelfolk Remote Control:</strong> If obtained (by killing Abaron or stealing it), this device can command any Mongrelfolk with an active compliance implant. Up to 6 at a time, as a Free Action.</li>\n</ul>\n<h2>Common GM Questions</h2>\n<h3>Is Abaron redeemable?</h3>\n<p>Partially. His delusions can be broken through exceptional roleplaying and a <em>Very Hard (-30) Opposed Willpower</em> test. Success does not make him sane — it makes him <em>aware</em>, which is arguably crueller. He recognises the horror of his work, is consumed by guilt, and may redirect his considerable talents toward aiding the Acolytes as penance. But he is not \"fixed.\" He is a man who has spent a century committing atrocities in the name of a false hope, and that awareness may destroy him faster than any enemy.</p>\n<h3>Why does maintenance cost Corruption Points?</h3>\n<p>The CP cost is environmental, not theological. The Krezk Biologis Facility is saturated with residual warp energy from over a century of Abaron's increasingly heretical procedures. The tools, the chemicals, the very air is tainted. Even Abaron's best intentions cannot change the fact that his workspace has become a low-level warp-corruption zone. Acolytes with strong Willpower may resist some effects, but the base cost is unavoidable — the price of survival on Barovus.</p>\n<h3>What if the Acolytes have no augmetics?</h3>\n<p>Then the cybernetics dilemma does not apply directly — but Abaron is still the only advanced medical facility on Barovus. Wound recovery, de-tox, stimm production, and his biological intelligence about Strahd remain valuable. The moral question shifts from \"do we accept corruption to maintain our bodies\" to \"do we accept corruption to maintain our health.\"</p>\n<h3>What happens if the Bride is completed and presented to Strahd?</h3>\n<p>Strahd is briefly intrigued. He examines the Bride with the detachment of a connoisseur appraising a painting. He may even compliment Abaron's craftsmanship. But the Bride is a shell — it has no soul, no psychic resonance, none of the quality that draws Strahd to Tatyana's reincarnations. He is dismissive, then bored, then gone. Abaron's hope collapses. The Acolytes witness a man's reason for living evaporate in a single conversation. This should be played as one of the campaign's most quietly devastating moments.</p>\n<h3>Can the Acolytes use the Facility as a base?</h3>\n<p>Yes, with caveats. It is fortified, well-supplied, and defensible. Abaron welcomes them. But every day spent in the Facility costs 1 Corruption Point (in addition to any services rendered), and the Mongrelfolk are an ever-present unsettling presence. Sleeping in the Facility triggers vivid, warp-tinged nightmares (no mechanical effect, but excellent atmospheric horror). It is a resource, not a refuge.</p>"
                },
                "_id": "npc06gmreference"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "role": "ambiguous-npc"
            }
        }
    },
    {
        "name": "Baba Lysaga — The Warp-Hag",
        "pages": [
            {
                "name": "Profile",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<blockquote><p>The swamp parts before the thing like black water around the prow of a ship. It is a hab-unit — you recognise the prefabricated Imperial housing module, or what remains of one — but it walks. Massive mechanical legs, crusted with rust and something that might be barnacles or might be teeth, drive it forward through knee-deep muck with a grinding, lurching gait. Warp-light pulses in the seams of its corroded hull, and tendrils of something organic and wet trail from its undercarriage like entrails.</p><p>A window shutter bangs open. A face appears — if it can be called a face. It is bloated, amphibian, split by a smile far too wide for a human skull. The eyes are solid black, like pools of tar. The voice that emerges is a cracked, sing-song croon, eerily tender, as though addressing a beloved child.</p><p>\"Visitors? Oh, my dears. My poor, lost little dears. Have you come to see Mother? Mother has been waiting. Mother is <em>always</em> waiting.\"</p></blockquote>\n<h2>Key Facts</h2>\n<table>\n<thead>\n<tr><th>Detail</th><th>Information</th></tr>\n</thead>\n<tbody>\n<tr><td><strong>Role</strong></td><td>Boss NPC / Enemy Psyker</td></tr>\n<tr><td><strong>Location</strong></td><td>Berez — The Drowned Ruins (Location 7)</td></tr>\n<tr><td><strong>Threat Level</strong></td><td>Severe (one of the hardest fights in the campaign)</td></tr>\n<tr><td><strong>Allegiance</strong></td><td>Strahd (unconditional, obsessive devotion)</td></tr>\n<tr><td><strong>Psy Rating</strong></td><td>7</td></tr>\n<tr><td><strong>Key Items</strong></td><td>Sacred Seed #2, collection of stolen holy relics (defiled), warp-infused fetishes</td></tr>\n<tr><td><strong>Walking Hab-Unit</strong></td><td>SI 30, Armour 20 all facings, stomping legs and warp tendrils</td></tr>\n</tbody>\n</table>\n<h2>Background</h2>\n<p><strong>Baba Lysaga</strong> was a midwife and nursemaid in the von Zarovich household who attended Strahd's birth over four centuries ago. In her obsessive devotion to the infant, she made pacts with warp entities before Strahd was even born, shaping events to ensure his survival, his strength, and his eventual ascension to power. She considers herself Strahd's \"true mother\" — a claim she makes with absolute conviction and homicidal ferocity toward anyone who disputes it. The actual nature of her relationship with Strahd is more tragic than she knows: he tolerates her existence but does not acknowledge her claims, regarding her as little more than a useful relic of his past.</p>\n<p>Centuries of warp exposure have transformed Lysaga into something that defies human biology. She is ancient beyond any natural lifespan, sustained entirely by the constant flow of warp energy through her corroded flesh. Her body is bloated, amphibian, and barely recognisable as human. She dwells in the drowned ruins of Berez — a village that Strahd himself destroyed two centuries ago when its inhabitants murdered a previous Tatyana reincarnation named Marina. The ruins are now a festering swamp of concentrated warp corruption, and Lysaga has made them her domain.</p>\n<p>Her lair is a <strong>walking hab-unit</strong>: a prefabricated Imperial housing module animated by warp energy and mounted on massive mechanical legs of unclear origin. It lurches through the swamp like some grotesque beast of burden, and Lysaga rides in its upper compartment like a deranged queen on a palanquin. She has stolen and defiled holy relics from across Barovus, using their corrupted sanctity as fuel for her warp-rituals — for sanctified objects, when corrupted, generate enormous amounts of warp energy. Among her trophies is <strong>Sacred Seed #2</strong>, needed to restore the Recaf Distillery.</p>\n<h2>Appearance &amp; Demeanour</h2>\n<p>Lysaga is a bloated, twisted figure barely recognisable as human. Her skin ripples and shifts like something alive beneath the surface. Her fingers are too long, her smile too wide, her eyes solid black. She moves with a hunched, scuttling gait when outside her hab-unit, her joints bending at angles that should not be possible. The air around her smells of stagnant water, decaying vegetation, and the ozone-tang of uncontrolled psychic power.</p>\n<p>Her demeanour shifts without warning between cooing maternal tenderness and shrieking, murderous fury. She speaks of Strahd with the reverence of a mother discussing a gifted child, and she will turn to incandescent rage at the slightest perceived slight against him. There is a tragic core to her insanity — she genuinely loves Strahd, even if that love has curdled into something deranged and monstrous over four hundred years of isolation and warp-corruption.</p>"
                },
                "_id": "b2256a5417304880"
            },
            {
                "name": "Roleplaying Guide",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Personality Core</h2>\n<p><strong>Baba Lysaga</strong> is defined by a single, all-consuming delusion: she is Strahd's mother, and everything she has done — the pacts, the murders, the centuries of warp-corruption — has been for her baby. This is not a persona she adopts; it is the bedrock of her identity. Every thought, every action, every flicker of emotion runs through this lens. She does not question it. She cannot question it. To question it would be to confront the reality that she destroyed herself for a man who does not even acknowledge her existence, and that realisation would unmake her.</p>\n<p>Despite her insanity, Lysaga possesses a cunning, predatory intelligence. She has survived for centuries in one of the most warp-saturated environments on Barovus. She knows the swamp intimately, commands the dead that infest it, and wields psychic power with the instinct of someone for whom the warp is as natural as breathing. She is not a raving lunatic — she is a raving lunatic who also happens to be one of the most dangerous psykers on the planet.</p>\n<p>There is, buried deep beneath the madness, something almost pitiable about her. She was a woman who loved a child so fiercely that she traded her soul, her body, and her sanity to protect him. That love was never reciprocated. It never could be. And so it festered, decade after decade, century after century, into something that is simultaneously the most human and the most monstrous thing about her.</p>\n<h2>Voice &amp; Mannerisms</h2>\n<p>Lysaga's voice is cracked and ancient, like dry parchment tearing. She shifts between registers without warning: one moment a soft, maternal croon, the next a shriek of rage that rattles the walls. She refers to herself as \"Mother\" constantly, speaks of Strahd with breathless, loving reverence, and addresses the Acolytes as \"children\" or \"poor dears\" — unless they anger her, at which point they become \"vermin,\" \"ingrates,\" or \"things that crawl.\"</p>\n<p>She hums lullabies while casting psychic powers. She strokes her staff as though it were a child's head. Her black eyes never blink.</p>\n<p><strong>Example Quotes:</strong></p>\n<ul>\n<li>\"My baby has done so well. So strong, so powerful. A mother could not be more proud. And you — you come here to hurt him? To take what is <em>his</em>?\" <em>(soft, trembling with barely contained rage)</em></li>\n<li>\"Shhh, shhh. Mother will make it stop. Mother will make <em>everything</em> stop.\" <em>(while preparing to attack)</em></li>\n<li>\"The Lord-Governor does not need a mother, they said. They took him from me. They took my boy. But I found him. I <em>always</em> find him.\" <em>(rocking back and forth, lost in memory)</em></li>\n<li>\"You smell like the Corpse-Emperor's lapdogs. I can taste the false faith on you. It makes Mother's stomach turn.\" <em>(lip curling in disgust)</em></li>\n<li>\"Oh, but you are brave little things, aren't you? Brave, stupid, fragile little things. Mother will put you in the water with the others. You will be quiet there. Everyone is quiet in the water.\" <em>(smiling, almost gentle)</em></li>\n</ul>\n<h2>What She Wants</h2>\n<p>Lysaga wants one thing: to protect and nurture Strahd's power. She steals and defiles holy relics to weaken the Emperor's light on Barovus. She guards the sacred seed because its corruption fuels her rituals. She kills anyone she perceives as a threat to \"her baby.\" She would burn the entire planet to ash if she believed it would make Strahd stronger, and she would do it singing a lullaby.</p>\n<h2>What She Fears</h2>\n<p>Lysaga fears irrelevance. She fears that Strahd does not need her — a fear that, if voiced aloud, would provoke a psychic detonation of pure rage. She also fears, on some buried instinctive level, the Emperor's light: genuine acts of faith cause her physical discomfort, and sanctified ground burns her if she treads upon it. She will not willingly enter a consecrated area.</p>\n<h2>Reactions</h2>\n<table>\n<thead>\n<tr><th>Stimulus</th><th>Response</th></tr>\n</thead>\n<tbody>\n<tr><td><strong>Respect / Flattery</strong></td><td>Lysaga is momentarily pleased if the Acolytes acknowledge her as Strahd's mother. She will coo and preen, perhaps even offer a scrap of information before remembering that they are enemies. Flattery buys time, not safety.</td></tr>\n<tr><td><strong>Threats</strong></td><td>Immediate and overwhelming psychic violence. She does not escalate — she starts at maximum fury. Threatening Strahd in her presence is the fastest way to trigger a fight.</td></tr>\n<tr><td><strong>Questions about Strahd</strong></td><td>She will talk about him for hours if allowed — his childhood, his strength, his brilliance. All of it is filtered through her delusion and much of it is factually inaccurate, but fragments of genuine intelligence can be extracted by a perceptive listener (<strong>Hard (-20) Scrutiny</strong> to separate truth from fantasy).</td></tr>\n<tr><td><strong>Displays of Faith</strong></td><td>Hissing, spitting rage. She despises the Emperor's faith with the intensity of someone who chose to abandon it. Prayers and holy symbols cause her genuine pain (Fear test equivalent for her within 5m of a genuinely held symbol).</td></tr>\n<tr><td><strong>Denying her motherhood</strong></td><td>The most dangerous reaction. Telling Lysaga she is not Strahd's mother — or worse, that Strahd does not love her — triggers an uncontrolled psychic event: all creatures within 15m must pass a <strong>Hard (-20) Willpower</strong> Test or suffer 1d10 Insanity Points as her grief and fury pour outward in a raw warp-scream.</td></tr>\n<tr><td><strong>Competence / Strength</strong></td><td>She is grudgingly impressed by strong opponents. She may compare them favourably to Strahd — the highest compliment she can offer — even as she tries to kill them.</td></tr>\n</tbody>\n</table>"
                },
                "_id": "npc07roleplay001"
            },
            {
                "name": "Plot Connections",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Story Role</h2>\n<p>Baba Lysaga serves three narrative functions in the campaign. First, she is a <strong>boss encounter</strong> — one of the most dangerous combat challenges the Acolytes will face outside the final confrontation with Strahd. Second, she is a <strong>gatekeeper</strong>: she holds Sacred Seed #2, which is required to restore the Recaf Distillery (Location 5) and establish supply lines across Barovus. Third, she is a <strong>mirror for Strahd's tragedy</strong> — living proof that devotion without reciprocation, love without limits, becomes its own kind of damnation.</p>\n<h2>Key Scenes</h2>\n<h3>1. Approach Through the Swamp</h3>\n<p>The journey to Berez is itself a horror set-piece. The swamp is hostile terrain (half speed, -10 Agility tests), plagued by Plague Revenants (1d5 every 30 minutes), and oppressive enough to require <strong>Ordinary (+10) Willpower</strong> Tests hourly to avoid Insanity Points. The Acolytes should hear Lysaga before they see her — the grinding of the walking hab-unit's legs, the croon of her lullaby drifting through the fog.</p>\n<h3>2. Marina's Monument</h3>\n<p>A ruined shrine near the centre of old Berez commemorates Marina, a previous Tatyana reincarnation murdered by fearful villagers two centuries ago. If <strong>Ireena</strong> is present, the shrine triggers a psychic resonance that reveals the full cycle of Tatyana's reincarnations — dozens of lives, each ending in tragedy orchestrated by Strahd. This is critical intelligence for understanding and potentially breaking the curse. Lysaga may or may not be aware of the shrine's power; she has not destroyed it, perhaps because the pain it represents feeds her own warp-rituals.</p>\n<h3>3. The Boss Fight</h3>\n<p>Lysaga fights from within her walking hab-unit, using psychic powers while the vehicle itself engages in melee. She is accompanied by 2d10 Plague Revenants and her Swarm of Crows. The terrain (deep water, unstable ground, limited cover) favours her overwhelmingly. This encounter should be treated as a set-piece battle with multiple tactical objectives: disable the hab-unit, deal with the swarms, and then confront Lysaga herself on foot.</p>\n<h2>Relationships</h2>\n<table>\n<thead>\n<tr><th>NPC</th><th>Relationship</th></tr>\n</thead>\n<tbody>\n<tr><td><strong>Strahd</strong></td><td>Unconditional, obsessive, unrequited devotion. She is his self-proclaimed mother. He tolerates her but does not acknowledge her claims. This disconnect is the tragic core of her character.</td></tr>\n<tr><td><strong>Ireena / Tatyana</strong></td><td>Lysaga views each Tatyana reincarnation with jealous hostility. She sees them as rivals for Strahd's affection — threats to her position as the woman who matters most in his life. She will try to kill Ireena if given the opportunity.</td></tr>\n<tr><td><strong>The Martikovs</strong></td><td>The Martikov family and their raven-shapeshifting bloodline have been Lysaga's enemies for generations. She hunts them when she can. They spy on her from a distance. The enmity is ancient and bitter.</td></tr>\n<tr><td><strong>Plague Revenants</strong></td><td>The dead of Berez are her servants, animated by her warp powers. She raises them from the swamp as needed — an effectively unlimited supply of expendable troops in her home territory.</td></tr>\n</tbody>\n</table>\n<h2>Quest Hooks</h2>\n<ul>\n<li><strong>The Second Seed:</strong> The Martikovs at the Recaf Distillery (or Blue Water Inn) can identify Lysaga as the thief who took Sacred Seed #2. Recovering it is essential for restoring the distillery and establishing supply lines.</li>\n<li><strong>Marina's Truth:</strong> Kasimir or Madam Eva may direct the Acolytes to the monument in Berez, hinting that it holds information about the Tatyana reincarnation cycle. This requires braving Lysaga's territory.</li>\n<li><strong>The Defiled Relics:</strong> Inquisitor Van Richten knows that Lysaga has been stealing and corrupting holy relics from across Barovus. Recovering even one intact relic could provide a powerful anti-warp resource.</li>\n<li><strong>Emperor's Tarot:</strong> The Tarot reading may designate an item or ally location within Berez, forcing the Acolytes to confront Lysaga regardless of other quest priorities.</li>\n</ul>\n<h2>Possible Outcomes</h2>\n<ul>\n<li><strong>Lysaga Defeated:</strong> The swamp does not become safe, but the oppressive psychic presence lifts. Sacred Seed #2 is recovered. Any surviving Plague Revenants lose animation and collapse. The Martikovs are deeply grateful.</li>\n<li><strong>Lysaga Driven Off:</strong> If the hab-unit is destroyed but Lysaga escapes on foot, she becomes a recurring threat — weakened but vengeful. She may appear as a random encounter during later travel, ambushing the Acolytes with hit-and-run psychic attacks. The seed can only be recovered if she is killed or her lair is thoroughly searched.</li>\n<li><strong>The Acolytes Retreat:</strong> A legitimate outcome. Lysaga is a fight that unprepared parties should flee from. The seed remains out of reach, and the distillery quest stalls until the Acolytes return stronger.</li>\n<li><strong>Negotiation (Extremely Unlikely):</strong> Lysaga cannot be reasoned with under normal circumstances, but a truly creative party might offer her something she values — information about Strahd, a gift \"from her son,\" or a defiled relic of greater power. A <strong>Hellish (-60) Deceive</strong> Test might convince her the Acolytes serve Strahd. Success is temporary at best; she will see through the deception eventually.</li>\n</ul>"
                },
                "_id": "npc07plotconnect"
            },
            {
                "name": "GM Reference",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Mechanical Notes</h2>\n<p><strong>Baba Lysaga</strong> is a <em>Severe</em>-rated threat with Psy Rating 7, making her one of the most powerful psykers on Barovus. She fights from within her walking hab-unit (SI 30, Armour 20 all facings), which must be destroyed before she can be engaged directly. She can only be targeted separately with a called shot at -20 to hit her through the observation slit. Her personal stats are: WS 30, BS 25, S 35, T 40, Ag 30, Int 55, Per 50, WP 75, Fel 15. She has 30 Wounds and AP 4 (warp-hardened flesh) once dismounted.</p>\n<h3>Psychic Powers</h3>\n<ul>\n<li><strong>Warp Fire</strong> (Half Action): 20m cone, 3d10+7 E, Pen 4, Flame. Targets On Fire if damaged.</li>\n<li><strong>Telekinesis</strong> (Half Action): Hurl object up to Size (Hulking) at target within 30m for 2d10+5 I, or shove all within 10m backward 1d10m (Agility or Prone).</li>\n<li><strong>Domination</strong> (Half Action): Single target within 15m, WP Test at -10 or controlled for 1d5 rounds.</li>\n<li><strong>Flesh Warp</strong> (Full Action): Touch attack. Toughness Test at -10 or suffer 2d10 damage (ignoring armour) + permanent mutation. Even on success: 1d5 damage.</li>\n<li><strong>Warp Storm</strong> (Full Action, sustained): 15m radius within 30m. 2d10 E at start of each turn + WP Test or 1d5 Corruption Points. Sustained as Half Action.</li>\n<li><strong>Swarm of Crows</strong> (unique): Cloud of warp-corvids. 10m radius. 1d10 R/round, obscures vision.</li>\n<li><strong>Death's Embrace</strong> (unique): 30m ranged psychic attack, 2d10+5 E, Pen 5, Warp Weapon.</li>\n<li><strong>Animate Dead</strong> (unique): Raises 1d5 Plague Revenants per round from the swamp.</li>\n</ul>\n<h3>Walking Hab-Unit</h3>\n<ul>\n<li><strong>Type:</strong> Walker / Warp-Animated Construct</li>\n<li><strong>SI:</strong> 30 | <strong>Armour:</strong> 20 all facings | <strong>Movement:</strong> 4/8/12/16</li>\n<li><strong>Stomping Legs:</strong> 2d10+10 I, Pen 5, Concussive [2]</li>\n<li><strong>Warp Tendrils:</strong> 1d10+8 R, Snare (Strength at -10 or Grappled; 1d10+8 R/round auto-damage)</li>\n<li><strong>Warp-Animated:</strong> Not a true machine. Immune to Tech-Use and haywire. Vulnerable to holy/blessed weapons (ignore 10 points of Armour).</li>\n<li><strong>On Destruction:</strong> Collapses. Lysaga: Agility Test or 2d10 I damage. Then fights on foot.</li>\n</ul>\n<h2>Skill Tests</h2>\n<table>\n<thead>\n<tr><th>Situation</th><th>Test</th><th>Difficulty</th><th>Notes</th></tr>\n</thead>\n<tbody>\n<tr><td>Tracking the hab-unit through the swamp</td><td><em>Survival</em> or <em>Awareness</em></td><td>Challenging (+0)</td><td>Tracks are enormous but fill with water; alternatively, follow her singing</td></tr>\n<tr><td>Extracting true information from her ranting</td><td><em>Scrutiny</em></td><td>Hard (-20)</td><td>She mixes genuine intelligence about Strahd with delusional fantasy</td></tr>\n<tr><td>Convincing her you serve Strahd</td><td><em>Deceive</em></td><td>Hellish (-60)</td><td>She is paranoid and psychically perceptive; temporary at best</td></tr>\n<tr><td>Resisting the swamp's oppressive atmosphere</td><td><em>Willpower</em></td><td>Ordinary (+10)</td><td>Every hour; failure = 1 Insanity Point</td></tr>\n<tr><td>Hitting Lysaga inside the hab-unit (called shot)</td><td><em>BS</em> or <em>WS</em></td><td>-20 penalty</td><td>Through the observation slit</td></tr>\n<tr><td>Noticing the sacred seed among her trophies</td><td><em>Awareness</em></td><td>Challenging (+0)</td><td>It radiates faint holy energy even through corruption</td></tr>\n</tbody>\n</table>\n<h2>Items &amp; Resources</h2>\n<ul>\n<li><strong>Sacred Seed #2:</strong> Required for the Recaf Distillery restoration. Found among Lysaga's defiled relic collection. Needs purification (<strong>Challenging (+0) Scholastic Lore (Occult)</strong> or prayer by a faithful character) before use.</li>\n<li><strong>Defiled Holy Relics:</strong> Lysaga has collected 1d5 corrupted relics from across Barovus. Each could be purified with effort and used as a minor anti-warp ward (+5 WP vs. psychic powers within 3m), or studied for Forbidden Lore purposes.</li>\n<li><strong>Warp-Infused Herbs:</strong> Lysaga's poultices and herbal preparations are potent but tainted. A character with <strong>Medicae</strong> or <strong>Scholastic Lore (Chymistry)</strong> can process them into either healing draughts (restore 1d10 Wounds, gain 1 Corruption Point) or toxins (applied to weapons: +1d10 Toxic damage for 3 hits).</li>\n<li><strong>Bone Fetishes:</strong> Decorative but radiating minor warp energy. Worth study for anyone investigating Barovus's warp phenomena. Each fetish examined grants +5 to a single <strong>Forbidden Lore (Warp)</strong> Test.</li>\n</ul>\n<h2>Common GM Questions</h2>\n<h3>Can the Acolytes avoid fighting Lysaga entirely?</h3>\n<p>Yes, but it costs them. Without Sacred Seed #2, the Recaf Distillery cannot be fully restored, which means no supply lines and reduced NPC cooperation across Barovus. The Acolytes can still complete the campaign, but logistical difficulties increase significantly. If the Tarot reading places an item or ally in Berez, avoidance becomes much harder.</p>\n<h3>What if the Acolytes bring Ireena to Berez?</h3>\n<p>Lysaga will sense Ireena's psychic signature and recognise her as a Tatyana reincarnation. She will prioritise killing Ireena above all other targets, viewing her as a rival for Strahd's love. This makes the encounter significantly more dangerous but also more narratively rich, especially if the Acolytes reach Marina's monument first.</p>\n<h3>How should the hab-unit fight be paced?</h3>\n<p>Phase 1: The hab-unit advances through the swamp, stomping and grappling while Lysaga casts from inside. Plague Revenants emerge from the water. Phase 2: Once the hab-unit takes significant damage (below 15 SI), Lysaga becomes more aggressive, using Warp Storm and Warp Fire. Phase 3: The hab-unit collapses. Lysaga fights on foot, desperate and furious. This is when she is most dangerous psychically but most vulnerable physically.</p>\n<h3>Does Strahd care if Lysaga is killed?</h3>\n<p>Not meaningfully. He is dimly aware of her existence and tolerates her devotion, but he does not love her and never has. If the Acolytes kill Lysaga and later mention it to Strahd, he reacts with mild indifference — \"Ah. The old woman in the swamp. She was devoted, in her way. How tedious.\" This reaction, if relayed or discovered, adds another layer of tragedy to Lysaga's story.</p>\n<h3>What happens if Lysaga is allowed to talk?</h3>\n<p>She will talk extensively about Strahd — his childhood, his ambitions, his \"brilliance.\" Most of this is filtered through her delusion and historically inaccurate, but fragments of genuine intelligence can be extracted. She knows the general layout of the Zarovich Spire (she visited in earlier centuries), she knows about Strahd's coffin (though not its current location), and she knows about the Daemon Prince's pact (though she describes it as \"a mother's blessing, amplified\"). Treat her ranting as a source of Forbidden Lore with a heavy filter of unreliability.</p>"
                },
                "_id": "npc07gmreference"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "role": "boss-npc"
            }
        }
    },
    {
        "name": "Burgomaster Vallakovich",
        "pages": [
            {
                "name": "Profile",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<blockquote><p>The man behind the desk is shorter than his voice suggested. Stocky, running to fat, stuffed into a PDF officer's uniform that was clearly tailored for a younger, thinner version of himself. His medals — polished to a mirror shine, every one inherited rather than earned — glint under the flickering lumen-strip. His eyes are the eyes of a man who has not slept properly in years: red-rimmed, darting, searching your faces for something he desperately needs to find.</p><p>He rises, spreading his arms wide, and his smile is enormous, aggressive, and does not reach those exhausted eyes.</p><p>\"Welcome! WELCOME to Fortress Vallak! The Emperor's light shines upon all who enter these walls in good faith! You are Inquisitorial agents, yes? EXCELLENT. Excellent! You will see that ALL IS WELL here. ALL. IS. WELL. Come! Let me show you our preparations for the Festival of Joy — you will be <em>amazed</em> at the morale of our citizens!\"</p></blockquote>\n<h2>Key Facts</h2>\n<table>\n<thead>\n<tr><th>Detail</th><th>Information</th></tr>\n</thead>\n<tbody>\n<tr><td><strong>Role</strong></td><td>Political NPC / Obstacle / Tragic Figure</td></tr>\n<tr><td><strong>Location</strong></td><td>Fortress Vallak — Administratum Building (Location 1)</td></tr>\n<tr><td><strong>Threat Level</strong></td><td>Non-combatant (but commands ~200 PDF soldiers and Izek Strazni)</td></tr>\n<tr><td><strong>Allegiance</strong></td><td>The Imperium (nominally); his own survival and control (practically)</td></tr>\n<tr><td><strong>Enforcer</strong></td><td>Izek Strazni — warp-mutant with fire-generating arm, personally loyal</td></tr>\n<tr><td><strong>Key Items</strong></td><td>Garrison command authority, vox-caster network, Festival infrastructure</td></tr>\n</tbody>\n</table>\n<h2>Background</h2>\n<p><strong>Burgomaster Vargas Vallakovich</strong> inherited his position from his father, who inherited it from his father, in an unbroken chain of increasingly desperate military governors stretching back to the early years of the warp rift. He commands approximately two hundred PDF soldiers — poorly equipped, poorly trained, and terrified — and governs the largest surviving settlement on Barovus through a combination of military authority, propaganda, and the sheer force of his denial.</p>\n<p>Vallakovich genuinely believes that the warp feeds on misery, fear, and despair — and he is not entirely wrong. His solution, however, is a monstrous overcorrection: if the citizens are forced to be happy, the warp will have nothing to feed on, and the fog will recede. The mandatory Festivals of Joy are his great work. Each one is more elaborate and more desperately cheerful than the last. Each one fails to push back the fog. And so each subsequent festival must be bigger, louder, more mandatory. The logic is unassailable to a mind in the grip of obsessive denial.</p>\n<p>He is not a bad man. This is the tragedy. Vallakovich is pathetic, which is worse than evil. He is genuinely trying his best, and his best is catastrophically inadequate. The citizens suffer under his paranoid control: neighbours report neighbours for insufficient enthusiasm, children are drilled in patriotic songs, and those whose joy is deemed inadequate at the festivals face severe punishment. His enforcer, <strong>Izek Strazni</strong>, maintains order through intimidation, imprisonment, and the occasional public execution of \"malcontents.\"</p>\n<h2>Appearance &amp; Demeanour</h2>\n<p>A heavyset man in his late fifties, florid complexion, bulging eyes permanently wide with unacknowledged terror. He keeps his uniform immaculate through obsessive maintenance — every crease pressed, every button polished, as though the state of his clothing is the one variable he can still control. His voice is loud, relentlessly positive, and exhausting to listen to for more than a few minutes. He repeats slogans like mantras, and underneath the bluster, the cracks are visible to anyone who looks: the tremor in his hands, the way his smile falters when he thinks no one is watching, the brief moments of silence where genuine fear surfaces before being drowned again in forced cheer.</p>"
                },
                "_id": "0d700cd210044fcd"
            },
            {
                "name": "Roleplaying Guide",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Personality Core</h2>\n<p><strong>Vallakovich</strong> is a man who has responded to existential horror by doubling down on control. Every fibre of his being is devoted to maintaining the illusion that everything is fine — not because he is stupid, but because the alternative is to admit that he is powerless, and a powerless man in Fortress Vallak is a dead man. His denial is not ignorance; it is survival. Somewhere beneath the slogans and the forced smiles, Vallakovich knows the truth. He knows the festivals do not work. He knows the fog is not receding. He knows his people are suffering. And he cannot allow himself to know these things, because if he does, he will break.</p>\n<p>He is, at his core, a frightened man pretending to be a strong one. His authority comes not from competence or charisma but from the fact that no one else has stepped up to lead, and from the loyalty of Izek Strazni, who is the real muscle behind the Burgomaster's throne. Without Izek, Vallakovich is a blustering man in a too-tight uniform. With Izek, he is a petty tyrant with a warp-fire-wielding enforcer.</p>\n<h2>Voice &amp; Mannerisms</h2>\n<p>Vallakovich speaks in a perpetual broadcast voice — loud, projecting, as though addressing a crowd even in private conversation. He emphasises words seemingly at random, creating a cadence that is both bombastic and deeply unsettling. He repeats his slogans reflexively: \"ALL IS WELL,\" \"JOY IS DUTY,\" \"THE EMPEROR SMILES UPON THE FAITHFUL.\" These are not just propaganda; they are prayers. They are the words he uses to hold himself together.</p>\n<p>When the mask slips — and it does, briefly, in moments of genuine stress — his voice drops to a whisper, his eyes go hollow, and the desperate, terrified man underneath becomes visible for just a moment before the bluster slams back into place.</p>\n<p><strong>Example Quotes:</strong></p>\n<ul>\n<li>\"ALL IS WELL in Fortress Vallak! The walls are STRONG, the garrison is LOYAL, the citizens are HAPPY, and the Emperor PROTECTS! Do you hear me? The Emperor <em>protects</em>.\" <em>(voice cracking slightly on the last word)</em></li>\n<li>\"The Festival of Joy will proceed as SCHEDULED. Attendance is MANDATORY. Happiness is DUTY. I will not hear otherwise. I will NOT.\" <em>(slamming fist on desk, rattling his collection of polished medals)</em></li>\n<li>\"You are Inquisitorial agents. Good. GOOD. Then you understand discipline. You understand order. You understand that a population must be MANAGED. These people — they do not know what is good for them. <em>I</em> know. I have <em>always</em> known.\" <em>(desperate sincerity)</em></li>\n<li>\"Report... unhappiness?\" <em>(very quietly, staring at nothing)</em> \"No. No. There is no unhappiness. There is no unhappiness in Fortress Vallak. There <em>cannot</em> be.\" <em>(then, louder)</em> \"NEXT ITEM ON THE AGENDA!\"</li>\n<li>\"My father held this post. His father before him. They kept the walls standing. They kept the people <em>alive</em>. That is what I do. That is ALL I do. And when I am gone, someone else will do it, and the walls will STILL stand. Do you understand? The walls will <em>always</em> stand.\" <em>(pleading, not commanding)</em></li>\n</ul>\n<h2>What He Wants</h2>\n<p>Control. Normalcy. Proof that his methods work. Vallakovich wants the Acolytes to validate him — to attend the festival, to praise his leadership, to confirm that the Inquisition endorses his approach. He wants to be told that he is doing the right thing, because no one has told him that in a very long time.</p>\n<h2>What He Fears</h2>\n<p>Everything. The fog. Strahd. His own people. The possibility that his festivals are meaningless rituals performed for no one. The possibility that Lady Wachter is right. The possibility that order cannot be maintained. The possibility that he will die, and his death will mean nothing, and the fog will swallow Fortress Vallak as though he had never existed.</p>\n<h2>Reactions</h2>\n<table>\n<thead>\n<tr><th>Stimulus</th><th>Response</th></tr>\n</thead>\n<tbody>\n<tr><td><strong>Respect / Support</strong></td><td>Vallakovich blooms. He becomes almost likeable — expansive, generous, eager to help. He assigns the Acolytes quarters, offers resources from the garrison armory, and parades them before the citizens as proof of Imperial endorsement. He is desperate for allies.</td></tr>\n<tr><td><strong>Defiance / Criticism</strong></td><td>The mask hardens. He becomes cold, officious, and threatens arrest. He dispatches Izek to \"monitor\" the Acolytes. If pushed further, he orders their confinement. He cannot tolerate dissent because dissent proves his system does not work.</td></tr>\n<tr><td><strong>Questions about Strahd</strong></td><td>Immediate deflection. \"The Lord-Governor is not a topic for public discussion. ALL IS WELL.\" Privately, if pressed: genuine terror. He knows what Strahd is. He has always known. He simply refuses to say it aloud.</td></tr>\n<tr><td><strong>Displays of Faith</strong></td><td>Genuine, if performative, enthusiasm. Vallakovich clings to the Imperial Creed as another pillar of order. He will eagerly support the chapel of Saint Andral and any Acolyte who demonstrates piety — not necessarily from faith, but from a desperate need for any system that promises the darkness can be held back.</td></tr>\n<tr><td><strong>Evidence of his failure</strong></td><td>Two possible responses (GM choice based on approach): he either breaks down — a quiet, shattered man who finally admits \"I know. I have always known. But what else was I supposed to do?\" — or he doubles down harder, escalating to martial law and mass detentions. The former is more tragic; the latter is more dangerous.</td></tr>\n<tr><td><strong>Lady Wachter mentioned</strong></td><td>His face darkens instantly. He suspects her of sedition (correctly) but has never been able to prove it. He will rant about her disloyalty, her \"treasonous salons,\" and her \"poisonous influence\" at length. He may ask the Acolytes to investigate her — an ironic request that might actually serve the Imperium's interests.</td></tr>\n</tbody>\n</table>"
                },
                "_id": "npc08roleplay001"
            },
            {
                "name": "GM Reference",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Story Role &amp; Plot Connections</h2>\n<p>Vallakovich is the first major political challenge the Acolytes face on Barovus. He controls the largest settlement, the only functional garrison, and the closest thing to a safe haven the Acolytes will find. Removing him has consequences. Supporting him has consequences. Both options are morally compromised. This is the point.</p>\n<h3>Key Scenes</h3>\n<ul>\n<li><strong>The Festival of Joy:</strong> A grotesque mandatory celebration. Forced singing, regimented dancing, PDF soldiers monitoring enthusiasm. The sun effigy is set alight. The Acolytes' reaction to this spectacle shapes their relationship with Vallakovich for the rest of the campaign.</li>\n<li><strong>The Bones of Saint Andral:</strong> The chapel's holy relics have been stolen. Recovering them is critical for maintaining Fortress Vallak's one genuine sacred site. Vallakovich may or may not cooperate depending on whether the investigation threatens his authority.</li>\n<li><strong>Fiona's Coup:</strong> If the Acolytes destabilise Vallakovich's control (or if Fiona finds her opportunity), the coup erupts. Vallakovich retreats to the administratum. Izek leads the loyalist PDF. The town descends into civil conflict.</li>\n<li><strong>The Breaking Point:</strong> A private scene where Vallakovich drops the mask. This can be triggered by catastrophic failure of a festival, loss of the Saint Andral bones, or a sufficiently skilled social approach. How the Acolytes handle this moment is one of the campaign's defining character tests.</li>\n</ul>\n<h3>Relationships</h3>\n<table>\n<thead>\n<tr><th>NPC</th><th>Relationship</th></tr>\n</thead>\n<tbody>\n<tr><td><strong>Izek Strazni</strong></td><td>His enforcer, bodyguard, and the real source of his power. Izek is brutal, warp-mutated (fire-generating left arm), and disturbingly obsessed with Ireena Kolyana (commissions dolls in her likeness). Without Izek, Vallakovich has no teeth.</td></tr>\n<tr><td><strong>Lady Fiona Wachter</strong></td><td>His nemesis. He suspects her of sedition but cannot prove it. Their mutual hostility is Fortress Vallak's central political tension.</td></tr>\n<tr><td><strong>Father Lucian</strong></td><td>Respectful but strained. Lucian provides spiritual legitimacy; Vallakovich provides secular protection. Each needs the other; neither trusts the other entirely.</td></tr>\n<tr><td><strong>Strahd</strong></td><td>Abject terror, never spoken aloud. Vallakovich knows what Strahd is. He refuses to acknowledge it. Strahd, for his part, is amused by Vallakovich's desperate pageantry.</td></tr>\n<tr><td><strong>The Acolytes</strong></td><td>Potential allies or dangerous destabilisers. He will attempt to co-opt them. If that fails, he treats them as threats to order.</td></tr>\n</tbody>\n</table>\n<h3>The Stability Tracker</h3>\n<p>Fortress Vallak's political health is tracked by a <strong>Stability score</strong> (starts at 50). Key modifiers:</p>\n<table>\n<thead>\n<tr><th>Event</th><th>Stability Change</th></tr>\n</thead>\n<tbody>\n<tr><td>Festival proceeds undisrupted</td><td>+5</td></tr>\n<tr><td>Festival disrupted</td><td>-10</td></tr>\n<tr><td>Bones of St. Andral recovered</td><td>+10</td></tr>\n<tr><td>Chapel attacked</td><td>-15</td></tr>\n<tr><td>Acolytes publicly support Vallakovich</td><td>+5</td></tr>\n<tr><td>Acolytes publicly defy Vallakovich</td><td>-5</td></tr>\n<tr><td>Fiona's coup succeeds</td><td>-20</td></tr>\n<tr><td>Both leaders removed</td><td>-25</td></tr>\n</tbody>\n</table>\n<p>Below 20: open conflict. Below 0: settlement falls, no longer a safe haven.</p>\n<h2>Mechanical Notes</h2>\n<p>Vallakovich is a <em>non-combatant</em>. Use a modified Imperial Commander profile if stats are needed. He will not fight personally; he orders Izek and the PDF to fight for him. His mechanical relevance is entirely political — he controls access to the garrison armory, the vox-caster network, and the town's resources.</p>\n<p><strong>Izek Strazni</strong> (his enforcer) is the real combat threat: use a heavily modified Mutant profile with WS 50, S 50, T 45, Ag 35, WP 30. His warp-fire arm functions as a Hand Flamer with unlimited ammunition (1d10+4 E, Pen 2, Flame, range 10m). He also carries a great weapon (2d10+5 R, Pen 2). He has the Fear (1) trait due to his grotesque arm.</p>\n<h2>Skill Tests</h2>\n<table>\n<thead>\n<tr><th>Situation</th><th>Test</th><th>Difficulty</th><th>Notes</th></tr>\n</thead>\n<tbody>\n<tr><td>Gaining Vallakovich's trust</td><td><em>Fellowship</em> or <em>Charm</em></td><td>Ordinary (+10)</td><td>Easier if supporting his festivals; harder if questioning his methods</td></tr>\n<tr><td>Persuading him to share garrison resources</td><td><em>Commerce</em> or <em>Fellowship</em></td><td>Challenging (+0)</td><td>Requires trust or Inquisitorial authority invoked</td></tr>\n<tr><td>Getting him to admit his methods are failing</td><td><em>Charm</em> or <em>Intimidate</em></td><td>Hard (-20)</td><td>Success triggers his \"breaking point\" scene</td></tr>\n<tr><td>Convincing him Lady Wachter is a cultist</td><td><em>Inquiry</em> or <em>Logic</em></td><td>Challenging (+0)</td><td>He wants to believe this; needs concrete evidence to act</td></tr>\n<tr><td>Preventing him from arresting the Acolytes</td><td><em>Intimidate</em> or <em>Command</em></td><td>Challenging (+0)</td><td>Invoking Inquisitorial authority grants +20</td></tr>\n<tr><td>Reading his emotional state beneath the bluster</td><td><em>Scrutiny</em></td><td>Ordinary (+10)</td><td>The cracks are visible to anyone who looks</td></tr>\n</tbody>\n</table>\n<h2>Items &amp; Resources</h2>\n<ul>\n<li><strong>Garrison Armory Access:</strong> With Vallakovich's permission: limited military-grade ammunition (las and autogun), basic flak armour, 1d5 frag grenades per visit. Requires <strong>Commerce or Fellowship</strong> Test.</li>\n<li><strong>Vox-Caster Network:</strong> Vallakovich controls the town's broadcast system. This can be used to rally citizens, issue warnings, or broadcast propaganda. Access requires his trust or seizing the administratum.</li>\n<li><strong>PDF Garrison:</strong> ~200 soldiers, poorly equipped (flak armour, lasguns, autoguns). They obey Vallakovich through Izek. If Vallakovich is removed, their loyalty fragments unless a strong replacement is installed quickly.</li>\n<li><strong>Festival Supplies:</strong> Ironically, the festival infrastructure includes fuel, construction materials, fabric, and tools that could be repurposed for practical use if the festivals are ended.</li>\n</ul>\n<h2>Common GM Questions</h2>\n<h3>Should Vallakovich be played sympathetically or as a villain?</h3>\n<p>Sympathetically. He is not evil. He is a desperate man whose coping mechanism has become a system of oppression. The horror is that he is <em>trying his best</em>. Play the festivals for dark comedy at first, then let the horror creep in as the Acolytes see what happens to dissenters. The Acolytes should feel conflicted, not righteous, when dealing with him.</p>\n<h3>What happens if the Acolytes just kill Vallakovich?</h3>\n<p>Izek goes berserk. The PDF splinters. Fortress Vallak's Stability drops by 25 immediately. If no one fills the power vacuum, Fiona steps in within days. Killing Vallakovich is easy; dealing with the aftermath is the hard part.</p>\n<h3>Can Vallakovich be redeemed?</h3>\n<p>Partially. If the Acolytes reach his \"breaking point\" and handle it with compassion rather than contempt, Vallakovich can be convinced to ease the festivals, release political prisoners, and cooperate with more humane governance. He will never fully abandon his need for control, but he can be guided toward less destructive expressions of it. This is the best possible outcome for Fortress Vallak under his rule.</p>\n<h3>How does Izek's Ireena obsession play out?</h3>\n<p>If the Acolytes bring Ireena to Fortress Vallak, Izek recognises her immediately as the woman he has been carving dolls of his entire life. His reaction is unpredictable — he may try to kidnap her, protect her, or simply stare with unsettling intensity. The reason for his obsession is left deliberately ambiguous: past-life connection, psychic resonance, or the warp's cruelty. Regardless, it makes any confrontation with Vallakovich's faction exponentially more complicated if Ireena is present.</p>"
                },
                "_id": "npc08gmreference"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "role": "political-npc"
            }
        }
    },
    {
        "name": "Lady Fiona Wachter",
        "pages": [
            {
                "name": "Profile",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<blockquote><p>The woman who greets you at the door of Wachterhaus is not what you expected. Where Vallakovich is loud and blustering, Lady Wachter is composed, measured, and impeccably dressed in the faded finery of Barovian high society — a gown of dark velvet with silver embroidery at the cuffs, her silver hair pinned beneath a lace veil that might have been fashionable on any civilised Imperial world. Her eyes are dark, intelligent, and miss absolutely nothing.</p><p>She smells faintly of amasec and something else — something chemical, astringent, that you cannot immediately place. Embalming fluid, your training suggests. You file this observation and accept her offered hand.</p><p>\"Inquisitorial agents,\" she says, her voice warm and reasonable and perfectly pitched to inspire trust. \"Thank the Throne you have come. Fortress Vallak is in desperate need of rational minds. Please — sit. Let us discuss the Burgomaster's... excesses. I believe we share common concerns.\"</p></blockquote>\n<h2>Key Facts</h2>\n<table>\n<thead>\n<tr><th>Detail</th><th>Information</th></tr>\n</thead>\n<tbody>\n<tr><td><strong>Role</strong></td><td>Antagonist NPC / False Ally / Secret Cultist</td></tr>\n<tr><td><strong>Location</strong></td><td>Wachterhaus, Fortress Vallak (Location 1)</td></tr>\n<tr><td><strong>Threat Level</strong></td><td>Non-combatant personally; controls The Devoted (cult cell of ~12 cultists)</td></tr>\n<tr><td><strong>Allegiance</strong></td><td>Strahd / Slaanesh (secret); presents as loyal Imperial citizen</td></tr>\n<tr><td><strong>Psy Rating</strong></td><td>1 (minor Telepathy or Dominate)</td></tr>\n<tr><td><strong>Key Items</strong></td><td>Cult ritual materials, warp-stasis device (preserving dead husband), political intelligence network</td></tr>\n</tbody>\n</table>\n<h2>Background</h2>\n<p><strong>Lady Fiona Wachter</strong> is the matriarch of one of Fortress Vallak's oldest noble families and, secretly, the leader of a Chaos cult devoted to Strahd and the Dark Gods. She is not the raving, mutation-riddled cultist of Imperial stereotype. She is something far more insidious: a true believer in the philosophy of submission to the inevitable. She worships Strahd not as a daemon or a monster but as the rightful sovereign of Barovus, chosen by powers greater than the God-Emperor. In her view, the Imperium is gone, the Emperor's light does not reach this world, and Strahd is eternal. The only rational response is to serve.</p>\n<p>She has maintained her cult — a cell of devotees called <strong>\"The Devoted\"</strong> — for decades, meeting in the hidden cellar beneath her estate for rituals that are part séance, part political meeting, and part genuine warp-communion. The Devoted number approximately a dozen citizens of Fortress Vallak: merchants, minor functionaries, a PDF soldier or two. They are not powerful. They are patient. And they are waiting for the right moment to act.</p>\n<p>Fiona's plan is simple: overthrow Vallakovich, install herself as Burgomaster, and open Fortress Vallak's gates to Strahd's direct rule. She believes this will bring order and an end to suffering. She is wrong, but her arguments are dangerously reasonable, especially to Acolytes who have witnessed Vallakovich's cruelties firsthand. Everything she tells the Acolytes about the Burgomaster's tyranny will be true. Everything she tells them about her own intentions will be a lie.</p>\n<h2>Appearance &amp; Demeanour</h2>\n<p>A handsome woman in her sixties, impeccably dressed, with silver hair arranged in an elaborate style and dark eyes that miss nothing. She radiates competence and quiet authority — the kind of woman who commands a room not by raising her voice but by making everyone else lower theirs. She smells of amasec and embalming fluid, the latter because she keeps her dead husband's body preserved in a bedroom of Wachterhaus via a warp-stasis device, speaking to it nightly as though he were merely sleeping.</p>\n<p>Her demeanour is cultured, reasonable, and persuasive. She sounds more sane than Vallakovich. This is the danger. She presents herself as a concerned citizen, a political moderate, a voice of reason in a town choking on mandatory joy. Every word is calculated, every gesture rehearsed, every offer of help a thread in a web that leads back to Strahd.</p>"
                },
                "_id": "ceef564345d0417b"
            },
            {
                "name": "Roleplaying Guide",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Personality Core</h2>\n<p><strong>Lady Wachter</strong> is everything Vallakovich is not: calm, composed, patient, and genuinely dangerous. Where the Burgomaster rules through bluster and denial, Fiona operates through intelligence, manipulation, and the long game. She has been running her cult for decades. She has been planning her coup for years. She is not impulsive. She does not make mistakes. She makes <em>investments</em>.</p>\n<p>Her faith in Strahd is absolute, but it is not the mad devotion of Baba Lysaga. It is philosophical. She has observed the world she lives in and drawn what she considers the only logical conclusion: the Emperor's light does not reach Barovus, the Imperium will never rescue them, and Strahd is the only power that endures. Serving him is not betrayal — it is pragmatism. She genuinely believes that Fortress Vallak would be better off under Strahd's direct rule, with herself as his instrument. The suffering would end. The festivals would stop. The people would have purpose.</p>\n<p>That she is wrong — that Strahd's direct rule would bring a different and deeper horror — does not occur to her, because she has never witnessed it. She sees Strahd's distant, indifferent governance and imagines it refined into something efficient and stable. She is, in her own way, as deluded as Vallakovich. But her delusion is far more dangerous because it is dressed in the clothing of reason.</p>\n<h2>Voice &amp; Mannerisms</h2>\n<p>Fiona speaks in measured, elegant sentences. She never raises her voice. She uses pauses deliberately, letting silence do the work of emphasis. Her vocabulary is educated, her tone sympathetic, and her arguments structured with the precision of a legal case. She touches her interlocutor's arm at calculated moments. She offers amasec from a crystal decanter. She creates an atmosphere of civilised discourse that makes Vallakovich's shouting feel crude by comparison.</p>\n<p>Her one tell — detectable only by a perceptive observer (<strong>Hard (-20) Scrutiny</strong>) — is a faint tightening around her eyes when she speaks of the Emperor or the Imperium. It is gone in an instant, replaced by the appropriate expression of pious loyalty, but it is there.</p>\n<p><strong>Example Quotes:</strong></p>\n<ul>\n<li>\"The Burgomaster means well. I truly believe that. But meaning well and <em>doing</em> well are not the same thing, are they? How many must suffer for his delusions before someone acts?\" <em>(leaning forward, voice intimate and concerned)</em></li>\n<li>\"I am not asking you to betray anyone. I am asking you to <em>see</em>. Open your eyes. Look at what Vallakovich has done to this town. Is this the Emperor's will? Is this the Imperium you serve?\" <em>(measured, persuasive, almost gentle)</em></li>\n<li>\"Strahd is a fact of existence on Barovus. One does not rage against gravity. One learns to build on stable ground.\" <em>(this is the closest she comes to revealing her true allegiance in casual conversation)</em></li>\n<li>\"My husband rests upstairs. He was a good man. A <em>loyal</em> man. He understood that survival sometimes requires... accommodation.\" <em>(eyes distant for a moment, then sharp again)</em></li>\n<li>\"You are agents of the Inquisition. Formidable. Principled. Exactly the kind of people who could change things in Fortress Vallak. The question is: will you change them for the better, or will you leave and let the rot continue?\" <em>(laying the trap with absolute sincerity)</em></li>\n</ul>\n<h2>What She Wants</h2>\n<p>Fiona wants to overthrow Vallakovich, install herself as Burgomaster, and bring Fortress Vallak under Strahd's direct governance. She wants the Acolytes to do the hard work for her — destabilise Vallakovich, discredit his regime, create the chaos she needs to launch her coup. She will offer them everything they need: intelligence, resources, safe haven, political support. All she asks in return is that they deal with the Burgomaster. What happens afterward is, she implies, a conversation for later.</p>\n<h2>What She Fears</h2>\n<p>Exposure. Fiona's greatest fear is that her cult is discovered before she is ready to act. She has spent decades building The Devoted in secrecy, and premature exposure would mean her execution and the destruction of everything she has worked for. She also fears, on a deeper level, that Strahd does not value her as highly as she believes — that she is a tool, not a chosen servant. This fear she buries deep and never acknowledges, even to herself.</p>\n<h2>Reactions</h2>\n<table>\n<thead>\n<tr><th>Stimulus</th><th>Response</th></tr>\n</thead>\n<tbody>\n<tr><td><strong>Respect / Agreement</strong></td><td>She deepens the relationship. More invitations, more intelligence, more intimacy. She feeds the Acolytes accurate information about Vallakovich's failings, building trust. She is generous with resources — amasec, comfortable quarters, introductions to useful contacts. Every kindness is a hook.</td></tr>\n<tr><td><strong>Suspicion / Probing Questions</strong></td><td>She deflects with grace. \"You are cautious. I admire that in Inquisitorial agents.\" She answers honestly where she can and lies seamlessly where she must. She does not become defensive — defensiveness implies guilt. She remains open, reasonable, and utterly opaque.</td></tr>\n<tr><td><strong>Questions about Strahd</strong></td><td>Careful neutrality with a deliberate undercurrent. \"The Lord-Governor is... a complex figure. Not the monster the stories suggest. Certainly not the saviour either. But he is <em>real</em>, and the Emperor's legions are not. One must be practical.\" She gauges the Acolytes' reactions to this carefully, adjusting her approach based on what she reads.</td></tr>\n<tr><td><strong>Displays of Faith</strong></td><td>Performative agreement masking genuine contempt. She will mouth the correct prayers, display the correct icons, and express the correct sentiments. It is all hollow, and a <strong>Hard (-20) Scrutiny</strong> Test will detect the falseness. Her Psy Rating 1 ward inflicts 1d5 Corruption Points on any psyker who attempts to read her thoughts.</td></tr>\n<tr><td><strong>Direct Accusation of Heresy</strong></td><td>If exposed, she does not panic. Her composure holds. She evaluates the situation in an instant: if escape is possible, she activates her coup early and flees in the chaos. If cornered, she fights with The Devoted. She will never confess. She will never recant. She believes she is right.</td></tr>\n<tr><td><strong>Mention of her dead husband</strong></td><td>The only topic that genuinely unsettles her. Her composure flickers — not much, but enough for a perceptive observer to notice. She changes the subject quickly. The preserved body upstairs is the one thing she cannot explain rationally, because it is not rational. It is grief.</td></tr>\n</tbody>\n</table>"
                },
                "_id": "npc09roleplay001"
            },
            {
                "name": "Plot Connections",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Story Role</h2>\n<p>Lady Wachter is the <strong>false ally</strong> — the most politically dangerous NPC in Fortress Vallak and one of the most insidious antagonists in the campaign. Her function is to present the Acolytes with a choice that <em>appears</em> to be between bad (Vallakovich) and better (Wachter), when in reality it is a choice between bad and worse. She is the serpent in the garden, and her weapon is not psychic power or military force but <em>reasonableness</em>.</p>\n<h2>Key Scenes</h2>\n<h3>1. The Introduction</h3>\n<p>Fiona approaches the Acolytes shortly after their arrival in Fortress Vallak, presenting herself as a concerned citizen and political moderate. She criticises Vallakovich's excesses accurately, offers sympathy for the common people seemingly genuinely, and provides the Acolytes with safe haven, contacts, and intelligence. This meeting should feel like a breath of fresh air after dealing with Vallakovich's bluster.</p>\n<h3>2. The Seduction</h3>\n<p>Over several interactions, Fiona builds trust. She provides accurate intelligence about the town's power dynamics, the Saint Andral bones situation, Van Richten's possible location, and Strahd's recent movements. Everything she offers is genuinely useful. She asks for nothing in return — at first. Then, gradually, she begins to suggest that Vallakovich is the real problem. That the town would be better off without him. That the Acolytes, as agents of the Inquisition, have the authority to remove a failing commander.</p>\n<h3>3. The Discovery</h3>\n<p>Three paths lead to Fiona's secret:</p>\n<ul>\n<li><strong>Investigation:</strong> Infiltrating Wachterhaus and finding the hidden cellar. <strong>Hard (-20) Security</strong> to bypass locks, or <strong>Challenging (+0) Awareness</strong> to notice the concealed entrance.</li>\n<li><strong>Informants:</strong> The Martikovs suspect Fiona of dark dealings. Extended investigation via three successful <strong>Inquiry</strong> Tests over several in-game days can identify Devoted members, who can then be interrogated.</li>\n<li><strong>Psychic Probing:</strong> A psyker Acolyte reading her surface thoughts must win an <strong>Opposed Willpower</strong> Test (Fiona has WP 45). Failure inflicts 1d5 Corruption Points from her minor ward.</li>\n</ul>\n<h3>4. The Coup</h3>\n<p>If the Acolytes ally with Fiona, or if they create enough chaos for her to exploit, she launches her coup. The Devoted seize key positions while Fiona confronts Vallakovich in the administratum. The outcome depends entirely on the Acolytes' involvement and choices.</p>\n<h2>Relationships</h2>\n<table>\n<thead>\n<tr><th>NPC</th><th>Relationship</th></tr>\n</thead>\n<tbody>\n<tr><td><strong>Strahd</strong></td><td>Worships him as a god-figure. She believes she is his chosen instrument on the ground level. Strahd tolerates her devotion because it flatters him and because she is useful. He does not value her as a person.</td></tr>\n<tr><td><strong>Vallakovich</strong></td><td>Loathes him. Views his regime as incompetent tyranny that causes unnecessary suffering. Her contempt is genuine; her concern for the people suffering under him is not entirely feigned.</td></tr>\n<tr><td><strong>The Devoted</strong></td><td>Her cult cell. ~12 citizens (merchants, minor functionaries, 1-2 PDF soldiers) who meet in the Wachterhaus cellar. Equipped as Cultists with flak armour and stub revolvers. Patient, loyal, and waiting.</td></tr>\n<tr><td><strong>Her Dead Husband</strong></td><td>Preserved via warp-stasis in her bedroom. She speaks to him nightly. This is her one genuinely human quality — grief that she cannot let go of, even as it manifests in something deeply disturbing.</td></tr>\n<tr><td><strong>Karl and Nikolai (sons)</strong></td><td>Unwitting pawns. She has kept them ignorant of her cult activities. They are dissolute young men, unremarkable except as leverage: threatening her sons is one of the few things that might crack her composure.</td></tr>\n<tr><td><strong>The Martikovs</strong></td><td>Mutual suspicion. The Martikovs sense something wrong about Fiona but lack proof. They will share their suspicions with trusted Acolytes.</td></tr>\n<tr><td><strong>Izek Strazni</strong></td><td>An obstacle to be removed. She has attempted to recruit Izek and failed. His loyalty to Vallakovich is one of the few things she cannot work around.</td></tr>\n</tbody>\n</table>\n<h2>Quest Hooks</h2>\n<ul>\n<li><strong>\"Deal with Vallakovich\":</strong> Fiona's primary request. She wants the Acolytes to remove the Burgomaster, by any means. She frames this as serving the Imperium. It is, in fact, serving Chaos.</li>\n<li><strong>\"Investigate the Wachterhaus Cellar\":</strong> Whether directed by the Martikovs, Van Richten, or their own suspicions, the Acolytes may investigate Fiona's estate. Finding the hidden cellar and its ritual paraphernalia is the most direct path to exposing her.</li>\n<li><strong>\"The Preserved Husband\":</strong> A disturbing discovery that raises questions even before the cult is found. How is a body being preserved via warp-stasis in a noblewoman's bedroom? What else is she hiding?</li>\n<li><strong>\"Turn an Informant\":</strong> If a Devoted member is identified and captured, they can be turned with the right approach (Interrogation, Charm, or threats). This provides intelligence on Fiona's plans and the cult's membership.</li>\n</ul>\n<h2>Possible Outcomes</h2>\n<ul>\n<li><strong>Fiona's Coup Succeeds:</strong> She becomes Burgomaster. The festivals end. The oppression lifts — briefly. Within days: Strahd's symbols appear alongside Imperial aquilas, The Devoted recruit openly, and \"voluntary communion sessions\" begin. Fortress Vallak slides toward open Chaos worship. Stability drops by 20. This is the worst political outcome.</li>\n<li><strong>Fiona Exposed and Arrested:</strong> Vallakovich is vindicated. The Devoted are purged. Fortress Vallak's Stability gains +5 in the short term, but Vallakovich's paranoia intensifies. He begins seeing heresy everywhere — including in the Acolytes, if they ever showed Fiona any sympathy.</li>\n<li><strong>Fiona Exposed and Escapes:</strong> She flees Fortress Vallak with loyal Devoted members. She becomes a recurring antagonist, potentially allying with Strahd's forces directly. She may reappear during Act III as part of the Spire's defences.</li>\n<li><strong>Fiona Killed:</strong> Her sons inherit Wachterhaus and discover the cellar. Their reaction depends on their characterisation (GM's choice): horror and cooperation with the Acolytes, or anger and a desire for revenge. The Devoted scatter without leadership.</li>\n<li><strong>Acolytes Unknowingly Aid Her:</strong> The most tragic outcome. The Acolytes remove Vallakovich believing they are doing the right thing, and Fiona steps into the power vacuum. They do not learn the truth until it is too late. This should be played as a devastating revelation.</li>\n</ul>"
                },
                "_id": "npc09plotconnect"
            },
            {
                "name": "GM Reference",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Mechanical Notes</h2>\n<p><strong>Lady Wachter</strong> uses a modified Cult Leader profile. She is not a combatant — her power is political, social, and informational. She has <em>Psy Rating 1</em> with minor psychic talent (Telepathy or Dominate at GM's discretion), which she uses subtly and rarely. Her WP of 45 includes a minor warp-ward that inflicts 1d5 Corruption Points on any psyker who attempts to read her mind.</p>\n<p><strong>The Devoted</strong> (her cult cell) are equivalent to standard Cultists with flak armour (AP 3 body) and stub revolvers (Pistol; 30m; S/3/—; 1d10+3 I; Pen 0). They number approximately 12 and will fight to the death for Fiona if the coup is activated. They are not skilled combatants but can be dangerous in numbers and in ambush.</p>\n<h2>Skill Tests</h2>\n<table>\n<thead>\n<tr><th>Situation</th><th>Test</th><th>Difficulty</th><th>Notes</th></tr>\n</thead>\n<tbody>\n<tr><td>Detecting her falseness during conversation</td><td><em>Scrutiny</em></td><td>Hard (-20)</td><td>She is an expert manipulator; the tell is a faint tightening around her eyes when speaking of the Emperor</td></tr>\n<tr><td>Bypassing Wachterhaus cellar locks</td><td><em>Security</em></td><td>Hard (-20)</td><td>High-quality locks; failure does not alert Fiona unless the attempt is loud</td></tr>\n<tr><td>Noticing the concealed cellar entrance</td><td><em>Awareness</em></td><td>Challenging (+0)</td><td>A draft from the hidden door, wear patterns on the floor</td></tr>\n<tr><td>Psychically reading her thoughts</td><td><em>Opposed Willpower</em></td><td>Opposed (her WP 45)</td><td>Failure inflicts 1d5 Corruption Points from her ward</td></tr>\n<tr><td>Identifying Devoted members through investigation</td><td><em>Inquiry</em> (Extended)</td><td>Challenging (+0)</td><td>Three successes required over several in-game days</td></tr>\n<tr><td>Interrogating a captured Devoted member</td><td><em>Interrogation</em> or <em>Intimidate</em></td><td>Challenging (+0)</td><td>They are fanatical but not trained to resist; +10 if evidence of Fiona's cult is shown to them</td></tr>\n<tr><td>Persuading Fiona to reveal information willingly</td><td><em>Charm</em> or <em>Deceive</em></td><td>Very Hard (-30)</td><td>She reveals nothing that does not serve her agenda; success yields carefully curated half-truths</td></tr>\n<tr><td>Resisting her persuasion to act against Vallakovich</td><td><em>Willpower</em> or <em>Logic</em></td><td>Challenging (+0)</td><td>Her arguments are genuinely compelling; this test represents recognising the manipulation, not disagreeing with the facts</td></tr>\n</tbody>\n</table>\n<h2>Items &amp; Resources</h2>\n<ul>\n<li><strong>Wachterhaus:</strong> A nobleman's estate with comfortable quarters, a well-stocked wine cellar (amasec reserves), a library of Barovian history, and the hidden cult cellar beneath. The cellar contains ritual paraphernalia (Slaaneshi symbols, warp-touched candles, a communion circle etched into the floor), a cache of weapons for The Devoted, and coded correspondence with Strahd's agents.</li>\n<li><strong>Warp-Stasis Device:</strong> The device preserving her husband's body is a genuine piece of technology, likely pre-rift. It could theoretically be repurposed by a Tech-Use-skilled Acolyte, though removing it would be noticed.</li>\n<li><strong>Political Intelligence:</strong> Fiona has a comprehensive understanding of Fortress Vallak's power structure: who is loyal to Vallakovich, who is wavering, where the garrison's weak points are, and which citizens can be turned. She shares this information freely if it serves her agenda.</li>\n<li><strong>Cult Ritual Materials:</strong> If recovered, these provide evidence of Chaos worship sufficient to justify execution under Imperial law. They also provide +10 to <strong>Forbidden Lore (Warp)</strong> Tests related to Slaaneshi rituals and Strahd's cult of personality.</li>\n</ul>\n<h2>Common GM Questions</h2>\n<h3>How long should Fiona's deception last?</h3>\n<p>As long as possible. The most impactful version of this storyline is one where the Acolytes genuinely trust Fiona, act on her intelligence, and only discover her true nature after they have already destabilised Vallakovich's regime. Resist the temptation to telegraph her villainy. Play her as the most helpful, reasonable NPC in Fortress Vallak. The revelation should be a gut-punch.</p>\n<h3>What if the Acolytes never investigate her?</h3>\n<p>Fiona acts on her own timeline. If the Acolytes create enough instability (disrupting the festival, failing to recover the Saint Andral bones, openly defying Vallakovich), she launches her coup regardless of whether the Acolytes are involved. The coup becomes a chaotic event the Acolytes must react to rather than one they orchestrated.</p>\n<h3>Can Fiona be turned or redeemed?</h3>\n<p>No. Her faith in Strahd is genuine, deep-rooted, and decades old. She is not a reluctant cultist or a woman who was tricked into Chaos worship. She chose this path with open eyes and a clear mind. She can be defeated, exposed, or killed, but she cannot be talked out of her beliefs. Attempts to do so will simply convince her that the Acolytes are naive.</p>\n<h3>How should the dead husband be handled?</h3>\n<p>The preserved husband is a detail that should emerge gradually. Perhaps a locked bedroom door that Fiona deflects questions about. Perhaps a servant's nervous glance. Perhaps a faint smell of preserving chemicals in the upstairs corridor. When the Acolytes finally see the body — perfectly preserved, dressed in formal attire, seated in a chair by the window as though watching the street — it should be deeply unsettling. It humanises Fiona even as it marks her as disturbed. She loved this man. She could not let him go. This is the seed from which her entire descent into Chaos worship grew.</p>\n<h3>What does Strahd think of Fiona?</h3>\n<p>He tolerates her devotion because it flatters him and because she is useful. He does not consider her important. If she succeeds in her coup, he will use Fortress Vallak as a more directly controlled asset. If she fails, he will not mourn her. Fiona does not know this, and learning it would shatter her. This knowledge could theoretically be weaponised by the Acolytes, but using it would require either Strahd's cooperation (unlikely) or evidence from his communications (potentially available via Van Richten's intelligence or the Tome of Strahd).</p>"
                },
                "_id": "npc09gmreference"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "role": "antagonist-npc"
            }
        }
    }
]