[
    {
        "name": "Death on Barovus — Resurrection and Replacement",
        "pages": [
            {
                "name": "Rules",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<div class=\"doz-vox-transmission\"><div class=\"vox-header\">CAMPAIGN RULES — DEATH AND RESURRECTION ON BAROVUS</div><div class=\"vox-body\"><h2>Death on Barovus</h2><p>Death in the Imperium is a certainty. Death on Barovus is a <em>complication.</em></p><p>The warp rift that seals Barovus does not merely trap the living — it recycles them. Souls that would normally pass into the Emperor's light (or the hungering maw of the Immaterium) are instead caught in the rift's currents, tumbled through the raw stuff of Chaos, and deposited back into their broken bodies like coins dropped into a collection plate. Slaanesh feeds on the despair of this cycle — the moment of death, the horror of return, and the dawning realisation that even oblivion has been denied.</p><p>Barovus does not let its victims go. Not easily. Not cleanly. And never without cost.</p><p>The Game Master should use this mechanic <strong>sparingly and deliberately</strong>. Player character death should be dramatic, meaningful, and consequential — not trivialised by easy resurrection. Each return from death should feel <em>wrong</em>, and the accumulating costs should make the players dread it even as they rely on it.</p><h3>The Warp Reclamation</h3><p>When an Acolyte dies on Barovus, their soul is caught by the warp rift before it can pass beyond. Slaanesh — the Daemon Prince who sustains Strahd's pact — intercepts the departing spirit and forces it back into the broken body. This is not a mercy. It is a predator's game of catch-and-release, designed to maximise suffering and corruption.</p><p>The Acolyte returns to life after <strong>1d10 rounds</strong> (or at a dramatically appropriate moment, at the GM's discretion). They awaken at <strong>1 Wound</strong>, <strong>prone</strong>, and <strong>Stunned for 1 round</strong>. The return is not gentle — the body bears new scars, and the mind bears worse.</p><h3>Resurrection Cost Table</h3><table><thead><tr><th>Death</th><th>Corruption</th><th>Insanity</th><th>Equipment Loss</th><th>Additional Effect</th></tr></thead><tbody><tr><td><strong>1st</strong></td><td>1d10 CP</td><td>1d10 IP</td><td>The weapon used in the killing blow is destroyed (dissolved by warp energy during reclamation)</td><td>The Acolyte hears Slaanesh's whisper for 1d5 days afterward (<strong>−5 to Willpower Tests</strong>)</td></tr><tr><td><strong>2nd</strong></td><td>2d10 CP</td><td>2d10 IP</td><td>All carried gear is lost (scattered across the warp, deposited in random locations on Barovus)</td><td>The Acolyte develops a <strong>Minor Mutation</strong> (roll on the Mutation Table)</td></tr><tr><td><strong>3rd</strong></td><td>3d10 CP</td><td>3d10 IP</td><td>All gear is lost; starting equipment only</td><td>The Acolyte develops a <strong>Major Mutation</strong> (roll on the Mutation Table) and permanently loses <strong>1d5 from a random Characteristic</strong></td></tr><tr><td><strong>4th+</strong></td><td>—</td><td>—</td><td>—</td><td><strong>Permanent death.</strong> The soul is claimed by Slaanesh. The body does not return. The Prince of Pleasure has finished playing.</td></tr></tbody></table><p><em><strong>Designer's Note:</strong> The escalating corruption from resurrection is itself a form of slow death. An Acolyte who dies twice has accumulated enough Corruption and Insanity Points to push them toward mutation and madness even before counting any points gained through play. The system is intentionally designed so that death is survivable but cumulative — each return brings the Acolyte closer to a state where they are no longer fit to serve the Emperor. This mirrors the campaign's central theme: Barovus corrodes everything it touches, including the hope of a clean ending.</em></p><h3>Strahd Knows</h3><p>Strahd von Zarovich is aware of <strong>every death and resurrection</strong> that occurs on his world. The warp rift is his domain; nothing passes through it without his knowledge. After each resurrection, Strahd <em>comments</em>. He does so through whatever medium is most unsettling: a servitor-skull that drifts to the recovering Acolyte and plays a recorded message, a handwritten note that materialises in the Acolyte's pocket, a psychic whisper delivered directly into the mind, or a personal visit if the timing is dramatically appropriate.</p><ul><li><strong>1st death:</strong> Genuine interest, almost admiration. <em>\"You survived the return. Most do not retain their sanity. I look forward to seeing what you do with your borrowed time.\"</em></li><li><strong>2nd death:</strong> Amusement tinged with contempt. <em>\"Again? The Prince of Pleasure grows fond of you. That should terrify you more than dying ever could.\"</em></li><li><strong>3rd death:</strong> Cold assessment. <em>\"You are becoming something other than what you were. I can smell the change. Do you still serve your Emperor, or does something else drive you now?\"</em></li><li><strong>4th death (final):</strong> Silence. Strahd says nothing. This is worse.</li></ul><h3>Replacement Acolytes</h3><p>If an Acolyte is permanently killed (or rendered unplayable by corruption/mutation), the player requires a new character. A secondary cell — <strong>Cell Sigma-Raven-IX-Beta</strong> — was dispatched aboard the <em>Dawn's Reproach</em> by Inquisitor Thorne as a contingency. Their ship was eventually drawn through the rift and crashed on Barovus.</p><ul><li>A maximum of <strong>two replacement Acolytes</strong> may be introduced during the campaign. After two replacements, permanent death is permanent.</li><li>Replacement Acolytes begin with <strong>starting equipment only</strong> — no relics, no recovered gear, no knowledge of Barovus.</li><li>Replacement Acolytes gain <strong>1d10 Corruption Points and 1d5 Insanity Points</strong> upon arrival. The crash and warp-exposure have already begun their work.</li></ul><p><em>See the companion pages for detailed guidance on running the death experience, introducing replacement characters, and GM advice for handling death at the table.</em></p></div></div>"
                },
                "_id": "02dd6eb01ab94cf3"
            },
            {
                "name": "The Death Experience",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>The Death Experience</h2><p>Death on Barovus is not a simple mechanical event — it is a narrative moment that should carry weight, horror, and consequence. Every time an Acolyte falls, the GM has an opportunity to reinforce the campaign's themes of corruption, despair, and the terrible cost of survival in a place where even the Emperor's light struggles to reach.</p><h3>What the Dying Acolyte Experiences</h3><p>The death vision is consistent in its broad strokes but should be personalised for each Acolyte and intensified with each successive death. The experience occurs in the space between heartbeats — subjectively, it feels like minutes; objectively, the body is dead for 1d10 rounds.</p><p>The sequence follows a pattern:</p><ol><li><strong>The Grey Void.</strong> The world drains of colour and substance. Not the grey of Barovus's ever-present fog — something deeper, something final. All sound ceases. Pain ceases. The Acolyte feels themselves lifted, drawn upward through layers of reality that peel apart like rotten cloth.</li><li><strong>The Emperor's Light.</strong> For a single, crystalline moment, the Acolyte sees the Emperor's light. It is distant — impossibly distant — a golden point at the end of an infinite corridor. They reach for it. They can feel its warmth, its promise of rest, of duty fulfilled, of an ending that means something.</li><li><strong>The Interception.</strong> Something catches them. Not hands — nothing so physical — but a <em>presence</em>, vast and warm and terrible, that wraps around the departing soul like a lover's embrace they never asked for. It smells of perfume and rot. It whispers their name with a voice like silk drawn across a blade.</li><li><strong>The Refusal.</strong> The golden light recedes. The grey rushes back. The presence speaks: <em>\"Not yet. You are still entertaining.\"</em></li><li><strong>The Return.</strong> Pain — exquisite, total, obscene — floods every nerve as the soul is forced back into broken meat. The Acolyte gasps. They scream. They are alive again, and they wish they were not.</li></ol><h3>Read-Aloud Text — The Death Vision</h3><p>When an Acolyte dies for the <strong>first time</strong>, read the following aloud to the player (and only that player, if possible — the other players should see the body fall and wait in silence):</p><blockquote><p>The world goes grey. Not the grey of the fog — something deeper, something final. You feel yourself lifted, pulled, drawn upward through layers of reality that peel apart like rotten cloth. For a moment — a single, crystalline moment — you see the Emperor's light. It is distant, impossibly distant, a golden point at the end of an infinite corridor. You reach for it.</p><p>Something catches you. Not hands — nothing so physical — but a <em>presence</em>, vast and warm and terrible, that wraps around your departing soul like a lover's embrace you never asked for. It smells of perfume and rot. It whispers your name with a voice like silk drawn across a blade.</p><p><em>\"Not yet,\"</em> it says. <em>\"You are still entertaining.\"</em></p><p>The golden light recedes. The grey rushes back. Pain — exquisite, total, obscene pain — floods every nerve as your soul is forced back into broken meat. You gasp. You scream. You are alive again, and you wish you were not.</p></blockquote><h3>The Choice</h3><p>Mechanically, the Warp Reclamation is automatic for the first three deaths — Slaanesh does not ask permission. However, the GM may choose to present the return as a <strong>perceived choice</strong> to heighten the drama. The Acolyte feels as though they could resist, could cling to the Emperor's light and refuse to return. In truth, they cannot — not for the first three deaths. The Prince of Pleasure is not done with them.</p><p>However, a player may <strong>choose to refuse resurrection</strong> at any point. If the player declares that their Acolyte rejects the return and clings to the Emperor's light, the character is permanently dead. Their soul is not claimed by Slaanesh — it escapes, borne away by faith and will. This is a noble death, and the GM should honour it as such. The player then rolls a replacement Acolyte (if replacements remain).</p><p>This choice should never be forced or suggested by the GM. It exists for players who feel their character's story has reached its natural end, or who find the mounting corruption and mutation too high a price to continue paying.</p><h3>Physical Signs of Return</h3><p>Each resurrection leaves visible marks on the Acolyte — signs that something unnatural has occurred. These marks are cumulative and cannot be healed or concealed by any means short of warp-craft.</p><table><thead><tr><th>Death</th><th>Physical Signs</th></tr></thead><tbody><tr><td><strong>1st</strong></td><td>The Acolyte's eyes carry a faint, iridescent sheen visible in dim light — like oil on water. Their skin is cold to the touch for 1d5 days. Dreams are vivid and disturbing (the whisper echoes). Psykers and individuals with the Psyniscience skill can detect a faint warp-taint (Ordinary +10 Psyniscience Test).</td></tr><tr><td><strong>2nd</strong></td><td>The iridescent sheen in the eyes becomes permanent. The Acolyte's voice carries a faint harmonic — a second tone, just below audibility, that makes listeners uneasy (−5 to Fellowship Tests with devout NPCs). Cold spots follow the Acolyte — rooms grow colder when they enter. Psykers detect a moderate warp-taint (Routine +20 Psyniscience).</td></tr><tr><td><strong>3rd</strong></td><td>In addition to the above: the Acolyte's shadow occasionally moves independently. Their blood runs a shade too dark, almost black. Animals react with fear or aggression. The warp-taint is obvious to any psyker without a test, and even mundane individuals feel deeply uneasy in the Acolyte's presence (−10 to Fellowship Tests with all NPCs except Chaos-aligned). The Major Mutation from the resurrection cost is also visible.</td></tr></tbody></table><h3>Narrative Beats — How Each Death Should Feel</h3><p>The tone of the death experience should escalate with each occurrence:</p><ul><li><strong>1st Death — Shock.</strong> This should be genuinely unsettling. The player did not expect this. The other players did not expect this. Play the vision straight, give it its full weight, and let the silence after the read-aloud text linger. When the Acolyte gasps back to life, the other characters should be horrified. This is not normal. This is not the Emperor's work. Something <em>wrong</em> just happened.</li><li><strong>2nd Death — Grim Acceptance.</strong> The vision is faster this time — the grey, the light, the interception, the return. The Slaaneshi presence is more familiar, almost casual. <em>\"Back again? I am beginning to think you enjoy this.\"</em> The horror is not in the event but in the recognition: this is a pattern now. The Acolyte is being <em>recycled</em>. The mutation that manifests should be described in visceral detail.</li><li><strong>3rd Death — Horror.</strong> The vision is different. The Emperor's light is barely visible — a guttering candle in an infinite dark. The Slaaneshi presence is enormous, suffocating, and it does not whisper — it <em>speaks</em>, clearly and with terrible intimacy, as though it knows the Acolyte better than they know themselves. The return is agonising and prolonged. The Major Mutation and Characteristic loss should be described as the body being <em>rebuilt wrong</em> — Slaanesh is no longer returning the original, but something approximating it. The other Acolytes should be able to see that their companion is becoming something else.</li><li><strong>4th Death — Finality.</strong> There is no vision. There is no return. The body simply stops, and after 1d10 rounds of tense waiting, nothing happens. Strahd says nothing. The silence is the worst part. The soul is gone, and everyone at the table knows where it went.</li></ul>"
                },
                "_id": "rule01deathexp01"
            },
            {
                "name": "Replacement Acolytes",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Replacement Acolytes — Cell Sigma-Raven-IX-Beta</h2><p>When an Acolyte is permanently lost — whether through a fourth death, an accumulation of corruption that renders them unplayable, or a mutation so severe that continued service is impossible — the player needs a new character. Barovus does not receive willing visitors, but Inquisitor Thorne planned for the worst.</p><h3>Cell Sigma-Raven-IX-Beta</h3><p>Inquisitor Aldric Thorne, ever cautious, dispatched a secondary cell to shadow the primary team. <strong>Cell Sigma-Raven-IX-Beta</strong> was aboard the <em>Dawn's Reproach</em> when it was pulled away by warp currents during the Vessel of Lament incident. Their ship, too, was eventually drawn through the rift and crashed on Barovus — scattered, battered, and alone.</p><p>The secondary cell consists of up to two operatives (matching the maximum number of replacements). They are fully trained Inquisitorial Acolytes with their own backgrounds, motivations, and personalities — but they have no knowledge of Barovus beyond what fragmentary data was in their mission briefing (which assumed the primary cell would handle the investigation).</p><h3>How Replacements Arrive</h3><p>The GM has several options for introducing a replacement Acolyte. Choose the method that best fits the current narrative:</p><ul><li><strong>The Second Crash Site.</strong> Rumours reach the party of another Imperial vessel that came down in the wilderness. The replacement Acolyte is found at the crash site, injured, disoriented, and already showing signs of warp-exposure. This option works well early in the campaign and provides a natural side mission.</li><li><strong>Stumbling into Civilisation.</strong> The replacement Acolyte has been surviving alone in the Barovian wilderness for days or weeks. They stumble into whatever settlement the party currently occupies — Barovus Village, Fortress Vallak, or the Vostra encampment — dazed, starving, and terrified. This is the simplest option and requires minimal setup.</li><li><strong>Found in Stasis.</strong> The <em>Dawn's Reproach</em>'s emergency stasis pods were scattered during the crash. The party discovers an intact pod during their travels, and the replacement Acolyte emerges from cryo-sleep with no knowledge of how much time has passed. This option adds a sense of disorientation and provides a clean narrative break.</li><li><strong>Warp-Delivered.</strong> In rare and disturbing cases, the warp rift itself deposits the replacement Acolyte directly — they materialise in a burst of iridescent light, screaming, with no memory of the transit. This option is unsettling and should be used sparingly, as it raises uncomfortable questions about whether the replacement is truly who they claim to be. (They are. Probably.)</li><li><strong>Strahd's Introduction.</strong> Most unsettling of all: Strahd personally delivers the replacement Acolyte to the party. He found them wandering his domain, \"took them in,\" and now returns them as a gesture of courtesy. The replacement is unharmed but deeply shaken. Strahd already knows their name.</li></ul><h3>Mechanical Rules</h3><table><thead><tr><th>Rule</th><th>Detail</th></tr></thead><tbody><tr><td><strong>Maximum Replacements</strong></td><td>2 per campaign. After two replacements have been introduced, permanent death is final — no further reinforcements exist on Barovus.</td></tr><tr><td><strong>Starting Equipment</strong></td><td>Standard starting equipment for their career only. No relics, no recovered gear, no special items. They crashed on a daemon world with whatever was in their kit bag.</td></tr><tr><td><strong>Arrival Corruption</strong></td><td><strong>1d10 Corruption Points</strong> upon arrival. The crash through the warp rift and exposure to Barovus's ambient corruption have already begun their work.</td></tr><tr><td><strong>Arrival Insanity</strong></td><td><strong>1d5 Insanity Points</strong> upon arrival. The experience of crash-landing on a daemon world, alone, is not conducive to mental health.</td></tr><tr><td><strong>Experience Points</strong></td><td>The replacement Acolyte begins with the same total XP as the lowest-XP surviving party member, minus 500 XP. They are competent but less experienced than the established team.</td></tr><tr><td><strong>Prior Encounters</strong></td><td>At the GM's discretion, the replacement may have encountered one of Barovus's hazards during their time alone — mutants, revenants, the fog. This provides narrative flavour and explains their battered state but should <strong>not</strong> grant significant mechanical advantage.</td></tr></tbody></table><h3>Integration Guidance</h3><p>Introducing a new character mid-campaign requires care to maintain narrative momentum and group cohesion:</p><ul><li><strong>What They Know:</strong> The replacement Acolyte knows they were assigned to shadow the primary cell. They know the names and general descriptions of the original team. They know their mission was to investigate a derelict vessel — they do <em>not</em> know about Strahd, the warp rift's true nature, or the specific horrors of Barovus. The existing party must bring them up to speed, which is itself a useful roleplaying scene.</li><li><strong>Establishing Trust:</strong> The surviving Acolytes have been through hell. A new face — arriving fresh, uncorrupted, and full of Inquisitorial confidence — may provoke resentment, suspicion, or desperate relief. Encourage the players to roleplay this friction. The replacement is not a convenient game mechanic; they are a person arriving in a nightmare.</li><li><strong>Strahd's Interest:</strong> Strahd will take note of any new arrival. He may greet the replacement personally, welcoming them to Barovus with his characteristic courtesy. He will already know their name. This should unsettle both the new player and the established group — it reinforces that nothing happens on Barovus without Strahd's knowledge.</li><li><strong>Pacing:</strong> Introduce the replacement during a moment of relative calm — between major encounters, at a settlement, during a travel sequence. Do not drop a new character into the middle of a dungeon crawl or a boss fight. Give the player time to establish their character before throwing them into danger.</li></ul><h3>Player Guidance — Resurrection vs. Replacement</h3><p>When a character dies for the third time and returns as a corruption-riddled, mutation-scarred shadow of their former self, the player faces a difficult question: <em>is this character still worth playing?</em></p><ul><li><strong>Suggest replacement when:</strong> The Acolyte's Corruption total is approaching mutation/malignancy thresholds, the accumulated mutations make the character difficult to roleplay or mechanically unviable, or the player expresses that the character's story feels \"done.\"</li><li><strong>Encourage continued play when:</strong> The player is invested in exploring their character's descent, the corruption and mutation create interesting narrative tension, or the character has unresolved story threads (a personal connection to an NPC, an oath unfulfilled, a mystery unsolved).</li><li><strong>Never force the choice.</strong> This is the player's decision. Some players will cling to a beloved character through three deaths and mounting horror. Others will welcome a fresh start. Both approaches are valid, and the GM should support whichever the player chooses.</li></ul>"
                },
                "_id": "rule01replcmt001"
            },
            {
                "name": "GM Guide — Running Death",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>GM Guide — Running Death on Barovus</h2><p>Death is one of the most powerful narrative tools in this campaign. Used well, it reinforces every theme that <em>Dread of Zarovich</em> is built on — corruption, despair, the erosion of identity, and the terrible price of survival in a place where even the God-Emperor's protection falters. Used poorly, it becomes a frustrating revolving door that strips death of meaning. This guide will help you navigate the difference.</p><h3>When Death Should Happen</h3><p>Dark Heresy 2nd Edition is a lethal system. Acolytes can die to a single unlucky critical hit, a failed Toughness Test against poison, or a poorly-timed encounter with an enemy two tiers above their weight class. This lethality is a feature, not a bug — but <em>Dread of Zarovich</em> is a campaign that needs its protagonists to survive long enough to reach the final confrontation.</p><p>The Warp Reclamation mechanic exists to bridge this tension. It allows death to be <strong>meaningful without being terminal</strong> (until the fourth time). But the GM must still exercise judgment about when to let the dice speak and when to intervene:</p><ul><li><strong>Let death happen</strong> when it results from player decisions — charging recklessly into a fight, splitting the party in dangerous territory, ignoring warnings, or underestimating an enemy. Consequence is the foundation of tension.</li><li><strong>Let death happen</strong> during major set-piece encounters — the Vessel of Lament boss, the assault on Zarovich Spire, the final battle with Strahd. These are moments where the stakes should be real and the Warp Reclamation mechanic earns its place.</li><li><strong>Consider pulling punches</strong> during random encounters or travel events. A character dying to a wandering pack of plague revenants on a routine journey feels arbitrary and wastes a resurrection that should be spent on something dramatic.</li><li><strong>Consider pulling punches</strong> when a death would occur due to a rules misunderstanding, an encounter that was accidentally overtuned, or a situation where the player had no meaningful agency in the outcome.</li><li><strong>Never pull punches</strong> when the players have been explicitly warned. If Van Richten tells them Baba Lysaga is death on two legs and they march into the Drowned Ruins at half strength, that is a choice with consequences.</li></ul><h3>Strahd's Reactions to Death</h3><p>Strahd's commentary after each resurrection is one of the campaign's most effective recurring narrative beats. It reinforces his omniscience, his personality, and the horror of the Acolytes' situation. Prepare these moments in advance — they should feel deliberate and unsettling, not improvised.</p><table><thead><tr><th>Death</th><th>Strahd's Tone</th><th>Delivery Method</th><th>Example Response</th></tr></thead><tbody><tr><td><strong>1st</strong></td><td>Genuine interest, almost admiration</td><td>A servitor-skull drifts to the recovering Acolyte and plays a recorded message in Strahd's voice. The recording is fresh — made moments ago.</td><td><em>\"You survived the return. Most do not retain their sanity. I look forward to seeing what you do with your borrowed time.\"</em></td></tr><tr><td><strong>2nd</strong></td><td>Amusement tinged with contempt</td><td>A handwritten note materialises in the Acolyte's pocket. The handwriting is elegant, the paper faintly perfumed. It was not there a moment ago.</td><td><em>\"Again? The Prince of Pleasure grows fond of you. That should terrify you more than dying ever could.\"</em></td></tr><tr><td><strong>3rd</strong></td><td>Cold, clinical assessment</td><td>A psychic whisper delivered directly into the Acolyte's mind — intimate, invasive, impossible to ignore. Requires a Willpower Test to avoid crying out.</td><td><em>\"You are becoming something other than what you were. I can smell the change. Do you still serve your Emperor, or does something else drive you now?\"</em></td></tr><tr><td><strong>4th (final)</strong></td><td>Silence</td><td>Nothing. No message, no note, no whisper. The body lies still. After 1d10 rounds, it becomes clear that no return is coming. Strahd does not acknowledge the death at all. This is worse than any taunt.</td><td>—</td></tr></tbody></table><p><strong>Timing:</strong> Strahd's response should arrive within minutes of the resurrection — not immediately (give the scene room to breathe), but soon enough that the Acolyte has barely caught their breath before the Lord-Governor makes his presence felt. The message should arrive during a quiet moment: while the party tends the Acolyte's wounds, while they catch their breath, while they think — just for a moment — that the worst is over.</p><h3>Party Morale and Pacing</h3><p>Character death is emotionally taxing for players as well as characters. The GM should be attentive to the table's mood and pace the campaign accordingly:</p><ul><li><strong>After a first death:</strong> Give the party a period of relative safety. Let them reach a settlement, find shelter, or encounter a friendly NPC. The players need time to process what happened and to roleplay their characters' reactions. Do not immediately follow a death with another high-lethality encounter.</li><li><strong>After a second death:</strong> The tone at the table may shift from shock to grim determination or creeping dread. This is good — lean into it. But watch for player frustration. If the same player has died twice, ensure they have moments of agency and competence between deaths. Nobody wants to feel like a punching bag.</li><li><strong>After a third death:</strong> This is a critical moment. The character is now heavily corrupted, mutated, and diminished. The player may feel their character is no longer viable or enjoyable. Have a private conversation — do they want to continue, or would they prefer a replacement? Either answer is valid.</li><li><strong>After a permanent death:</strong> Treat this with gravity. Allow a moment of silence at the table if it feels appropriate. The other characters should have the opportunity to react — to mourn, to rage, to pray. Then, when the moment has passed, discuss replacement options with the player privately.</li></ul><h3>Mechanical FAQ</h3><table><thead><tr><th>Question</th><th>Answer</th></tr></thead><tbody><tr><td><strong>What happens to gear on death?</strong></td><td><strong>1st death:</strong> Only the weapon that dealt the killing blow is destroyed — dissolved by warp energy during reclamation. All other gear is retained. <strong>2nd death:</strong> All carried gear is lost — scattered across the warp and deposited in random locations on Barovus. The party may find individual items later at the GM's discretion. <strong>3rd death:</strong> All gear is lost permanently. The Acolyte returns with starting equipment only.</td></tr><tr><td><strong>Can an Acolyte refuse resurrection?</strong></td><td>Yes. At any point, a player may declare that their Acolyte rejects the return and clings to the Emperor's light. The character is permanently dead, but their soul is <strong>not</strong> claimed by Slaanesh — it escapes through faith and will. This is a noble death. The player then rolls a replacement Acolyte if replacements remain.</td></tr><tr><td><strong>What if the whole party dies simultaneously?</strong></td><td>Strahd brings them <strong>all</strong> back. Every single one. He is not done playing. Each Acolyte suffers the resurrection costs appropriate to their current death count. If any Acolyte is on their 4th death, they are permanently lost — but the rest return. Strahd may appear personally after a TPK, standing over the gasping, broken Acolytes, and deliver a speech about how disappointing they have been. Then he walks away and leaves them to pick up the pieces.</td></tr><tr><td><strong>Does resurrection count as warp exposure for mutation purposes?</strong></td><td>No — not separately. The Corruption Points gained from resurrection already represent the warp exposure and its mutagenic effects. Do not double-dip by also rolling for warp exposure mutations on top of the CP gained. The mutations specified in the resurrection cost table (Minor at 2nd death, Major at 3rd) are the direct mechanical expression of this exposure.</td></tr><tr><td><strong>Can NPCs be resurrected by the Warp Reclamation?</strong></td><td><strong>No.</strong> The rift only recycles the Acolytes because Slaanesh is specifically interested in them — Inquisitorial operatives are rare, potent souls, and the Prince of Pleasure savours their corruption. Ordinary inhabitants of Barovus die and stay dead. <strong>Exception — Ireena Kolyana:</strong> Ireena's soul is bound to the reincarnation cycle that sustains Strahd's pact. If Ireena dies, she does not return via the Warp Reclamation — she is <em>reborn</em>, somewhere, somewhen, as a new incarnation of Tatyana. This is a fundamentally different process and is not subject to the resurrection rules. If Ireena dies during the campaign, she is gone for the remainder of the adventure. Her death should be devastating and final.</td></tr><tr><td><strong>What about relics? Are they destroyed on death?</strong></td><td>The three key relics — <strong>Dawn's Edge</strong>, the <strong>Rosette of Saint Markovia</strong>, and the <strong>Tome of Strahd</strong> — are protected by their own spiritual significance. If an Acolyte carrying a relic dies, the relic is not destroyed or scattered. It remains with the body (or near the place of death) and can be recovered by the party. These items are too important to lose to a game mechanic — they are the campaign's win condition.</td></tr><tr><td><strong>Can resurrection be prevented?</strong></td><td>Under normal circumstances, no — the Warp Reclamation is automatic and cannot be blocked by mundane or even psychic means. However, if the Acolytes destroy the Heart of the Spire and defeat Strahd, the warp rift begins to collapse, and the Reclamation ceases to function. Any death after Strahd's defeat is permanent. Plan accordingly.</td></tr></tbody></table></div></div>"
                },
                "_id": "rule01gmguide001"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "ruleCategory": "death"
            }
        },
        "_id": "6bd82c0b69a6b0f5"
    },
    {
        "name": "Resupply and Survival — The Logistics of Damnation",
        "pages": [
            {
                "name": "Rules",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<div class=\"doz-vox-transmission\"><div class=\"vox-header\">CAMPAIGN RULES — RESUPPLY AND SURVIVAL</div><div class=\"vox-body\"><p><em>\"Where does ammunition come from on a world sealed by the warp for three centuries? The same place hope comes from: nowhere reliable, and at a price you can't afford.\"</em><br>— Inquisitor Van Richten, private notes</p><p>The Acolytes arrive on Barovus with whatever they carried off the Vessel of Lament. There is no resupply chain. There is no Munitorum depot. There is no orbital drop pod descending from the <em>Dawn's Reproach</em> with crates of fresh lasgun power packs and medikit refills. Everything the Acolytes need to survive — ammunition, medicine, food, replacement equipment, cybernetics maintenance — must be sourced from Barovus itself, and Barovus is a world that has been cannibalising its own infrastructure for three centuries.</p><p>The Game Master should track resources with moderate granularity. Precise round-by-round ammunition counting is unnecessary (except during critical engagements), but the players should always be aware that their supplies are finite. The question <em>\"Do we have enough ammo for this fight?\"</em> should be a regular feature of tactical planning. Scarcity drives tension, and tension drives horror.</p><h3>The Four-Tier Supply System</h3><p>All resupply on Barovus is governed by a four-tier framework. Each tier represents a different source of equipment, each with its own costs, risks, and moral implications. The tiers are not mutually exclusive — a resourceful warband will draw from all four simultaneously.</p><table><thead><tr><th>Tier</th><th>Source</th><th>Key Mechanic</th><th>Risk / Cost</th></tr></thead><tbody><tr><td><strong>1</strong></td><td><strong>Vostra Trade</strong></td><td>Commerce Tests modified by relationship track (Hostile → Suspicious → Neutral → Friendly → Allied)</td><td>Currency expenditure; relationship management; limited rare stock</td></tr><tr><td><strong>2</strong></td><td><strong>Scavenging &amp; Crafting</strong></td><td>Awareness/Search/Tech-Use Tests with quality tiers (Poor / Moderate / Good)</td><td>Time; unreliable results; warp contamination at some sites; ammo reloading may produce unreliable rounds (10% jam)</td></tr><tr><td><strong>3</strong></td><td><strong>Faction Rewards</strong></td><td>Quest completion and relationship building with 6 factions</td><td>Time investment; moral compromise (especially Krezk: 1d5 CP per visit); political entanglement</td></tr><tr><td><strong>4</strong></td><td><strong>Strahd's Gifts</strong></td><td>Offered by Strahd at moments of maximum temptation</td><td><strong>1 CP per acceptance</strong>; WP Test or rationalise (-10 WP vs Domination for 1d5 days); escalating conditions after 3+ gifts</td></tr></tbody></table><h3>Tier 1 — Vostra Trade (Summary)</h3><p>The Vostra are the only reliable merchants on Barovus. Their caravans move freely through the mists. All purchases require a <strong>Commerce Test</strong> modified by the Acolytes' relationship standing. Track standing as: <strong>Hostile → Suspicious → Neutral → Friendly → Allied</strong>. Reaching Friendly or Allied unlocks rarer goods (bolt ammunition, special weapons, warp-resistant gear) and reduces prices by 25%.</p><p><strong>Available inventory ranges from:</strong> ration packs, las charge packs, autogun magazines, stub ammo, medikits, stimms, glow-globes, and mono-knives (Common/Average) through frag/krak grenades, de-tox, rebreathers (Scarce) to auspex scanners and blessed water (Rare).</p><h3>Tier 2 — Scavenging &amp; Crafting (Summary)</h3><p><strong>Battlefield Salvage:</strong> After combat vs armed opponents, 10 minutes searching yields salvage based on test results — from 1d5 random rounds (Routine Awareness) to 2d10 compatible rounds with functional weapons and gear (Hard Search).</p><p><strong>Ammunition Reloading:</strong> Trade (Armourer) skill. Success: 2d10 rounds/hour. Failure: ammunition produced but unreliable (10% jam rate on 96–00). Failure by 3+ DoF: materials wasted; natural 00 causes 1d10 E explosion.</p><p><strong>Location Salvage:</strong> Specific sites yield unique resources — the Vessel of Lament wreckage (ship components, 1d10 CP from warp contamination), Fortress Vallak armoury (military-grade ammo with Burgomaster's permission), the Fallen Astartes Outpost (limited bolter ammunition, sacred oils), and the Crashed Munitorum Transport (a one-time major cache).</p><h3>Tier 3 — Faction Rewards (Summary)</h3><p>Six factions offer resources in exchange for service:</p><ul><li><strong>Recaf Distillery (Martikovs):</strong> Unlimited rations, blessed recaf (+5 to next Corruption Test), Thrones</li><li><strong>Inquisitor Van Richten:</strong> Blessed ammunition (1d10 rounds/visit), +20 Forbidden Lore (Warp) on Strahd research, tactical advice</li><li><strong>Silver Drakes Outpost:</strong> Sacred oils (Sanctified quality, 24hrs), +10 WP within the outpost, bolter rounds (2d5, once only)</li><li><strong>Fortress Vallak Armory:</strong> Standard military ammo (las/autogun, unlimited basic), flak armour, 1d5 frag grenades/visit</li><li><strong>Krezk / Magos Abaron:</strong> Cybernetics maintenance, full medical treatment, de-tox/stimms — <strong>each visit costs 1d5 CP</strong></li><li><strong>Vostra / Madam Eva:</strong> Trade at Friendly prices (-25%), one free rare item per major Vostra quest, safe passage through the mists</li></ul><h3>Tier 4 — Strahd's Gifts (Summary)</h3><p>Strahd is generous. This is one of the most disturbing things about him. At moments of maximum psychological impact, he provides genuine, useful supplies — ammunition, medikits, weapons, food. The items are not warp-tainted (that would defeat the purpose). The corruption comes from the act of accepting aid from the enemy.</p><p><strong>Cost:</strong> 1 CP per gift accepted. <strong>Challenging (+0) Willpower Test</strong> or rationalise the compromise (-10 WP vs Domination for 1d5 days). After 3+ gifts accepted, Strahd attaches escalating conditions: <em>\"A small favour...\"</em></p><h3>Cybernetics Maintenance</h3><p>Every <strong>30 days</strong>, each cybernetic augmentation requires maintenance. Without it:</p><ul><li><strong>Days 31–45:</strong> Minor malfunctions (cosmetic, unsettling). No mechanical penalty.</li><li><strong>Days 46–60:</strong> <strong>-10 penalty</strong> to all Tests using the augmetic.</li><li><strong>Days 61+:</strong> Total failure. Dead weight until repaired.</li></ul><p><strong>Options:</strong> Magos Abaron (1d5 CP), Field Repair (Hard -20 Tech-Use, extends cycle 15 days), Scavenged Parts (Very Hard -30 Tech-Use, full reset but cosmetically altered).</p><p><em>See companion pages for full rules on each tier, faction reward details, and GM guidance on managing scarcity.</em></p></div></div>"
                },
                "_id": "b89253320f614eec"
            },
            {
                "name": "Trade & Scavenging",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Tier 1: Vostra Trade — Full Rules</h2><p>The Vostra (the Vistani equivalent) are the only reliable merchants on Barovus. Their caravans move freely through the mists — a privilege granted by Strahd himself, for reasons even the Vostra do not fully understand. They carry trade goods, information, and contraband, and they are willing to deal with anyone who has currency, barter goods, or interesting stories.</p><h3>Finding a Vostra Caravan</h3><p>The Random Encounter Table provides Vostra Caravan encounters during travel. Additionally, the Vostra camp near the Village of Barovus is a permanent trading post, and Vostra merchants can be found at the Blue Water Inn in Fortress Vallak.</p><h3>The Relationship Track</h3><p>The GM should track the Acolytes' standing with the Vostra as a qualitative measure across five levels. Standing determines what the Vostra will sell, at what price, and how cooperative they are with requests for information and safe passage.</p><table><thead><tr><th>Standing</th><th>Description</th><th>Commerce Modifier</th><th>Price Modifier</th><th>Available Inventory</th></tr></thead><tbody><tr><td><strong>Hostile</strong></td><td>The Vostra refuse all dealings. Caravans avoid the Acolytes. Madam Eva will not grant audiences.</td><td>No Commerce Tests permitted</td><td>N/A</td><td>Nothing. The Vostra will not sell, trade, or speak with the Acolytes.</td></tr><tr><td><strong>Suspicious</strong></td><td>Grudging, minimal interaction. The Vostra will trade but with open distrust.</td><td>-20</td><td>+50% markup</td><td>Basics only: ration packs, stub ammo, glow-globes, lho-sticks. No weapons, no medical supplies.</td></tr><tr><td><strong>Neutral</strong></td><td>Default starting position. Business-like dealings, no favours.</td><td>+0</td><td>Standard prices</td><td>Standard inventory: rations, las charge packs, autogun magazines, medikits, stimms, mono-knives, micro-bead vox units, common gear.</td></tr><tr><td><strong>Friendly</strong></td><td>Genuine warmth. The Vostra share information, offer hospitality, provide warnings about dangers.</td><td>+10</td><td>-25% discount</td><td>Full standard inventory plus Scarce items: frag/krak grenades, de-tox, rebreathers. Access to bolt ammunition and special weapons when available.</td></tr><tr><td><strong>Allied</strong></td><td>The Acolytes are considered honorary Vostra. Madam Eva speaks freely. The caravans actively seek the Acolytes out to trade and share intelligence.</td><td>+20</td><td>-25% discount</td><td>Everything, including Rare items: auspex, blessed water, warp-resistant gear. One free rare item per major Vostra quest completed.</td></tr></tbody></table><h3>What Shifts the Track</h3><table><thead><tr><th>Action</th><th>Shift</th></tr></thead><tbody><tr><td>Complete a favour for the Vostra (escort a caravan, rescue a Vostra member, recover stolen goods)</td><td>+1 step</td></tr><tr><td>Earn Madam Eva's personal approval (show respect, bring gifts, honour Vostra customs)</td><td>+1 step</td></tr><tr><td>Share valuable intelligence about Strahd's movements or plans</td><td>+1 step (max once)</td></tr><tr><td>Defend a Vostra camp or caravan from attack</td><td>+1 step</td></tr><tr><td>Display open hostility toward mutants or abhumans in Vostra presence</td><td>-1 step</td></tr><tr><td>Antagonise, threaten, or insult the Vostra or their customs</td><td>-1 step</td></tr><tr><td>Steal from a Vostra caravan or camp</td><td>-2 steps</td></tr><tr><td>Harm or kill a Vostra member</td><td>Immediately set to Hostile</td></tr><tr><td>Openly serve Strahd's enemies in a way that endangers the Vostra (the Vostra maintain neutrality and fear reprisal)</td><td>-1 step</td></tr><tr><td>Strahd pressures the Vostra to cut off trade (occurs if Acolytes become too well-supplied)</td><td>-1 step (GM discretion)</td></tr></tbody></table><h3>Commerce Test Modifiers</h3><table><thead><tr><th>Modifier</th><th>Condition</th></tr></thead><tbody><tr><td>+20</td><td>Acolytes have completed a favour for the Vostra</td></tr><tr><td>+10</td><td>Acolytes have a positive relationship with Madam Eva</td></tr><tr><td>+0</td><td>Neutral relationship (default)</td></tr><tr><td>-10</td><td>Acolytes have antagonised the Vostra or displayed open hostility toward mutants</td></tr><tr><td>-20</td><td>Acolytes have harmed a Vostra or stolen from a caravan</td></tr><tr><td>-30</td><td>Acolytes are known to serve Strahd's enemies openly (reprisal fear)</td></tr></tbody></table><h3>Available Goods — Full Price List</h3><table><thead><tr><th>Item</th><th>Availability</th><th>Price (Thrones)</th><th>Notes</th></tr></thead><tbody><tr><td>Ration Packs (5)</td><td>Common</td><td>10</td><td>Standard Imperial, sealed. 1 week supply for one Acolyte.</td></tr><tr><td>Laspistol Charge Pack</td><td>Common</td><td>15</td><td>Compatible with most Imperial las-weapons</td></tr><tr><td>Autogun Magazine</td><td>Common</td><td>20</td><td>Standard calibre, 30 rounds</td></tr><tr><td>Stub Revolver Ammo (12)</td><td>Common</td><td>8</td><td>Low-tech but reliable in warp-heavy conditions</td></tr><tr><td>Frag Grenade</td><td>Scarce</td><td>50</td><td>Vostra stockpile is limited; 1d5 available per caravan</td></tr><tr><td>Krak Grenade</td><td>Scarce</td><td>75</td><td>Rarer still; 1d5-2 available (minimum 0)</td></tr><tr><td>Medikit (Refill)</td><td>Common</td><td>25</td><td>Restores one medikit to full charges</td></tr><tr><td>De-tox (1 dose)</td><td>Scarce</td><td>40</td><td>High demand on Barovus; the Vostra charge accordingly</td></tr><tr><td>Stimm (1 dose)</td><td>Average</td><td>30</td><td>Standard combat stimulant</td></tr><tr><td>Micro-bead Vox Unit</td><td>Average</td><td>35</td><td>Short-range personal comms</td></tr><tr><td>Glow-globe</td><td>Common</td><td>5</td><td>Essential for lower-light areas</td></tr><tr><td>Rebreather</td><td>Scarce</td><td>60</td><td>Useful against miasma and toxic environments</td></tr><tr><td>Mono-knife</td><td>Average</td><td>20</td><td>Standard utility blade</td></tr><tr><td>Auspex</td><td>Rare</td><td>150</td><td>Occasionally available; <strong>Hard (-20) Commerce</strong> to find one</td></tr><tr><td>Obscura / Lho-sticks</td><td>Common</td><td>5–15</td><td>Recreational; no mechanical benefit but useful for NPC barter</td></tr><tr><td>Blessed Water (1 vial)</td><td>Rare</td><td>100</td><td>Sanctified by a Ministorum priest; 1d5 E to daemons, ignoring armour (single use)</td></tr></tbody></table><hr><h2>Tier 2: Scavenging &amp; Crafting — Full Rules</h2><p>Barovus is littered with the detritus of three centuries of Imperial habitation, military deployment, and slow collapse. Ammunition caches, abandoned vehicles, dead soldiers' kits, and forgotten supply drops are scattered across the landscape. Finding them requires effort, time, and luck.</p><h3>Battlefield Salvage</h3><p>After any combat encounter against armed opponents (Strahd's guards, PDF remnants, cultists), Acolytes may spend <strong>10 minutes</strong> searching the area. The quality of salvage depends on the test result and the opponents faced:</p><table><thead><tr><th>Test</th><th>Quality Tier</th><th>Typical Yield</th></tr></thead><tbody><tr><td><strong>Routine (+20) Awareness</strong></td><td>Poor</td><td>1d5 random rounds of ammunition (may not fit Acolytes' weapons), damaged equipment (50% functional)</td></tr><tr><td><strong>Challenging (+0) Search</strong></td><td>Moderate</td><td>1d10 compatible rounds, functional basic weapon or piece of gear, 1d5 Thrones of barter goods</td></tr><tr><td><strong>Hard (-20) Search</strong></td><td>Good</td><td>2d10 compatible rounds, functional weapon in good condition, medikit or grenade, 2d10 Thrones</td></tr></tbody></table><h3>Location-Specific Salvage</h3><p>Certain locations on Barovus contain salvageable resources beyond what random encounters provide:</p><table><thead><tr><th>Location</th><th>Available Salvage</th><th>Test Required</th></tr></thead><tbody><tr><td>Vessel of Lament wreckage</td><td>Ship components, emergency supplies, damaged void-suit parts</td><td><strong>Challenging (+0) Tech-Use</strong>; 1d10 CP from lingering warp contamination</td></tr><tr><td>Fortress Vallak armoury (with permission)</td><td>Limited military-grade ammo, basic weapons, flak armour</td><td><strong>Commerce or Fellowship</strong> Test vs. Burgomaster</td></tr><tr><td>Abandoned vehicles (random encounter)</td><td>Fuel cells, tools, emergency rations, occasional weapons</td><td><strong>Ordinary (+10) Tech-Use</strong> to access</td></tr><tr><td>Fallen Astartes Outpost</td><td>Bolter ammo (limited), Astartes-grade components (need modification), sacred oils</td><td><strong>Hard (-20) Search</strong>; picked over for centuries</td></tr><tr><td>Battlefield sites</td><td>See Battlefield Salvage table above</td><td>—</td></tr><tr><td>Empyrean Vault antechamber</td><td>Xenos components (no Imperial compatibility), psycho-reactive materials</td><td><strong>Very Hard (-30) Forbidden Lore (Xenos)</strong> to identify anything useful</td></tr><tr><td>Crashed Munitorum Transport</td><td>Major one-time cache: 12 las charge packs, 8 autogun mags, 2 bolt pistol mags, 6 frags, 2 kraks, 3 medikits, 20 ration packs, 2 flak sets, 1 carapace plate, 4 micro-beads, 1 magnoculars, 1 auspex</td><td><strong>Challenging (+0) Security</strong> to unlock; guarded by warp-mutant scavengers</td></tr></tbody></table><h3>Ammunition Reloading</h3><p>An Acolyte with the <strong>Trade (Armourer)</strong> Skill may attempt to reload spent ammunition casings. This requires a quiet workspace, basic tools, and raw materials (gunpowder components can be salvaged from Barovus's agri-chemical stores with a <strong>Challenging (+0) Trade (Armourer)</strong> Test).</p><table><thead><tr><th>Result</th><th>Effect</th></tr></thead><tbody><tr><td><strong>Success</strong></td><td>Produces <strong>2d10 rounds</strong> of reloaded ammunition per hour of work.</td></tr><tr><td><strong>Failure</strong></td><td>Ammunition produced but unreliable. Each reloaded round has a <strong>10% chance of jamming</strong> when fired (on a natural roll of 96–00, the weapon jams as per the Unreliable weapon quality).</td></tr><tr><td><strong>Failure by 3+ DoF</strong></td><td>Materials wasted. A catastrophic failure (natural 00) causes a minor explosion: <strong>1d10 E damage</strong> to the Acolyte, no armour.</td></tr></tbody></table><h3>Field Repairs</h3><p>Damaged equipment recovered from salvage or combat can be repaired with a <strong>Tech-Use</strong> Test. The difficulty depends on the extent of the damage:</p><table><thead><tr><th>Damage Level</th><th>Test Difficulty</th><th>What Can Be Repaired</th></tr></thead><tbody><tr><td>Minor (cosmetic, 50% functional)</td><td><strong>Ordinary (+10)</strong></td><td>Scratched optics, loose fittings, depleted power cells (if replacements available)</td></tr><tr><td>Moderate (functional but degraded)</td><td><strong>Challenging (+0)</strong></td><td>Jammed mechanisms, corroded contacts, cracked housings, worn barrel linings</td></tr><tr><td>Severe (non-functional)</td><td><strong>Hard (-20)</strong></td><td>Shattered components, burnt-out power systems, structural damage. Requires scavenged parts.</td></tr><tr><td>Destroyed</td><td>Cannot be repaired</td><td>Melted slag, warp-corrupted materials, catastrophic structural failure</td></tr></tbody></table><h3>Improvised Equipment</h3><p>In extremis, Acolytes may construct improvised weapons and tools from available materials. All improvised equipment is treated as <strong>Poor Craftsmanship</strong> (Unreliable quality for weapons; -10 to Tests for tools). The GM should adjudicate what can be reasonably constructed from available salvage — a sharpened pipe is a plausible improvised weapon; an improvised plasma gun is not.</p><p>Improvised items require a <strong>Challenging (+0) Trade (appropriate speciality)</strong> or <strong>Hard (-20) Tech-Use</strong> Test and at least 1 hour of work. Failure wastes the materials.</p>"
                },
                "_id": "rule02tradscv001"
            },
            {
                "name": "Faction Rewards & Strahd's Gifts",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>Tier 3: Faction Rewards — Full Rules</h2><p>The settlements and factions of Barovus have resources they will share — but only in exchange for service. The Acolytes cannot simply requisition supplies; they must <em>earn</em> them through the completion of quests, the resolution of crises, and the building of trust.</p><h3>Faction Reward Table</h3><table><thead><tr><th>Faction</th><th>Condition to Unlock</th><th>Rewards Provided</th><th>Limitations / Costs</th></tr></thead><tbody><tr><td><strong>Recaf Distillery (Martikovs)</strong></td><td>Liberate the distillery from Strahd's forces; recover at least one sacred seed</td><td>Unlimited ration packs; blessed recaf (+5 to next Corruption Test after consumption); 2d10 Thrones per visit; medicinal herbs (functions as de-tox equivalent)</td><td>Supply depends on distillery security. If the distillery is attacked again, supplies are disrupted until it is re-secured. More sacred seeds recovered = greater output.</td></tr><tr><td><strong>Inquisitor Van Richten</strong></td><td>Earn his trust — prove Inquisitorial identity, share intelligence on Strahd, demonstrate commitment to destroying the Lord-Governor</td><td>Blessed ammunition (1d10 rounds per visit, Sanctified quality); access to his research (+20 to Forbidden Lore (Warp) Tests regarding Strahd); tactical advice and intelligence on Strahd's weaknesses, lair actions, and minion dispositions; hexagrammic wards (single-use, +20 to resist one warp power)</td><td>Van Richten's blessed ammo supply is finite — he has been stockpiling for decades, but his reserves are not unlimited. After 5 visits, supply drops to 1d5 rounds per visit. His trust is fragile; any indication the Acolytes have been compromised resets the relationship.</td></tr><tr><td><strong>Fallen Astartes Outpost (Silver Drakes)</strong></td><td>Pass the Trial of Faith; activate the Beacon</td><td>Sacred oils (3 applications: grant Sanctified quality to a weapon for 24 hours); +10 to Willpower Tests within the outpost; bolter ammunition (2d5 rounds, once only); tactical counsel from the Astartes spirit-echoes regarding siege warfare and daemon-hunting</td><td>The outpost's supplies are relics, not a renewable resource. Sacred oils regenerate slowly (3 applications per week). Bolter ammo is a one-time gift. The outpost provides spiritual sustenance more than material supply.</td></tr><tr><td><strong>Fortress Vallak Armory</strong></td><td>Gain Burgomaster Vallakovich's trust <strong>OR</strong> depose him and install a sympathetic leader. Fortress Stability must be maintained.</td><td>Standard military ammunition (las and autogun, unlimited basic supply); flak armour replacements; 1d5 frag grenades per visit; basic field tools and equipment</td><td>Supply depends entirely on Fortress Vallak's Stability rating. If Stability collapses (coup, Strahd's attack, civil unrest), the armory is looted or locked down. Under Vallakovich: access requires flattery and obedience. Under Fiona: access requires complicity in her agenda.</td></tr><tr><td><strong>Krezk Biologis Facility (Magos Abaron)</strong></td><td>Complete a task for Abaron — each subsequent task escalates in moral compromise</td><td>Cybernetics maintenance (full reset of maintenance clock); medical treatment (full wound recovery); de-tox and stimms (2d5 doses per visit); Belladonna extract (grants +10 to resist specific warp effects for 24 hours); surgical services (can install or modify cybernetics)</td><td><strong>Each visit costs 1d5 Corruption Points</strong> from exposure to Abaron's increasingly heretical methods. Tasks escalate: first visit requires information or materials; subsequent visits demand biological specimens from mutants, assistance with the Bride, or delivering living subjects for \"study.\" Abaron's services are <em>never</em> free of Chaos taint.</td></tr><tr><td><strong>The Vostra / Madam Eva</strong></td><td>Maintain positive Vostra relations; complete the Tarot reading; perform favours for the clan</td><td>Access to Tier 1 trade at Friendly prices (-25%); one free piece of rare equipment per major quest completed for the Vostra; safe passage through the mists for one travel segment; intelligence on Strahd's movements and mood; warnings of incoming threats</td><td>The Vostra's cooperation depends on their Relationship Track standing. Strahd can pressure the Vostra to restrict trade if the Acolytes become too effective. The Vostra are survivors above all — they will not sacrifice themselves for the Acolytes.</td></tr></tbody></table><h3>Earning Faction Rewards — Triggers</h3><p>Each faction's generosity is triggered by specific actions and conditions. The following list covers the primary triggers, though the GM should reward creative approaches to building factional trust:</p><table><thead><tr><th>Faction</th><th>Primary Triggers</th></tr></thead><tbody><tr><td><strong>Recaf Distillery</strong></td><td>Clear the distillery of attackers; recover sacred seeds from the Warp Nexus; defend against subsequent raids; establish supply lines to other settlements (+10 Fellowship in supplied settlements)</td></tr><tr><td><strong>Van Richten</strong></td><td>Present Inquisitorial credentials; share intelligence on Strahd's weaknesses; recover the Tome of Strahd (massive trust boost); avoid compromising Van Richten's cover identity as \"Dr. Richtus\"</td></tr><tr><td><strong>Silver Drakes</strong></td><td>Complete the Trial of Faith (a spiritual challenge within the outpost); activate the Beacon; demonstrate genuine devotion to the Emperor (not just lip service); bring relics or holy items for the chapter shrine</td></tr><tr><td><strong>Fortress Vallak</strong></td><td>Resolve the Bones of Saint Andral crisis; maintain public order; support (or replace) the Burgomaster; defend the walls during attacks; attend the Festival of Joy without causing a scene</td></tr><tr><td><strong>Krezk / Abaron</strong></td><td>Deliver requested materials; provide biological specimens; assist with the Bride project; protect Krezk villagers from external threats; bring technological salvage from the Munitorum Transport or Vessel of Lament</td></tr><tr><td><strong>Vostra / Eva</strong></td><td>Escort caravans; rescue kidnapped Vostra; respect Vostra customs and superstitions; bring gifts (exotic goods, off-world curiosities, alcohol); complete the Tarot reading and pursue its guidance faithfully</td></tr></tbody></table><hr><h2>Tier 4: Strahd's Gifts — The Temptation</h2><p>Strahd is generous. This is one of the most disturbing things about him.</p><p>At his discretion — and always at the most psychologically effective moment — Strahd provides the Acolytes with supplies. A crate of ammunition left at their campsite overnight. A medikit placed on a doorstep with a handwritten note: <em>\"You will need this. — S.\"</em> A functional weapon, cleaned and oiled, left where a dead Acolyte's weapon was destroyed by warp reclamation. He does this not out of kindness but out of a predator's need to keep the hunt interesting. Weak prey bores him. Starving, under-equipped Acolytes die too quickly to provide entertainment.</p><h3>How It Works</h3><p>Strahd's gifts are <strong>genuine and useful</strong>. The ammunition fits the Acolytes' weapons. The medical supplies are functional and untainted. The food is edible, even good. The weapons are clean, oiled, and of quality manufacture. Strahd does not poison the well — that would be crude, and Strahd is never crude. The items themselves are not warp-tainted. Most are not even stolen; they are drawn from Strahd's extensive personal armoury and storehouses, maintained over centuries.</p><h3>The Cost</h3><p>Accepting Strahd's gifts is a moral compromise. Each gift accepted costs <strong>1 Corruption Point</strong>, regardless of whether the item itself is warp-tainted (most are not — that would defeat the purpose). The corruption comes from the act of accepting aid from the enemy, from the creeping dependency, from the question the Acolyte must ask themselves each time: <em>\"Does accepting this make me a collaborator?\"</em></p><p>An Acolyte who accepts a gift must pass a <strong>Challenging (+0) Willpower Test</strong> or begin to <em>rationalise</em> the acceptance:</p><table><thead><tr><th>WP Test Result</th><th>Effect</th></tr></thead><tbody><tr><td><strong>Success</strong></td><td>The Acolyte accepts the gift with full awareness of its psychological cost. 1 CP gained, no additional penalty. The Acolyte may feel guilt, revulsion, or pragmatic acceptance — good roleplay material.</td></tr><tr><td><strong>Failure</strong></td><td>The Acolyte begins to rationalise: <em>\"He's keeping us alive because he needs us,\"</em> or <em>\"We can use his resources against him.\"</em> Gains 1 CP <strong>and</strong> suffers <strong>-10 to Willpower Tests to resist Strahd's Domination ability for 1d5 days</strong>.</td></tr><tr><td><strong>Failure by 3+ DoF</strong></td><td>As above, and the Acolyte feels a genuine flicker of gratitude toward Strahd. This is deeply disturbing. The Acolyte gains an additional <strong>1d5 Insanity Points</strong> as they realise what they are becoming.</td></tr></tbody></table><h3>Escalation</h3><p>After the Acolytes have accepted <strong>three or more gifts</strong>, Strahd begins to attach conditions. Not demands — <em>requests</em>. A favour returned. Information shared. A specific NPC left unprotected. The gifts become larger and the requests become darker, and the Acolytes must decide where the line is before they cross it.</p><table><thead><tr><th>Gifts Accepted</th><th>Strahd's Behaviour</th></tr></thead><tbody><tr><td>1–2</td><td>No conditions. Pure generosity. The gifts are left anonymously or with a brief, courteous note.</td></tr><tr><td>3–4</td><td>Strahd requests minor information: <em>\"Where are you travelling next? I would hate for you to encounter anything unpleasant.\"</em> The information seems harmless.</td></tr><tr><td>5–6</td><td>Strahd requests a favour: deliver a message to a specific NPC, avoid a particular location for one day, or report on the activities of an ally. The requests are uncomfortable but not overtly evil.</td></tr><tr><td>7+</td><td>Strahd requests complicity: leave Ireena unguarded for one night. Convince Van Richten to relocate. Sabotage a faction's defences. The mask slips. The predator shows its teeth.</td></tr></tbody></table><h3>GM Guidance — When to Offer Strahd's Gifts</h3><p>Timing is everything. Strahd's gifts should appear at moments of <strong>maximum temptation</strong>:</p><ul><li><strong>After a brutal fight</strong> where the Acolytes expended significant ammunition and medical supplies</li><li><strong>When supplies are critically low</strong> and the next resupply opportunity is sessions away</li><li><strong>When morale is at its lowest</strong> — after a PC death, a moral compromise, or a failed mission</li><li><strong>Before a major challenge</strong> — Strahd wants the Acolytes equipped enough to provide entertainment</li><li><strong>After the Acolytes refuse a faction's help</strong> on moral grounds (e.g., refusing Abaron's CP cost) — Strahd fills the gap</li></ul><p>Never offer gifts when the Acolytes are well-supplied. The temptation must be real. If the players can comfortably refuse, the mechanic has no teeth.</p>"
                },
                "_id": "rule02factnrw001"
            },
            {
                "name": "GM Guide — Managing Scarcity",
                "type": "text",
                "text": {
                    "format": 1,
                    "content": "<h2>The Scarcity Philosophy</h2><p>Barovus should feel resource-starved but not frustrating. The purpose of scarcity is not to punish the players or to create a tedious inventory management minigame — it is to drive engagement with the factions, the world, and Strahd's temptation mechanic. Players should always have <strong>just enough</strong>, never plenty. They should walk into every fight doing mental arithmetic on their ammunition. They should weigh every medikit use against future need. They should look at Strahd's gifts and <em>want</em> to take them.</p><p>If the players are comfortable and well-supplied, something has gone wrong. If the players are so resource-starved that they cannot function, something has also gone wrong. The sweet spot is the razor's edge between the two: enough to survive, not enough to feel safe.</p><p><strong>The Golden Rule:</strong> Scarcity is a narrative tool, not a punishment mechanic. If tracking supplies is creating frustration rather than tension, abstract it. If the players are genuinely stuck with no resources and no way to acquire them, provide an opportunity — but make it cost something.</p><hr><h2>Cybernetics Maintenance — Full Degradation Timeline</h2><p>Acolytes with cybernetic augmentations face a unique challenge on Barovus: there are no Mechanicus facilities, no sanctified workshops, and no tech-adepts qualified to perform maintenance on Imperial cybernetics. Without regular maintenance, cybernetics degrade according to the following timeline:</p><table><thead><tr><th>Time Since Last Maintenance</th><th>Status</th><th>Mechanical Effect</th><th>Narrative Description</th></tr></thead><tbody><tr><td><strong>Days 1–30</strong></td><td>Normal Function</td><td>No penalty</td><td>The augmetic operates as designed. The Machine Spirit is content.</td></tr><tr><td><strong>Days 31–45</strong></td><td>Minor Malfunctions</td><td>No mechanical penalty. Once per session, the GM may declare a minor malfunction.</td><td>A bionic eye flickers to static for a moment. A mechadendrite spasms and knocks over a cup. A leg servo stutters on stairs. Cosmetic and unsettling — a reminder that maintenance is overdue.</td></tr><tr><td><strong>Days 46–60</strong></td><td>Degraded Function</td><td><strong>-10 penalty</strong> to all Tests that rely on the augmetic.</td><td>The augmetic is actively hindering its user. A bionic arm trembles under load. A cranial implant produces persistent tinnitus. A bionic leg drags slightly, reducing speed. The Machine Spirit is displeased.</td></tr><tr><td><strong>Days 61+</strong></td><td>Total Failure</td><td>The augmetic ceases to function entirely. It is <strong>dead weight</strong> until repaired. If the augmetic replaces a limb, the limb is useless. If it replaces an organ, the Acolyte suffers as appropriate (blindness for a bionic eye, deafness for a bionic ear, etc.).</td><td>The Machine Spirit has departed. What remains is cold metal and inert circuitry, grafted to living flesh that aches around the implant sites.</td></tr></tbody></table><h3>Maintenance Options</h3><table><thead><tr><th>Option</th><th>Test / Cost</th><th>Effect</th><th>Drawbacks</th></tr></thead><tbody><tr><td><strong>Magos Abaron (Krezk)</strong></td><td><strong>1d5 Corruption Points</strong> per visit; escalating task requirements</td><td>Full maintenance reset. Augmetic restored to Day 1 status. Abaron may also upgrade or modify the augmetic (at additional CP cost).</td><td>Each visit draws the Acolyte deeper into Abaron's web. Tasks escalate from \"bring me materials\" to \"bring me a living subject.\" The workshop is visibly heretical. Other Acolytes may object.</td></tr><tr><td><strong>Field Repair (Self-Maintenance)</strong></td><td><strong>Hard (-20) Tech-Use</strong> Test; improvised tools, no sanctified unguents</td><td>Extends the maintenance cycle by <strong>15 days</strong> (does not fully reset).</td><td>A stopgap, not a solution. Failure by 3+ DoF causes additional damage (increase malfunction severity by one step). Can be repeated, but each successive attempt without proper maintenance imposes a cumulative -5 penalty.</td></tr><tr><td><strong>Scavenged Parts</strong></td><td><strong>Very Hard (-30) Tech-Use</strong> Test; requires compatible components from servitors, vehicles, or Vessel of Lament wreckage</td><td>Fully resets the maintenance clock. The augmetic is now a hybrid of Imperial and salvaged technology.</td><td>The Machine God would not approve. Cosmetic changes (mismatched plating, unusual sounds, occasional sparks). No mechanical penalty, but excellent roleplay material. Strahd may comment on the irony.</td></tr></tbody></table><hr><h2>Ammunition Tracking</h2><p>Tracking every individual round fired is tedious for standard ammunition but important for rare and special munitions. The following system balances verisimilitude with playability:</p><h3>Standard Ammunition (Las Charge Packs, Autogun Magazines, Stub Rounds)</h3><p>Track in <strong>\"clips\"</strong> — abstract units representing one full load for a weapon. Each clip has three states:</p><table><thead><tr><th>State</th><th>Description</th><th>Mechanical Effect</th></tr></thead><tbody><tr><td><strong>Full</strong></td><td>A complete magazine, charge pack, or cylinder.</td><td>Normal operation.</td></tr><tr><td><strong>Half</strong></td><td>Roughly half expended. Transition from Full to Half after any engagement where the weapon was fired extensively (GM discretion, or after 3+ rounds of sustained fire).</td><td>Normal operation, but the Acolyte is aware they are burning through supplies.</td></tr><tr><td><strong>Empty</strong></td><td>The clip is spent. Reload or go dry.</td><td>Weapon cannot fire until a new clip is loaded. Transition from Half to Empty after another significant engagement, or on any Jam result.</td></tr></tbody></table><p><strong>Note:</strong> During critical engagements (boss fights, set-piece battles, desperate last stands), revert to tracking individual shots if the tension warrants it.</p><h3>Special Ammunition (Blessed Rounds, Bolt Shells, Sanctified Ammunition)</h3><p>Track <strong>individually</strong>. Every blessed bolt round, every sacred oil application, every Krak grenade is a precious resource that the players should count and agonise over. These are the bullets that kill the things that matter.</p><hr><h2>Ration Rules</h2><p>Barovus is a world of scarcity, and hunger is a constant companion. The following rules govern the effects of food deprivation:</p><table><thead><tr><th>Duration Without Food</th><th>Effect</th></tr></thead><tbody><tr><td><strong>1 day</strong></td><td><strong>-5 penalty</strong> to all Tests. The Acolyte is hungry, irritable, and distracted.</td></tr><tr><td><strong>3 days</strong></td><td><strong>-10 penalty</strong> to all Tests. The Acolyte gains <strong>1 level of Fatigue</strong>. Concentration wavers. Short-term memory is affected.</td></tr><tr><td><strong>7 days</strong></td><td><strong>-20 penalty</strong> to all Tests. The Acolyte gains <strong>1 Insanity Point</strong> (the mind begins to fracture under physical stress). Hallucinations are possible. The body begins cannibalising muscle.</td></tr><tr><td><strong>10+ days</strong></td><td><strong>-30 penalty</strong> to all Tests. The Acolyte gains <strong>1 additional Insanity Point per day</strong>. Without intervention (food or medical treatment), the Acolyte will die within <strong>1d5 additional days</strong>. The GM should describe the physical deterioration in unflinching detail.</td></tr></tbody></table><p><strong>Water:</strong> Dehydration is faster and more lethal. Halve all the above timelines. Barovus has water sources (rivers, rain collection, settlement wells), so dehydration should only become an issue in specific circumstances (lost in the Svalich Forest, trapped in the Empyrean Vault, stranded in the Berez marshes where the water is warp-tainted).</p><p><strong>Ration Packs:</strong> One standard Imperial ration pack provides one Acolyte with sufficient nutrition for <strong>1 day</strong>. Five packs (the standard trade unit) cover one week with a slight surplus. Ration packs are sealed and do not spoil. Locally sourced food (hunted game, foraged plants, settlement provisions) is viable but may require <strong>Ordinary (+10) Survival</strong> Tests to prepare safely — some Barovian flora and fauna are subtly warp-tainted.</p><hr><h2>Common GM Questions</h2><h3>\"How often should I give them supplies?\"</h3><p>Roughly <strong>every 2–3 sessions</strong>, a significant resupply event should occur — a Vostra caravan, a faction reward, a salvage discovery, or a Strahd gift. Between these events, the Acolytes should be managing existing resources and making hard choices about expenditure. The rhythm should be: acquire, spend carefully, run low, acquire again. If the Acolytes go more than 3 sessions without a meaningful resupply opportunity, they will begin to feel frustrated rather than tense. If they get supplies every session, scarcity loses its teeth.</p><h3>\"What if they hoard everything?\"</h3><p>Strahd notices. He always notices.</p><p>If the Acolytes accumulate a significant stockpile and refuse to engage with the supply system, Strahd takes action. Not personally — that would be beneath him — but through his agents and the environment:</p><ul><li><strong>Raids:</strong> Warp-mutants or Strahd's servitors attack the Acolytes' storage location and destroy or scatter supplies.</li><li><strong>Theft:</strong> A dominated NPC or spy steals key items overnight.</li><li><strong>Spoilage:</strong> Warp contamination causes ration packs to rot, charge packs to drain, and medikits to degrade. The Mists get into everything.</li><li><strong>Escalation:</strong> Strahd simply increases the difficulty of encounters until the Acolytes are forced to expend their reserves.</li></ul><p>The message should be clear: <em>there is no safety in surplus on Barovus.</em> The only reliable supply chain is active engagement with the world.</p><h3>\"Can they set up a base?\"</h3><p>Yes — and the GM should encourage it. A fixed base of operations gives the Acolytes a sense of investment in Barovus and makes supply management more tangible. The best candidates are:</p><ul><li><strong>The Recaf Distillery:</strong> Excellent choice. Provides food, recaf, and a defensible position. Requires clearing and securing the facility first. The Martikovs are grateful hosts.</li><li><strong>The Blue Water Inn (Fortress Vallak):</strong> Central location with access to Vostra trade and Vallak's armory. Politically complicated — the Acolytes must navigate Vallakovich or Fiona's regime.</li><li><strong>The Fallen Astartes Outpost:</strong> Spiritually significant and defensible, but remote and resource-poor. Best as a secondary safe house rather than a primary base.</li><li><strong>Van Richten's Tower:</strong> Secure and hidden, but tiny. Only suitable for a small cell. Van Richten may not appreciate permanent houseguests.</li></ul><p>A base does not solve the supply problem — it provides a place to store and manage supplies. The Acolytes still need to go out into Barovus to acquire them, which is the point.</p><h3>\"How do I balance Abaron's CP cost?\"</h3><p>Abaron's Corruption Point cost for cybernetics maintenance should <strong>sting but not be prohibitive</strong>. The 1d5 CP per visit means an average of 3 CP each time — significant but survivable. The real cost is narrative: the escalating tasks, the visible heresy of the workshop, the knowledge that each visit makes the Acolyte more complicit in Abaron's work.</p><p>For heavily augmented characters (multiple cybernetics, each on its own 30-day clock), the math becomes punishing. This is intentional. These characters face a genuine dilemma: let their augmetics degrade, attempt risky field repairs, or sell a piece of their soul to the corrupted Magos every month. There is no good answer. There is only the answer each Acolyte gives.</p><p><strong>If the CP cost threatens to push an Acolyte over 100 CP</strong> (the point of no return), the GM should make this danger explicit and ensure the player understands the stakes. This is a character-defining moment, not a gotcha. The player should choose their damnation with open eyes — or choose to let their augmetics die and adapt.</p><h3>\"What about Thrones (currency)?\"</h3><p>Imperial Thrones still function as currency on Barovus, though their value is inflated by scarcity. The Acolytes begin with whatever Thrones they carried aboard the Vessel of Lament (typically 50–100 per Acolyte at their rank). Additional Thrones can be acquired through:</p><ul><li>Salvage and barter goods (converted at Vostra caravans)</li><li>Faction rewards (the Distillery pays in Thrones)</li><li>Looting defeated enemies (Strahd's elite guards carry 2d10 Thrones; PDF troops carry 1d5)</li><li>Selling equipment the Acolytes no longer need</li></ul><p>Thrones should feel meaningful but not be the primary bottleneck. The real constraints are <em>availability</em> (having Thrones does not help if no one is selling what you need) and <em>relationships</em> (the Vostra will not trade with hostile Acolytes regardless of payment).</p>"
                },
                "_id": "rule02gmguide001"
            }
        ],
        "flags": {
            "dh2e-dread-of-zarovich": {
                "ruleCategory": "resupply"
            }
        },
        "_id": "364298670ca46980"
    }
]