[
    {
        "name": "Dawn's Edge",
        "type": "weapon",
        "img": "modules/dh2e-dread-of-zarovich/assets/tokens/dawns-edge.svg",
        "system": {
            "description": "<p><strong>Dawn's Edge</strong> is a power sword of extraordinary craftsmanship, its blade dark and inert until grasped by a hand of faith — then it ignites with a warm, humming golden light that illuminates a 20m radius, casting the first true sunlight this world has seen in four hundred years. The hilt is warm to the touch, as though something alive dwells within its machine-spirit.</p><p><em>Forged by Saint Markovia's personal artificer during the original Imperial cleansing of Barovus, centuries before the warp rift sealed the world away.</em> The blade was lost when the rift closed, entombed somewhere on the planet. It has waited, patient and undimmed, for a worthy hand.</p><p><strong>Activation:</strong> Inert until activated (Half Action, <em>Ordinary WP test</em>). While active: 20m golden light suppresses warp phenomena (<em>-10 Focus Power</em> for enemies), wielder gains <em>+10 WP vs Fear and Corruption</em>. <strong>Holy:</strong> wounds cannot be regenerated by Warp-Touched or Daemonic entities. <strong>Bane (Warp):</strong> +1d10 damage vs Daemonic/Warp-Touched targets.</p><p><strong>Against Strahd:</strong> all damage doubled, no regeneration, Strahd must test <em>WP-10</em> each turn to remain in melee. One of the three keys to his permanent destruction.</p>",
            "class": "melee",
            "range": 0,
            "rof": {
                "single": true,
                "semi": 0,
                "full": 0
            },
            "damage": {
                "formula": "1d10+10",
                "type": "energy",
                "bonus": 0
            },
            "penetration": 8,
            "reload": "",
            "weight": 3.5,
            "qualities": [
                "Power Field",
                "Balanced",
                "Holy",
                "Bane (Warp)"
            ],
            "equipped": true,
            "availability": "Unique",
            "magazine": {
                "value": 0,
                "max": 0
            },
            "craftsmanship": "common",
            "weaponGroup": "",
            "loadedAmmoId": "",
            "loadedMagazineName": "",
            "loadedRounds": [],
            "reloadProgress": 0,
            "rules": [],
            "loadType": ""
        },
        "flags": {
            "dh2e-dread-of-zarovich": {
                "category": "relic",
                "tarotItem": true
            }
        },
        "_id": "b4cc984ccbeb478d"
    },
    {
        "name": "Grief (Strahd's Power Sword)",
        "type": "weapon",
        "img": "modules/dh2e-dread-of-zarovich/assets/tokens/grief.svg",
        "system": {
            "description": "<p><strong>Grief</strong> is a master-crafted power sword of archaic Imperial design — its blade a deep, lightless black that seems to drink the illumination around it. The metal is cold to the touch, even when activated, and its edges have never dulled despite four centuries of use. The hilt is wrapped in dark leather worn smooth by a single owner's grip.</p><p><em>Strahd named this blade for what he lost the day he murdered his brother Sergei and sealed his pact with the Daemon Prince Tenebrous.</em> He has carried it every day since — through centuries of hollow rule, through every reincarnation of Tatyana he has pursued and lost. The weight of the sword is negligible. The weight of what it represents is not.</p><p><strong>Master-crafted:</strong> <em>1d10+12 E, Pen 7, Power Field, Balanced.</em> A supremely lethal weapon in Strahd's hands — wielded with WS 75 and centuries of practice.</p><p><strong>Warning:</strong> If claimed by the Acolytes, the blade functions as an excellent power sword — but it carries the psychic residue of its master. Wielding it in Strahd's presence may provoke his focused attention.</p>",
            "class": "melee",
            "range": 0,
            "rof": {
                "single": true,
                "semi": 0,
                "full": 0
            },
            "damage": {
                "formula": "1d10+12",
                "type": "energy",
                "bonus": 0
            },
            "penetration": 7,
            "reload": "",
            "weight": 3.5,
            "qualities": [
                "Power Field",
                "Balanced"
            ],
            "equipped": true,
            "availability": "Unique",
            "magazine": {
                "value": 0,
                "max": 0
            },
            "craftsmanship": "common",
            "weaponGroup": "",
            "loadedAmmoId": "",
            "loadedMagazineName": "",
            "loadedRounds": [],
            "reloadProgress": 0,
            "rules": [],
            "loadType": ""
        },
        "flags": {
            "dh2e-dread-of-zarovich": {
                "category": "npc-weapon"
            }
        },
        "_id": "36aeca01b574990c"
    },
    {
        "name": "Strahd's Inferno Pistol",
        "type": "weapon",
        "img": "modules/dh2e-dread-of-zarovich/assets/tokens/inferno-pistol.svg",
        "system": {
            "description": "<p>Integrated into the augmented musculature of Strahd's left forearm, this <strong>inferno pistol</strong> is an archaic design of pre-rift manufacture — its brass housing fused seamlessly with pale flesh and dark metal. The weapon's muzzle is concealed beneath a sliding panel of warp-infused carapace, deploying with a soft mechanical whisper when Strahd wills it.</p><p><em>Installed centuries ago by a Tech-Priest whose name Strahd no longer remembers, the weapon is a concession to pragmatism from a lord who prefers the personal touch of blade and bare hand.</em> He uses it rarely — and only when he wishes to make a point at range.</p><p><strong>Integrated:</strong> Cannot be disarmed or removed. <em>1d10+12 E, Pen 12, Range 10m, S/-/-, Clip 3.</em> Three shots before a lengthy reload — each one devastating at close range.</p><p><strong>Tactical note:</strong> Strahd deploys this weapon as a surprise, typically against targets who believe they are safe at range. Its short clip means he uses it sparingly and decisively.</p>",
            "class": "ranged",
            "range": 10,
            "rof": {
                "single": true,
                "semi": 0,
                "full": 0
            },
            "damage": {
                "formula": "1d10+12",
                "type": "energy",
                "bonus": 0
            },
            "penetration": 12,
            "reload": "2 Full",
            "weight": 0,
            "qualities": [],
            "equipped": true,
            "availability": "Unique",
            "magazine": {
                "value": 3,
                "max": 3
            },
            "craftsmanship": "common",
            "weaponGroup": "",
            "loadedAmmoId": "",
            "loadedMagazineName": "",
            "loadedRounds": [],
            "reloadProgress": 0,
            "rules": [],
            "loadType": "magazine"
        },
        "flags": {
            "dh2e-dread-of-zarovich": {
                "category": "npc-weapon"
            }
        },
        "_id": "a8bacd00f72c3894"
    },
    {
        "name": "Van Richten's Stake-Crossbow",
        "type": "weapon",
        "system": {
            "description": "<p>An ugly, functional weapon assembled from mismatched components over decades of covert work — crossbow arms salvaged from a hunter's weapon, a stock carved from Barovian darkwood, a firing mechanism adapted from a lasgun trigger assembly. Nothing about it is elegant. Everything about it works. The wood is scarred with tally marks — <em>twenty-three</em> — and each blessed hardwood bolt is hand-carved with prayer litanies in Van Richten's cramped, precise script.</p><p><em>Hand-built by Inquisitor Rudolph Van Richten over twenty-seven years of hiding on Barovus, refined through bitter trial and error against the warp-touched creatures that stalk this world.</em> It is a weapon born of patience, desperation, and faith that refused to die.</p><p><strong>Blessed, Accurate:</strong> <em>1d10+2 R, Pen 2, Range 30m, S/-/-, Clip 1.</em> Each bolt counts as holy — negating Regeneration on warp-touched targets for 1 full round. Accurate grants <em>+10 BS</em> when used with an Aim action.</p><p><strong>Tactical note:</strong> Single-shot, slow reload. Best used from ambush with careful aim — exactly how Van Richten has survived this long.</p>",
            "class": "ranged",
            "range": 30,
            "rof": {
                "single": true,
                "semi": 0,
                "full": 0
            },
            "damage": {
                "formula": "1d10+2",
                "type": "rending",
                "bonus": 0
            },
            "penetration": 2,
            "reload": "2 Full",
            "weight": 4,
            "qualities": [
                "Blessed",
                "Accurate"
            ],
            "equipped": true,
            "availability": "Unique",
            "magazine": {
                "value": 1,
                "max": 1
            },
            "craftsmanship": "common",
            "weaponGroup": "",
            "loadedAmmoId": "",
            "loadedMagazineName": "",
            "loadedRounds": [],
            "reloadProgress": 0,
            "rules": [],
            "loadType": "magazine"
        },
        "flags": {
            "dh2e-dread-of-zarovich": {
                "category": "npc-weapon"
            }
        },
        "_id": "b4fb25131cc77c1f"
    },
    {
        "name": "Boarding Cutlass (Vessel of Lament)",
        "type": "weapon",
        "system": {
            "description": "<p>An elegant curved blade of Void-Navy design, its single edge honed to a razor finish and its guard wrought in the shape of a ship's prow. The grip is wrapped in void-whale leather, darkened by age but still supple, and the pommel bears the crest of a vessel long forgotten by the Imperium. Over three hundred years old, yet preserved in near-perfect condition by the ship's residual stasis fields.</p><p><em>Recovered from the Vessel of Lament armory (UD6), this was an officer's sidearm — a gentleman's weapon for a captain who never lived to draw it in defence of his ship.</em></p><p><strong>Best Quality, Balanced:</strong> <em>1d10+3 R, Pen 0.</em> Best Quality grants <em>+10 WS</em> to attack rolls. Balanced grants <em>+10</em> to Parry tests. A reliable melee weapon in the early campaign.</p><p><strong>Tactical note:</strong> One of the best melee weapons available before the Acolytes reach Barovus. The Balanced quality makes it excellent for defensive fighting against superior foes.</p>",
            "class": "melee",
            "range": 0,
            "rof": {
                "single": true,
                "semi": 0,
                "full": 0
            },
            "damage": {
                "formula": "1d10+3",
                "type": "rending",
                "bonus": 0
            },
            "penetration": 0,
            "reload": "",
            "weight": 3,
            "qualities": [
                "Balanced"
            ],
            "equipped": true,
            "availability": "Unique",
            "magazine": {
                "value": 0,
                "max": 0
            },
            "craftsmanship": "common",
            "weaponGroup": "",
            "loadedAmmoId": "",
            "loadedMagazineName": "",
            "loadedRounds": [],
            "reloadProgress": 0,
            "rules": [],
            "loadType": ""
        },
        "flags": {
            "dh2e-dread-of-zarovich": {
                "category": "vessel-loot"
            }
        },
        "_id": "2639157c2d2cde0e"
    },
    {
        "name": "Naval Pistol (Vessel of Lament)",
        "type": "weapon",
        "system": {
            "description": "<p>A compact autopistol with brass fittings and a darkened steel frame, its grip inlaid with the crest of the Vessel of Lament — a ship that no longer exists in any Imperial registry. The weapon is heavier than a standard sidearm, built to naval specifications that prioritised reliability in the close confines of void combat. It smells faintly of preservative oil and old metal.</p><p><em>Recovered from the Vessel of Lament armory (UD6), this was a deck officer's personal sidearm — loaded, maintained, and sealed in its holster for over three centuries.</em> The magazine holds 18 rounds. There are no spares aboard. There are no spares on Barovus.</p><p><strong>Best Quality:</strong> <em>1d10+2 I, Pen 0, Range 30m, S/-/6, Clip 18.</em> Best Quality grants <em>+10 BS</em> to attack rolls. Full-auto (6) available for emergencies.</p><p><strong>Tactical note:</strong> Eighteen rounds is all you get. Every shot must count. Use semi-auto for precision — full-auto only when your life depends on volume of fire, not accuracy.</p>",
            "class": "ranged",
            "range": 30,
            "rof": {
                "single": true,
                "semi": 0,
                "full": 6
            },
            "damage": {
                "formula": "1d10+2",
                "type": "impact",
                "bonus": 0
            },
            "penetration": 0,
            "reload": "Full",
            "weight": 1.5,
            "qualities": [],
            "equipped": true,
            "availability": "Unique",
            "magazine": {
                "value": 18,
                "max": 18
            },
            "craftsmanship": "common",
            "weaponGroup": "",
            "loadedAmmoId": "",
            "loadedMagazineName": "",
            "loadedRounds": [],
            "reloadProgress": 0,
            "rules": [],
            "loadType": "magazine"
        },
        "flags": {
            "dh2e-dread-of-zarovich": {
                "category": "vessel-loot"
            }
        },
        "_id": "2b7e6fa32e667439"
    },
    {
        "name": "Sanctified Mono-Knife",
        "type": "weapon",
        "system": {
            "description": "<p>A small mono-edged blade, its grip wrapped in stained cord, its edge still impossibly keen. It radiates a faint warmth — not heat, but the echo of something deeper, like the memory of a hearthfire. The flat of the blade is scratched with crude but fervent prayers in Low Gothic, carved by an unsteady hand over what must have been years.</p><p><em>Found not in the armory but in the wreckage of the Vessel of Lament, clutched in the skeletal hand of a crewmember who died praying.</em> Through decades of proximity to desperate, genuine faith, the blade absorbed a faint aura of sanctity — the Emperor's light, filtered through suffering.</p><p><strong>Sanctified, Best Quality:</strong> <em>1d10+2 R, Pen 2.</em> Counts as blessed — wounds inflicted negate Regeneration on warp-touched targets for 1 round. Best Quality grants <em>+10 WS</em>.</p><p><strong>Tactical note:</strong> Small and unassuming, but one of the few sanctified weapons available early in the campaign. Its value against Strahd's servants far exceeds its modest damage profile.</p>",
            "class": "melee",
            "range": 0,
            "rof": {
                "single": true,
                "semi": 0,
                "full": 0
            },
            "damage": {
                "formula": "1d10+2",
                "type": "rending",
                "bonus": 0
            },
            "penetration": 2,
            "reload": "",
            "weight": 0.5,
            "qualities": [
                "Sanctified"
            ],
            "equipped": true,
            "availability": "Unique",
            "magazine": {
                "value": 0,
                "max": 0
            },
            "craftsmanship": "common",
            "weaponGroup": "",
            "loadedAmmoId": "",
            "loadedMagazineName": "",
            "loadedRounds": [],
            "reloadProgress": 0,
            "rules": [],
            "loadType": ""
        },
        "flags": {
            "dh2e-dread-of-zarovich": {
                "category": "vessel-loot"
            }
        },
        "_id": "125b2615e7da4715"
    },
    {
        "name": "Chaos Ritual Knife",
        "type": "weapon",
        "system": {
            "description": "<p>A curved blade of black obsidian, impossibly sharp, its edge catching light that is not there. The surface is warm and faintly slick to the touch — not wet, exactly, but <em>moist</em>, as though the blade itself perspires. Holding it, you hear a whisper at the base of your skull — not words, not yet, but a sound like silk tearing, like someone sighing in pleasure at the scent of blood.</p><p><em>Recovered from the Slaaneshi cult's sacrificial preparation chamber (LD5) aboard the Vessel of Lament, where it was used to prepare victims for ritual offering.</em> The blade has tasted enough suffering to develop a rudimentary hunger of its own.</p><p><strong>Chaos-tainted, Best Quality:</strong> <em>1d10+3 R, Pen 1.</em> Superior damage for a knife — the taint makes it viciously effective. Glows faintly near warp entities. <strong>Cost:</strong> carrying the blade inflicts <em>1 Corruption Point per day</em>. Putting it down voluntarily requires a <em>Challenging (+0) WP test</em>.</p><p><strong>Warning:</strong> The damage bonus is real, but so is the corruption. Every day you carry it, you become a little more like the people who made it. Decide what that is worth.</p>",
            "class": "melee",
            "range": 0,
            "rof": {
                "single": true,
                "semi": 0,
                "full": 0
            },
            "damage": {
                "formula": "1d10+3",
                "type": "rending",
                "bonus": 0
            },
            "penetration": 1,
            "reload": "",
            "weight": 0.5,
            "qualities": [
                "Chaos-tainted"
            ],
            "equipped": true,
            "availability": "Unique",
            "magazine": {
                "value": 0,
                "max": 0
            },
            "craftsmanship": "common",
            "weaponGroup": "",
            "loadedAmmoId": "",
            "loadedMagazineName": "",
            "loadedRounds": [],
            "reloadProgress": 0,
            "rules": [],
            "loadType": ""
        },
        "flags": {
            "dh2e-dread-of-zarovich": {
                "category": "vessel-loot",
                "tainted": true
            }
        },
        "_id": "c5bdf275c460ee9c"
    }
]